MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_tim.h
/**
  **********************************************************************************************************************
  * @file    stm32c5xx_ll_tim.h
  * @brief   Header file for the TIM LL module.
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  */

/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/
#ifndef STM32C5XX_LL_TIM_H
#define STM32C5XX_LL_TIM_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32c5xx.h"

/** @addtogroup STM32C5xx_LL_Driver
  * @{
  */
#if defined (TIM1)  \
 || defined (TIM2)  \
 || defined (TIM3)  \
 || defined (TIM4)  \
 || defined (TIM5)  \
 || defined (TIM6)  \
 || defined (TIM7)  \
 || defined (TIM8)  \
 || defined (TIM12) \
 || defined (TIM15) \
 || defined (TIM16) \
 || defined (TIM17)

/** @defgroup TIM_LL TIM
  * @{
  */

/* Private types -----------------------------------------------------------------------------------------------------*/
/* Private variables -------------------------------------------------------------------------------------------------*/
/** @defgroup TIM_LL_Private_Variables TIM Private Variables
  * @{
  */
static const uint8_t LL_TIM_OFFSET_TAB_CCMRx[] =
{
  0x00U   /* 0: TIMx_CH1  */
  , 0x00U   /* 1: TIMx_CH1N */
  , 0x00U   /* 2: TIMx_CH2  */
  , 0x00U   /* 3: TIMx_CH2N */
  , 0x04U   /* 4: TIMx_CH3  */
  , 0x04U   /* 5: TIMx_CH3N */
  , 0x04U   /* 6: TIMx_CH4  */
  , 0x04U   /* 7: TIMx_CH4N */
  , 0x38U   /* 8: TIMx_CH5  */
  , 0x38U    /* 9: TIMx_CH6  */
  , 0x60U    /* 10: TIMx_CH7 */
};

static const uint8_t LL_TIM_OFFSET_TAB_CCRx[] =
{
  0x00U             /* 0: CCR1 */
  , 0x04U           /* 1: CCR2 */
  , 0x08U           /* 2: CCR3 */
  , 0x0CU           /* 3: CCR4 */
  , 0x14U           /* 4: CCR5 */
  , (0x14U + 0x4U)  /* 5: CCR6 */
  , 0x3CU   /* 6: CCR7 */
};

static const uint8_t LL_TIM_SHIFT_TAB_OCxx[] =
{
  0U             /* 0: OC1M, OC1FE, OC1PE  */
  , 0U           /* 1: - NA */
  , 8U           /* 2: OC2M, OC2FE, OC2PE  */
  , 0U           /* 3: - NA */
  , 0U           /* 4: OC3M, OC3FE, OC3PE  */
  , 0U           /* 5: - NA */
  , 8U           /* 6: OC4M, OC4FE, OC4PE  */
  , 0U           /* 7: - NA */
  , 0U           /* 8: OC5M, OC5FE, OC5PE  */
  , 8U           /* 9: OC6M, OC6FE, OC6PE  */
  , 0U           /* 10: OC7M, OC7FE, OC7PE */
};

static const uint8_t LL_TIM_SHIFT_TAB_ICxx[] =
{
  0U             /* 0: CC1S, IC1PSC, IC1F */
  , 0U           /* 1: - NA */
  , 8U           /* 2: CC2S, IC2PSC, IC2F */
  , 0U           /* 3: - NA */
  , 0U           /* 4: CC3S, IC3PSC, IC3F */
  , 0U           /* 5: - NA */
  , 8U           /* 6: CC4S, IC4PSC, IC4F */
  , 0U           /* 7: - NA */
  , 0U           /* 8: - NA */
  , 0U           /* 9: - NA */
  , 0U           /* 10: - NA */
};

static const uint8_t LL_TIM_SHIFT_TAB_CCxP[] =
{
  0U             /* 0: CC1P  */
  , 2U           /* 1: CC1NP */
  , 4U           /* 2: CC2P  */
  , 6U           /* 3: CC2NP */
  , 8U           /* 4: CC3P  */
  , 10U          /* 5: CC3NP */
  , 12U          /* 6: CC4P  */
  , 14U          /* 7: CC4NP */
  , 16U          /* 8: CC5P  */
  , 20U          /* 9: CC6P  */
  , 24U          /* 10: CC7P */
};

static const uint8_t LL_TIM_SHIFT_TAB_OISx[] =
{
  0U             /* 0: OIS1  */
  , 1U           /* 1: OIS1N */
  , 2U           /* 2: OIS2  */
  , 3U           /* 3: OIS2N */
  , 4U           /* 4: OIS3  */
  , 5U           /* 5: OIS3N */
  , 6U           /* 6: OIS4  */
  , 7U           /* 7: OIS4N */
  , 8U           /* 8: OIS5  */
  , 10U          /* 9: OIS6  */
  , 11U          /* 10: OIS7 */
};

static const uint32_t LL_TIM_MASK_TAB_BKxE[] =
{
  TIM_BDTR_BKE,  /* 0: BKIN */
  TIM_BDTR_BK2E  /* 1: BKIN2 */
};

static const uint32_t LL_TIM_MASK_TAB_BKxP[] =
{
  TIM_BDTR_BKP,  /* 0: BKIN */
  TIM_BDTR_BK2P  /* 1: BKIN2 */
};

static const uint32_t LL_TIM_MASK_TAB_BKxF[] =
{
  TIM_BDTR_BKF,  /* 0: BKIN */
  TIM_BDTR_BK2F  /* 1: BKIN2 */
};

static const uint32_t LL_TIM_MASK_TAB_BKxBID[] =
{
  TIM_BDTR_BKBID,  /* 0: BKIN */
  TIM_BDTR_BK2BID  /* 1: BKIN2 */
};

/* Shift for IC config */
#define LL_TIM_IC_CONFIG_POS  (16U)
/**
  * @}
  */

/* Private constants -------------------------------------------------------------------------------------------------*/
/** @defgroup TIM_LL_Private_Constants TIM Private Constants
  * @{
  */


#define TIM_CCR5_GC5X  (TIM_CCR5_GC5C3 | TIM_CCR5_GC5C2 | TIM_CCR5_GC5C1 | TIM_CCR5_GC5C4 | \
                        TIM_CCR5_GC5C4O | TIM_CCR5_GC5C3O | TIM_CCR5_GC5C2O | TIM_CCR5_GC5C1O)

/* Mask used to set the TDG[x:0] of the DTG bits of the TIMx_BDTR register */
#define LL_TIM_DT_DELAY_1 ((uint8_t)0x7F)
#define LL_TIM_DT_DELAY_2 ((uint8_t)0x3F)
#define LL_TIM_DT_DELAY_3 ((uint8_t)0x1F)
#define LL_TIM_DT_DELAY_4 ((uint8_t)0x1F)

/* Mask used to set the DTG[7:5] bits of the DTG bits of the TIMx_BDTR register */
#define LL_TIM_DT_RANGE_1 ((uint8_t)0x00)
#define LL_TIM_DT_RANGE_2 ((uint8_t)0x80)
#define LL_TIM_DT_RANGE_3 ((uint8_t)0xC0)
#define LL_TIM_DT_RANGE_4 ((uint8_t)0xE0)

/**
  * @}
  */

/* Private macros ----------------------------------------------------------------------------------------------------*/
/** @defgroup TIM_LL_Private_Macros TIM Private Macros
  * @{
  */

/* Defines used for the bit position in the register and perform offsets */
#define LL_TIM_POSITION_BRK_SOURCE(source)  \
  (STM32_POSITION_VAL((source)) & 0x1FUL)

