MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_tim.h
/** @brief  Convert channel id into channel index.
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_TIM_CHANNEL_CH1
  *         @arg @ref LL_TIM_CHANNEL_CH1N
  *         @arg @ref LL_TIM_CHANNEL_CH2
  *         @arg @ref LL_TIM_CHANNEL_CH2N
  *         @arg @ref LL_TIM_CHANNEL_CH3
  *         @arg @ref LL_TIM_CHANNEL_CH3N
  *         @arg @ref LL_TIM_CHANNEL_CH4
  *         @arg @ref LL_TIM_CHANNEL_CH4N
  *         @arg @ref LL_TIM_CHANNEL_CH5
  *         @arg @ref LL_TIM_CHANNEL_CH6
  *         @arg @ref LL_TIM_CHANNEL_CH7
  * @retval Channel index.
  */
#define LL_TIM_GET_CHANNEL_INDEX(channel) (((channel) == LL_TIM_CHANNEL_CH1) ? 0U  :\
                                           ((channel) == LL_TIM_CHANNEL_CH1N) ? 1U :\
                                           ((channel) == LL_TIM_CHANNEL_CH2) ? 2U  :\
                                           ((channel) == LL_TIM_CHANNEL_CH2N) ? 3U :\
                                           ((channel) == LL_TIM_CHANNEL_CH3) ? 4U  :\
                                           ((channel) == LL_TIM_CHANNEL_CH3N) ? 5U :\
                                           ((channel) == LL_TIM_CHANNEL_CH4) ? 6U  :\
                                           ((channel) == LL_TIM_CHANNEL_CH4N) ? 7U :\
                                           ((channel) == LL_TIM_CHANNEL_CH5) ? 8U  :\
                                           ((channel) == LL_TIM_CHANNEL_CH6) ? 9U  : 10U)

/** @brief  Calculate the deadtime sampling period (in ps).
  * @param  tim_clk timer input clock frequency (in Hz).
  * @param  clk_div This parameter can be one of the following values:
  *         @arg @ref LL_TIM_CLOCKDIVISION_DIV1
  *         @arg @ref LL_TIM_CLOCKDIVISION_DIV2
  *         @arg @ref LL_TIM_CLOCKDIVISION_DIV4
  *         @arg @ref LL_TIM_CLOCKDIVISION_DIV8
  * @retval Deadtime sampling period (in ps).
  */
#define LL_TIM_CALC_DTS(tim_clk, clk_div) (((clk_div) == LL_TIM_CLOCKDIVISION_DIV1) ? \
                                           ((uint64_t)1000000000000U/(tim_clk)) : \
                                           ((clk_div) == LL_TIM_CLOCKDIVISION_DIV2) ? \
                                           ((uint64_t)1000000000000U/((tim_clk) >> 1U)) : \
                                           ((clk_div) == LL_TIM_CLOCKDIVISION_DIV4) ? \
                                           ((uint64_t)1000000000000U/((tim_clk) >> 2U)) : \
                                           ((uint64_t)1000000000000U/((tim_clk) >> 3U)))

/** Legacy definitions for compatibility purpose
  * @cond LEGACY_DEFINITIONS
  */
#define LL_TIM_TIM_POSITION_BRK_SOURCE(source)  LL_TIM_POSITION_BRK_SOURCE(source)
#define LL_TIM_TIM_GET_CHANNEL_INDEX(channel)  LL_TIM_GET_CHANNEL_INDEX(channel)
#define LL_TIM_TIM_CALC_DTS(tim_clk, clk_div)  LL_TIM_CALC_DTS(tim_clk, clk_div)
/**
  * @endcond
  */
/**
  * @}
  */

/* Exported types ----------------------------------------------------------------------------------------------------*/

/* Exported constants ------------------------------------------------------------------------------------------------*/
/** @defgroup TIM_LL_Exported_Constants LL TIM Constants
  * @{
  */

/** @defgroup TIM_LL_EC_GET_FLAG Get Flags Defines
  * @brief    Flags defines which can be used with LL_TIM_READ_REG function.
  * @{
  */
#define LL_TIM_SR_UIF              TIM_SR_UIF              /*!< Update interrupt flag */
#define LL_TIM_SR_CC1IF            TIM_SR_CC1IF            /*!< Capture/compare 1 interrupt flag */
#define LL_TIM_SR_CC2IF            TIM_SR_CC2IF            /*!< Capture/compare 2 interrupt flag */
#define LL_TIM_SR_CC3IF            TIM_SR_CC3IF            /*!< Capture/compare 3 interrupt flag */
#define LL_TIM_SR_CC4IF            TIM_SR_CC4IF            /*!< Capture/compare 4 interrupt flag */
#define LL_TIM_SR_CC5IF            TIM_SR_CC5IF            /*!< Capture/compare 5 interrupt flag */
#define LL_TIM_SR_CC6IF            TIM_SR_CC6IF            /*!< Capture/compare 6 interrupt flag */
#define LL_TIM_SR_CC7IF            TIM_SR_CC7IF            /*!< Capture/compare 7 interrupt flag */
#define LL_TIM_SR_COMIF            TIM_SR_COMIF            /*!< COM interrupt flag */
#define LL_TIM_SR_TIF              TIM_SR_TIF              /*!< Trigger interrupt flag */
#define LL_TIM_SR_BIF              TIM_SR_BIF              /*!< Break interrupt flag */
#define LL_TIM_SR_B2IF             TIM_SR_B2IF             /*!< Second break interrupt flag */
#define LL_TIM_SR_SBIF             TIM_SR_SBIF             /*!< System Break interrupt flag  */
#define LL_TIM_SR_BGF              TIM_SR_BGF              /*!< Break Generation flag  */
#define LL_TIM_SR_B2GF             TIM_SR_B2GF             /*!< Break2 Generation flag  */
#define LL_TIM_SR_CC1OF            TIM_SR_CC1OF            /*!< Capture/Compare 1 overcapture flag */
#define LL_TIM_SR_CC2OF            TIM_SR_CC2OF            /*!< Capture/Compare 2 overcapture flag */
#define LL_TIM_SR_CC3OF            TIM_SR_CC3OF            /*!< Capture/Compare 3 overcapture flag */
#define LL_TIM_SR_CC4OF            TIM_SR_CC4OF            /*!< Capture/Compare 4 overcapture flag */
#define LL_TIM_SR_IDXF             TIM_SR_IDXF             /*!< Index interrupt flag  */
#define LL_TIM_SR_DIRF             TIM_SR_DIRF             /*!< Direction Change interrupt flag  */
#define LL_TIM_SR_IERRF            TIM_SR_IERRF            /*!< Index Error flag  */
#define LL_TIM_SR_TERRF            TIM_SR_TERRF            /*!< Transition Error flag  */
#define LL_TIM_SR_UIOVRF           TIM_SR_UIOVRF           /*!< Update interrupt overrun flag */
#define LL_TIM_SR_ODS              TIM_SR_ODS              /*!< Output disable status */
#define LL_TIM_SR_TI1FS            TIM_SR_TI1FS            /*!< Capture 1 signal status */
#define LL_TIM_SR_TI2FS            TIM_SR_TI2FS            /*!< Capture 2 signal status */
#define LL_TIM_SR_TI3FS            TIM_SR_TI3FS            /*!< Capture 3 signal status */
#define LL_TIM_SR_TI4FS            TIM_SR_TI4FS            /*!< Capture 4 signal status */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_BREAK_ENABLE Break Enable
  * @{
  */
#define LL_TIM_BREAK_DISABLE            0x00000000U        /*!< Break function disabled */
#define LL_TIM_BREAK_ENABLE             TIM_BDTR_BKE       /*!< Break function enabled */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_BREAK2_ENABLE Break2 Enable
  * @{
  */
#define LL_TIM_BREAK2_DISABLE            0x00000000U       /*!< Break2 function disabled */
#define LL_TIM_BREAK2_ENABLE             TIM_BDTR_BK2E     /*!< Break2 function enabled */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_AUTOMATICOUTPUT_ENABLE Automatic output enable
  * @{
  */
#define LL_TIM_AUTOMATICOUTPUT_DISABLE      0x00000000U    /*!< MOE can be set only by software */
#define LL_TIM_AUTOMATICOUTPUT_ENABLE       TIM_BDTR_AOE   /*!< MOE can be set by software or automatically
                                                             at the next update event */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_IT IT Defines
  * @brief    IT defines which can be used with LL_TIM_READ_REG and LL_TIM_WRITE_REG functions.
  * @{
  */
#define LL_TIM_DIER_UIE                        TIM_DIER_UIE         /*!< Update interrupt enable */
#define LL_TIM_DIER_CC1IE                      TIM_DIER_CC1IE       /*!< Capture/compare 1 interrupt enable */
#define LL_TIM_DIER_CC2IE                      TIM_DIER_CC2IE       /*!< Capture/compare 2 interrupt enable */
#define LL_TIM_DIER_CC3IE                      TIM_DIER_CC3IE       /*!< Capture/compare 3 interrupt enable */
#define LL_TIM_DIER_CC4IE                      TIM_DIER_CC4IE       /*!< Capture/compare 4 interrupt enable */
#define LL_TIM_DIER_COMIE                      TIM_DIER_COMIE       /*!< COM interrupt enable */
#define LL_TIM_DIER_TIE                        TIM_DIER_TIE         /*!< Trigger interrupt enable */
#define LL_TIM_DIER_BIE                        TIM_DIER_BIE         /*!< Break interrupt enable */
#define LL_TIM_DIER_IDXIE                      TIM_DIER_IDXIE       /*!< Index interrupt enable */
#define LL_TIM_DIER_DIRIE                      TIM_DIER_DIRIE       /*!< Direction Change interrupt enable */
#define LL_TIM_DIER_IERRIE                     TIM_DIER_IERRIE      /*!< Index Error interrupt enable */
#define LL_TIM_DIER_TERRIE                     TIM_DIER_TERRIE      /*!< Transition Error interrupt enable */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_DMA  DMA request Defines
  * @brief    DMA request defines which can be used with LL_TIM_READ_REG and LL_TIM_WRITE_REG functions.
  * @{
  */
#define LL_TIM_DIER_UDE             TIM_DIER_UDE                    /*!< Update DMA request enable */
#define LL_TIM_DIER_CC1DE           TIM_DIER_CC1DE                  /*!< Capture/compare 1 DMA request enable */
#define LL_TIM_DIER_CC2DE           TIM_DIER_CC2DE                  /*!< Capture/compare 2 DMA request enable */
#define LL_TIM_DIER_CC3DE           TIM_DIER_CC3DE                  /*!< Capture/compare 3 DMA request enable */
#define LL_TIM_DIER_CC4DE           TIM_DIER_CC4DE                  /*!< Capture/compare 4 DMA request enable */
#define LL_TIM_DIER_COMDE           TIM_DIER_COMDE                  /*!< COM DMA request enable */
#define LL_TIM_DIER_TDE             TIM_DIER_TDE                    /*!< Trigger DMA request enable */
/**
  * @}
  *
  */

/** @defgroup TIM_LL_EC_UPDATESOURCE Update Source
  * @{
  */
#define LL_TIM_UPDATESOURCE_REGULAR   0x00000000U    /*!< Counter overflow/underflow, Setting the UG bit or Update
                                                      generation through the slave mode controller
                                                      generates an update request */
#define LL_TIM_UPDATESOURCE_COUNTER   TIM_CR1_URS    /*!< Only counter overflow/underflow generates an update request */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_COUNTERMODE Counter Mode
  * @{
  */
#define LL_TIM_COUNTERMODE_UP              0x00000000U       /*!< Counter used as upcounter */
#define LL_TIM_COUNTERMODE_DOWN            TIM_CR1_DIR       /*!< Counter used as downcounter */
#define LL_TIM_COUNTERMODE_CENTER_DOWN     TIM_CR1_CMS_0     /*!< The counter counts up and down alternatively.
                                                              Output compare interrupt flags of output channels
                                                              are set only when the counter is counting down. */
#define LL_TIM_COUNTERMODE_CENTER_UP       TIM_CR1_CMS_1     /*!< The counter counts up and down alternatively.
                                                              Output compare interrupt flags of output channels
                                                              are set only when the counter is counting up */
#define LL_TIM_COUNTERMODE_CENTER_UP_DOWN  TIM_CR1_CMS       /*!< The counter counts up and down alternatively.
                                                              Output compare interrupt flags of output channels
                                                              are set only when the counter is counting up or down. */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_CLOCKDIVISION_DIV Clock Division
  * @{
  */
#define LL_TIM_CLOCKDIVISION_DIV1              0x00000000U                         /*!< tDTS=tTIM_KER_CK   */
#define LL_TIM_CLOCKDIVISION_DIV2              TIM_CR1_CKD_0                       /*!< tDTS=2*tTIM_KER_CK */
#define LL_TIM_CLOCKDIVISION_DIV4              TIM_CR1_CKD_1                       /*!< tDTS=4*tTIM_KER_CK */
#define LL_TIM_CLOCKDIVISION_DIV8              (TIM_CR1_CKD_1 | TIM_CR1_CKD_0)     /*!< tDTS=8*tTIM_KER_CK */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_CLOCKDIVISION2_DIV Clock Division 2
  * @{
  */
#define LL_TIM_CLOCKDIVISION2_DIV1        0x00000000U                                       /*!< tDTS2=tDTS */
#define LL_TIM_CLOCKDIVISION2_DIV4        TIM_CR1_CKD2_0                                    /*!< tDTS2=4*tDTS */
#define LL_TIM_CLOCKDIVISION2_DIV16       TIM_CR1_CKD2_1                                    /*!< tDTS2=16*tDTS */
#define LL_TIM_CLOCKDIVISION2_DIV64       (TIM_CR1_CKD2_1 | TIM_CR1_CKD2_0)                 /*!< tDTS2=64*tDTS */
#define LL_TIM_CLOCKDIVISION2_DIV256      TIM_CR1_CKD2_2                                    /*!< tDTS2=256*tDTS */
#define LL_TIM_CLOCKDIVISION2_DIV1024     (TIM_CR1_CKD2_2 | TIM_CR1_CKD2_0)                 /*!< tDTS2=1024*tDTS */
#define LL_TIM_CLOCKDIVISION2_DIV4096     (TIM_CR1_CKD2_2 | TIM_CR1_CKD2_1)                 /*!< tDTS2=4096*tDTS */
#define LL_TIM_CLOCKDIVISION2_DIV16384    (TIM_CR1_CKD2_2 |TIM_CR1_CKD2_1 | TIM_CR1_CKD2_0) /*!< tDTS2=16384*tDTS */
#define LL_TIM_CLOCKDIVISION2_DIV65536    TIM_CR1_CKD2_3                                    /*!< tDTS2=65536*tDTS */
#define LL_TIM_CLOCKDIVISION2_DIV262144   (TIM_CR1_CKD2_3 | TIM_CR1_CKD2_0)                 /*!< tDTS2=262144*tDTS */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_COUNTERDIRECTION Counter Direction
  * @{
  */
#define LL_TIM_COUNTERDIRECTION_UP        0x00000000U /*!< Timer counter counts up */
#define LL_TIM_COUNTERDIRECTION_DOWN      TIM_CR1_DIR /*!< Timer counter counts down */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_CCUPDATESOURCE Capture Compare Update Source
  * @{
  */
#define LL_TIM_CCUPDATESOURCE_SOFTWARE               0x00000000U   /*!< Capture/compare control bits are updated
                                                                        by setting the COMG bit only */
#define LL_TIM_CCUPDATESOURCE_SOFTWARE_AND_TRIGGER   TIM_CR2_CCUS  /*!< Capture/compare control bits are updated
                                                                        by setting the COMG bit or when a rising edge
                                                                        occurs on trigger input (TRGI) */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_CCDMAREQUEST Capture Compare DMA Request
  * @{
  */
#define LL_TIM_CCDMAREQUEST_CC             0x00000000U      /*!< CCx DMA request sent when CCx event occurs */
#define LL_TIM_CCDMAREQUEST_UPD            TIM_CR2_CCDS     /*!< CCx DMA requests sent when update event occurs */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_LOCKLEVEL Lock Level
  * @{
  */
#define LL_TIM_LOCKLEVEL_OFF                   0x00000000U          /*!< LOCK OFF - No bit is write protected */
#define LL_TIM_LOCKLEVEL_1                     TIM_BDTR_LOCK_0      /*!< LOCK Level 1 */
#define LL_TIM_LOCKLEVEL_2                     TIM_BDTR_LOCK_1      /*!< LOCK Level 2 */
#define LL_TIM_LOCKLEVEL_3                     TIM_BDTR_LOCK        /*!< LOCK Level 3 */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_CHANNEL Channel
  * @{
  */
#define LL_TIM_CHANNEL_CH1             TIM_CCER_CC1E             /*!< Timer input/output channel 1 */
#define LL_TIM_CHANNEL_CH1N            TIM_CCER_CC1NE            /*!< Timer complementary output channel 1 */
#define LL_TIM_CHANNEL_CH2             TIM_CCER_CC2E             /*!< Timer input/output channel 2 */
#define LL_TIM_CHANNEL_CH2N            TIM_CCER_CC2NE            /*!< Timer complementary output channel 2 */
#define LL_TIM_CHANNEL_CH3             TIM_CCER_CC3E             /*!< Timer input/output channel 3 */
#define LL_TIM_CHANNEL_CH3N            TIM_CCER_CC3NE            /*!< Timer complementary output channel 3 */
#define LL_TIM_CHANNEL_CH4             TIM_CCER_CC4E             /*!< Timer input/output channel 4 */
#define LL_TIM_CHANNEL_CH4N            TIM_CCER_CC4NE            /*!< Timer complementary output channel 4 */
#define LL_TIM_CHANNEL_CH5             TIM_CCER_CC5E             /*!< Timer output channel 5 */
#define LL_TIM_CHANNEL_CH6             TIM_CCER_CC6E             /*!< Timer output channel 6 */
#define LL_TIM_CHANNEL_CH7             TIM_CCER_CC7E             /*!< Timer output channel 7 */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_OCSTATE Output Configuration State
  * @{
  */
#define LL_TIM_OCSTATE_DISABLE          0x00000000U      /*!< OCx is not active */
#define LL_TIM_OCSTATE_ENABLE           TIM_CCER_CC1E    /*!< OCx signal is output on the corresponding output pin */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_OCMODE Output Configuration Mode
  * @{
  */
#define LL_TIM_OCMODE_FROZEN             0x00000000U                            /*!<The comparison between the output
                                                                                 compare register TIMx_CCRy and
                                                                                 the counter TIMx_CNT has no effect on
                                                                                 the output channel level */
#define LL_TIM_OCMODE_ACTIVE_ON_MATCH    TIM_CCMR1_OC1M_0                       /*!<OCyREF is forced high on compare
                                                                                 match */
#define LL_TIM_OCMODE_INACTIVE_ON_MATCH  TIM_CCMR1_OC1M_1                       /*!<OCyREF is forced low on compare
                                                                                 match */
#define LL_TIM_OCMODE_TOGGLE             (TIM_CCMR1_OC1M_1 | TIM_CCMR1_OC1M_0)  /*!<OCyREF toggles on compare match */
#define LL_TIM_OCMODE_FORCED_INACTIVE    TIM_CCMR1_OC1M_2                       /*!<OCyREF is forced low */
#define LL_TIM_OCMODE_FORCED_ACTIVE      (TIM_CCMR1_OC1M_2 | TIM_CCMR1_OC1M_0)  /*!<OCyREF is forced high */
#define LL_TIM_OCMODE_PWM1               (TIM_CCMR1_OC1M_2 | TIM_CCMR1_OC1M_1)  /*!<In upcounting, channel y is active
                                                                                as long as TIMx_CNT<TIMx_CCRy else
                                                                                inactive.In downcounting, channel y
                                                                                is inactive as long as
                                                                                TIMx_CNT>TIMx_CCRy else active */
#define LL_TIM_OCMODE_PWM2               (TIM_CCMR1_OC1M_2 | TIM_CCMR1_OC1M_1 \
                                          | TIM_CCMR1_OC1M_0)                   /*!<In upcounting, channel y is
                                                                                inactive as long as TIMx_CNT<TIMx_CCRy
                                                                                else active. In downcounting, channel y
                                                                                is active as long as TIMx_CNT>TIMx_CCRy
                                                                                else inactive */
#define LL_TIM_OCMODE_RETRIGERRABLE_OPM1  TIM_CCMR1_OC1M_3                       /*!<Retrigerrable OPM mode 1 */
#define LL_TIM_OCMODE_RETRIGERRABLE_OPM2  (TIM_CCMR1_OC1M_3 | TIM_CCMR1_OC1M_0)  /*!<Retrigerrable OPM mode 2 */
#define LL_TIM_OCMODE_COMBINED_PWM1      (TIM_CCMR1_OC1M_3 | TIM_CCMR1_OC1M_2)   /*!<Combined PWM mode 1 */
#define LL_TIM_OCMODE_COMBINED_PWM2      (TIM_CCMR1_OC1M_3 | TIM_CCMR1_OC1M_2 \
                                          | TIM_CCMR1_OC1M_0)                    /*!<Combined PWM mode 2 */
#define LL_TIM_OCMODE_COMBINED_PWM3      TIM_CCMR1_OC1M_4                        /*!<Combined PWM mode 3 */
#define LL_TIM_OCMODE_COMBINED_PWM4      (TIM_CCMR1_OC1M_4 | TIM_CCMR1_OC1M_0)   /*!<Combined PWM mode 4 */
#define LL_TIM_OCMODE_ASYMMETRIC_PWM1    (TIM_CCMR1_OC1M_3 | TIM_CCMR1_OC1M_2 \
                                          | TIM_CCMR1_OC1M_1)                    /*!<Asymmetric PWM mode 1 */
#define LL_TIM_OCMODE_ASYMMETRIC_PWM2    (TIM_CCMR1_OC1M_3 | TIM_CCMR1_OC1M_2 \
                                          | TIM_CCMR1_OC1M_1 | TIM_CCMR1_OC1M_0) /*!<Asymmetric PWM mode 2 */
#define LL_TIM_OCMODE_ASYMMETRIC_PWM3    (TIM_CCMR1_OC1M_4 | TIM_CCMR1_OC1M_1)   /*!<Asymmetric PWM mode 3 */
#define LL_TIM_OCMODE_ASYMMETRIC_PWM4    (TIM_CCMR1_OC1M_4 | TIM_CCMR1_OC1M_1 \
                                          | TIM_CCMR1_OC1M_0)                    /*!<Asymmetric PWM mode 4 */
#define LL_TIM_OCMODE_ASYMMETRIC_PWM5    (TIM_CCMR1_OC1M_4 | TIM_CCMR1_OC1M_2)   /*!<Asymmetric PWM mode 5 */
#define LL_TIM_OCMODE_ASYMMETRIC_PWM6    (TIM_CCMR1_OC1M_4 | TIM_CCMR1_OC1M_2 \
                                          | TIM_CCMR1_OC1M_0)                    /*!<Asymmetric PWM mode 6 */
#define LL_TIM_OCMODE_ASYMMETRIC_PWM7    (TIM_CCMR1_OC1M_4 | TIM_CCMR1_OC1M_2 \
                                          | TIM_CCMR1_OC1M_1)                    /*!<Asymmetric PWM mode 7 */
#define LL_TIM_OCMODE_ASYMMETRIC_PWM8    (TIM_CCMR1_OC1M_4 | TIM_CCMR1_OC1M_2 \
                                          | TIM_CCMR1_OC1M_1 | TIM_CCMR1_OC1M_0) /*!<Asymmetric PWM mode 8 */
#define LL_TIM_OCMODE_ASYMMETRIC_PWM9    (TIM_CCMR1_OC1M_4 | TIM_CCMR1_OC1M_3)   /*!<Asymmetric PWM mode 9 */
#define LL_TIM_OCMODE_ASYMMETRIC_PWM10   (TIM_CCMR1_OC1M_4 | TIM_CCMR1_OC1M_3 \
                                          | TIM_CCMR1_OC1M_0)                    /*!<Asymmetric PWM mode 10 */
#define LL_TIM_OCMODE_PULSE_ON_COMPARE   (TIM_CCMR2_OC3M_3 | TIM_CCMR2_OC3M_1)   /*!<Pulse on Compare mode */
#define LL_TIM_OCMODE_DIRECTION_OUTPUT   (TIM_CCMR2_OC3M_3 | TIM_CCMR2_OC3M_1 \
                                          | TIM_CCMR2_OC3M_0)                    /*!<Direction output mode */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_OCPOLARITY Output Configuration Polarity
  * @{
  */
#define LL_TIM_OCPOLARITY_HIGH                 0x00000000U                        /*!< OCx active high */
#define LL_TIM_OCPOLARITY_LOW                  TIM_CCER_CC1P                      /*!< OCx active low */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_OCIDLESTATE Output Configuration Idle State
  * @{
  */
#define LL_TIM_OCIDLESTATE_RESET               0x00000000U             /*!< OCx/OCxN=0 (after a dead-time
                                                                       if OC is implemented) when MOE=0 */
#define LL_TIM_OCIDLESTATE_SET                 TIM_CR2_OIS1            /*!< OCx/OCxN=1 (after a dead-time
                                                                       if OC is implemented) when MOE=0 */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_OCOVERRIDE Output Configuration Idle State Override
  * @{
  */
#define LL_TIM_OCOVERRIDE_RESET                0x00000000U             /*!< OCx/OCxN=0 when OOC=1 */
#define LL_TIM_OCOVERRIDE_SET                  TIM_OOR_OOS1            /*!< OCx/OCxN=1 when OOC=1 */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_OCBREAKMODE Output Configuration Break Mode
  * @{
  */
#define LL_TIM_OCBREAKMODE_IMMEDIATE           0x00000000U             /*!< Immediate break */
#define LL_TIM_OCBREAKMODE_DELAY1              TIM_MPR1_BK1M_0         /*!< Delayed 1 break */
#define LL_TIM_OCBREAKMODE_DELAY2              TIM_MPR1_BK1M_1         /*!< Delayed 2 break */
/**
  * @}
  */


/** @defgroup TIM_LL_EC_OC_COMPARE_UNIT Compare Unit
  * @{
  */
#define LL_TIM_OC_COMPARE_UNIT_1             0U             /*!< Timer compare unit 1 */
#define LL_TIM_OC_COMPARE_UNIT_2             1U             /*!< Timer compare unit 2 */
#define LL_TIM_OC_COMPARE_UNIT_3             2U             /*!< Timer compare unit 3 */
#define LL_TIM_OC_COMPARE_UNIT_4             3U             /*!< Timer compare unit 4 */
#define LL_TIM_OC_COMPARE_UNIT_5             4U             /*!< Timer compare unit 5 */
#define LL_TIM_OC_COMPARE_UNIT_6             5U             /*!< Timer compare unit 6 */
#define LL_TIM_OC_COMPARE_UNIT_7             6U             /*!< Timer compare unit 7 */
/**
  * @}
  */

