MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_tim.h
/** @defgroup TIM_LL_EC_GROUPCH5 GROUPCH5
  * @{
  */
#define LL_TIM_GROUPCH5_NONE            0x00000000U        /*!< No effect of OC5REF on OC1REFC, OC2REFC and OC3REFC */
#define LL_TIM_GROUPCH5_AND_OC1REFC     TIM_CCR5_GC5C1     /*!< OC1REFC is the logical AND of OC1REFC  and OC5REF */
#define LL_TIM_GROUPCH5_AND_OC2REFC     TIM_CCR5_GC5C2     /*!< OC2REFC is the logical AND of OC2REFC and OC5REF */
#define LL_TIM_GROUPCH5_AND_OC3REFC     TIM_CCR5_GC5C3     /*!< OC3REFC is the logical AND of OC3REFC and OC5REF */
#define LL_TIM_GROUPCH5_AND_OC4REFC     TIM_CCR5_GC5C4     /*!< OC4REFC is the logical AND of OC4REFC and OC5REF */
#define LL_TIM_GROUPCH5_OR_OC1REFC      TIM_CCR5_GC5C1O    /*!< OC1REFC is the logical OR of OC1REFC and OC5REF */
#define LL_TIM_GROUPCH5_OR_OC2REFC      TIM_CCR5_GC5C2O    /*!< OC2REFC is the logical OR of OC2REFC and OC5REF */
#define LL_TIM_GROUPCH5_OR_OC3REFC      TIM_CCR5_GC5C3O    /*!< OC3REFC is the logical OR of OC3REFC and OC5REF */
#define LL_TIM_GROUPCH5_OR_OC4REFC      TIM_CCR5_GC5C4O    /*!< OC4REFC is the logical OR of OC4REFC and OC5REF */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_ACTIVEINPUT Active Input Selection
  * @{
  */
#define LL_TIM_ACTIVEINPUT_DIRECT       (TIM_CCMR1_CC1S_0 << LL_TIM_IC_CONFIG_POS)  /*!< ICx is mapped on TIx */
#define LL_TIM_ACTIVEINPUT_INDIRECT     (TIM_CCMR1_CC1S_1 << LL_TIM_IC_CONFIG_POS)  /*!< ICx is mapped on TIy */
#define LL_TIM_ACTIVEINPUT_TRC          (TIM_CCMR1_CC1S << LL_TIM_IC_CONFIG_POS)    /*!< ICx is mapped on TRC */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_ICPSC Input Configuration Prescaler
  * @{
  */
#define LL_TIM_ICPSC_DIV1    0x00000000U                                  /*!< No prescaler, capture is done each time
                                                                          an edge is detected on the capture input */
#define LL_TIM_ICPSC_DIV2    (TIM_CCMR1_IC1PSC_0 << LL_TIM_IC_CONFIG_POS) /*!< Capture is done once every 2 events */
#define LL_TIM_ICPSC_DIV4    (TIM_CCMR1_IC1PSC_1 << LL_TIM_IC_CONFIG_POS) /*!< Capture is done once every 4 events */
#define LL_TIM_ICPSC_DIV8    (TIM_CCMR1_IC1PSC << LL_TIM_IC_CONFIG_POS)   /*!< Capture is done once every 8 events */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_IC_FILTER Input Configuration Filter
  * @{
  */
#define LL_TIM_IC_FILTER_FDIV1          0x00000000U                                     /*!< No filter, sampling is
                                                                                        done at fDTS */
#define LL_TIM_IC_FILTER_FDIV1_N2       (TIM_CCMR1_IC1F_0 << LL_TIM_IC_CONFIG_POS)      /*!< fSAMPLING=fCK_INT, N=2 */
#define LL_TIM_IC_FILTER_FDIV1_N4       (TIM_CCMR1_IC1F_1 << LL_TIM_IC_CONFIG_POS)      /*!< fSAMPLING=fCK_INT, N=4 */
#define LL_TIM_IC_FILTER_FDIV1_N8       ((TIM_CCMR1_IC1F_1 \
                                          | TIM_CCMR1_IC1F_0) << LL_TIM_IC_CONFIG_POS)  /*!< fSAMPLING=fCK_INT, N=8 */
#define LL_TIM_IC_FILTER_FDIV2_N6       (TIM_CCMR1_IC1F_2 << LL_TIM_IC_CONFIG_POS)      /*!< fSAMPLING=fDTS/2, N=6 */
#define LL_TIM_IC_FILTER_FDIV2_N8       ((TIM_CCMR1_IC1F_2 \
                                          | TIM_CCMR1_IC1F_0) << LL_TIM_IC_CONFIG_POS)  /*!< fSAMPLING=fDTS/2, N=8 */
#define LL_TIM_IC_FILTER_FDIV4_N6       ((TIM_CCMR1_IC1F_2 \
                                          | TIM_CCMR1_IC1F_1) << LL_TIM_IC_CONFIG_POS)  /*!< fSAMPLING=fDTS/4, N=6 */
#define LL_TIM_IC_FILTER_FDIV4_N8       ((TIM_CCMR1_IC1F_2 | TIM_CCMR1_IC1F_1\
                                          | TIM_CCMR1_IC1F_0) << LL_TIM_IC_CONFIG_POS)  /*!< fSAMPLING=fDTS/4, N=8 */
#define LL_TIM_IC_FILTER_FDIV8_N6       (TIM_CCMR1_IC1F_3 << LL_TIM_IC_CONFIG_POS)      /*!< fSAMPLING=fDTS/8, N=6 */
#define LL_TIM_IC_FILTER_FDIV8_N8       ((TIM_CCMR1_IC1F_3 \
                                          | TIM_CCMR1_IC1F_0) << LL_TIM_IC_CONFIG_POS)  /*!< fSAMPLING=fDTS/8, N=8 */
#define LL_TIM_IC_FILTER_FDIV16_N5      ((TIM_CCMR1_IC1F_3 \
                                          | TIM_CCMR1_IC1F_1) << LL_TIM_IC_CONFIG_POS)  /*!< fSAMPLING=fDTS/16, N=5 */
#define LL_TIM_IC_FILTER_FDIV16_N6      ((TIM_CCMR1_IC1F_3| TIM_CCMR1_IC1F_1 \
                                          | TIM_CCMR1_IC1F_0) << LL_TIM_IC_CONFIG_POS)  /*!< fSAMPLING=fDTS/16, N=6 */
#define LL_TIM_IC_FILTER_FDIV16_N8      ((TIM_CCMR1_IC1F_3 \
                                          | TIM_CCMR1_IC1F_2) << LL_TIM_IC_CONFIG_POS)  /*!< fSAMPLING=fDTS/16, N=8 */
#define LL_TIM_IC_FILTER_FDIV32_N5      ((TIM_CCMR1_IC1F_3 | TIM_CCMR1_IC1F_2 \
                                          | TIM_CCMR1_IC1F_0) << LL_TIM_IC_CONFIG_POS)  /*!< fSAMPLING=fDTS/32, N=5 */
#define LL_TIM_IC_FILTER_FDIV32_N6      ((TIM_CCMR1_IC1F_3 | TIM_CCMR1_IC1F_2 \
                                          | TIM_CCMR1_IC1F_1) << LL_TIM_IC_CONFIG_POS)  /*!< fSAMPLING=fDTS/32, N=6 */
#define LL_TIM_IC_FILTER_FDIV32_N8      (TIM_CCMR1_IC1F << LL_TIM_IC_CONFIG_POS)        /*!< fSAMPLING=fDTS/32, N=8 */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_IC_POLARITY Input Configuration Polarity
  * @{
  */
#define LL_TIM_IC_POLARITY_RISING           0x00000000U            /*!< The circuit is sensitive to TIxFP1 rising edge,
                                                                   TIxFP1 is not inverted */
#define LL_TIM_IC_POLARITY_FALLING          TIM_CCER_CC1P          /*!< The circuit is sensitive to TIxFP1 falling edge,
                                                                   TIxFP1 is inverted */
#define LL_TIM_IC_POLARITY_RISING_FALLING   (TIM_CCER_CC1P \
                                             | TIM_CCER_CC1NP)     /*!< The circuit is sensitive to both TIxFP1 rising
                                                                   and falling edges, TIxFP1 is not inverted */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_IC_XOR_GATE_POS XOR Gate Position Configuration
  * @{
  */
#define LL_TIM_IC_XOR_GATE_POS_DIRECT           0x00000000U      /*!< XOR gate placed before TI1 filter */
#define LL_TIM_IC_XOR_GATE_POS_FILTERED         TIM_CR2_XORPS    /*!< XOR gate placed after TI1, TI2 and TI3 filters,
                                                                 edge detector placed on XOR output */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_IC_SIGNAL Input Channel Signal Status
  * @{
  */
#define LL_TIM_IC_SIGNAL_LOW                    0x00000000U                 /*!< ICx signal is low */
#define LL_TIM_IC_SIGNAL_HIGH                   TIM_SR_TI1FS                /*!< ICx signal is high */
/**
  * @}
  */

