MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_tim.h
/** @defgroup TIM_LL_EC_CLK Clock Sources
  * @{
  */
#define LL_TIM_CLK_INTERNAL                   0x00000000U                 /*!< The timer is clocked by the internal
                                                                          clock provided from the RCC */
#define LL_TIM_CLK_EXTERNAL_MODE1             (TIM_SMCR_SMS_2 \
                                               | TIM_SMCR_SMS_1 \
                                               | TIM_SMCR_SMS_0)          /*!< Counter counts at each rising or
                                                                          falling edge on a selected input*/
#define LL_TIM_CLK_EXTERNAL_MODE2             TIM_SMCR_ECE                /*!< Counter counts at each rising or falling
                                                                          edge on the external trigger input ETR */
#define LL_TIM_CLK_ENCODER_X1_TI1             (TIM_SMCR_SMS_3 \
                                               | TIM_SMCR_SMS_2 \
                                               | TIM_SMCR_SMS_1)          /*!< Quadrature encoder mode:
                                                                          x1 mode, counting on TI1FP1 edges only,
                                                                          edge sensitivity is set by CC1P */
#define LL_TIM_CLK_ENCODER_X1_TI2             (TIM_SMCR_SMS_3 \
                                               | TIM_SMCR_SMS_2 \
                                               | TIM_SMCR_SMS_1 \
                                               | TIM_SMCR_SMS_0)          /*!< Quadrature encoder mode: x1 mode,
                                                                          counting on TI2FP2 edges only,
                                                                          edge sensitivity is set by CC1P */
#define LL_TIM_CLK_ENCODER_X2_TI1             TIM_SMCR_SMS_0              /*!< Quadrature encoder mode 1:
                                                                          x2 mode, Counter counts up/down
                                                                          on TI1FP1 edge depending on TI2FP2 level */
#define LL_TIM_CLK_ENCODER_X2_TI2             TIM_SMCR_SMS_1              /*!< Quadrature encoder mode 2:
                                                                          x2 mode, Counter counts up/down
                                                                          on TI2FP2 edge depending on TI1FP1 level */
#define LL_TIM_CLK_ENCODER_X4_TI12            (TIM_SMCR_SMS_1 \
                                               | TIM_SMCR_SMS_0)          /*!< Quadrature encoder mode 3:
                                                                          x4 mode, Counter counts up/down
                                                                          on both TI1FP1 and TI2FP2 edges
                                                                          depending on the level of the other input */
#define LL_TIM_CLK_ENCODER_DEBOUNCER_X2_TI1   TIM_SMCR_SMS_4              /*!< Quadrature encoder with built-in
                                                                          debouncer: x2 mode, Counter counts up/down
                                                                          on TI1FP1 edge depending on TI2FP2 level */
#define LL_TIM_CLK_ENCODER_DEBOUNCER_X4_TI12  (TIM_SMCR_SMS_4 \
                                               | TIM_SMCR_SMS_0)          /*!< Quadrature encoder with built-in
                                                                          debouncer:x4 mode, Counter counts up/down on
                                                                          both TI1FP1 and TI2FP2 edges depending on
                                                                          the level of the other input */
#define LL_TIM_CLK_ENCODER_CLK_PLUS_X2        (TIM_SMCR_SMS_3 \
                                               | TIM_SMCR_SMS_1)          /*!< Encoder mode: Clock plus direction,
                                                                          x2 mode */
#define LL_TIM_CLK_ENCODER_CLK_PLUS_X1        (TIM_SMCR_SMS_3 \
                                               | TIM_SMCR_SMS_1 \
                                               | TIM_SMCR_SMS_0)          /*!< Encoder mode:Clock plus direction,
                                                                          x1 mode, TI2FP2 edge sensitivity is set
                                                                          by CC2P */
#define LL_TIM_CLK_ENCODER_DIR_CLK_X2         (TIM_SMCR_SMS_3 \
                                               | TIM_SMCR_SMS_2)          /*!< Encoder mode: Directional Clock,
                                                                          x2 mode */
#define LL_TIM_CLK_ENCODER_DIR_CLK_X1_TI12    (TIM_SMCR_SMS_3 | TIM_SMCR_SMS_2 \
                                               | TIM_SMCR_SMS_0)          /*!< Encoder mode: Directional Clock,
                                                                          x1 mode, TI1FP1 and TI2FP2 edge sensitivity
                                                                          is set by CC1P and CC2P */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TRGO Trigger Output
  * @{
  */
#define LL_TIM_TRGO_RESET        0x00000000U       /*!< UG bit from the TIMx_EGR register is used as trigger output */
#define LL_TIM_TRGO_ENABLE       TIM_CR2_MMS_0     /*!< Counter Enable signal (CNT_EN) is used as trigger output */
#define LL_TIM_TRGO_UPDATE       TIM_CR2_MMS_1                    /*!< Update event is used as trigger output */
#define LL_TIM_TRGO_CC1IF        (TIM_CR2_MMS_1 | TIM_CR2_MMS_0)  /*!< CC1 capture or a compare match is used as trigger
                                                                   output */
#define LL_TIM_TRGO_OC1          TIM_CR2_MMS_2                    /*!< OC1REFC signal is used as trigger output */
#define LL_TIM_TRGO_OC2          (TIM_CR2_MMS_2 | TIM_CR2_MMS_0)  /*!< OC2REFC signal is used as trigger output */
#define LL_TIM_TRGO_OC3          (TIM_CR2_MMS_2 | TIM_CR2_MMS_1)  /*!< OC3REFC signal is used as trigger output */
#define LL_TIM_TRGO_OC4          (TIM_CR2_MMS_2 | TIM_CR2_MMS_1 \
                                  | TIM_CR2_MMS_0)                /*!< OC4REFC signal is used as trigger output */
#define LL_TIM_TRGO_ENCODER_CLK  TIM_CR2_MMS_3                    /*!< Encoder clock signal is used as trigger output */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TRGO2 Trigger Output 2
  * @{
  */
#define LL_TIM_TRGO2_RESET      0x00000000U      /*!< UG bit from the TIMx_EGR register is used as trigger output 2 */
#define LL_TIM_TRGO2_ENABLE     TIM_CR2_MMS2_0   /*!< Counter Enable signal (CNT_EN) is used as trigger output 2 */
#define LL_TIM_TRGO2_UPDATE     TIM_CR2_MMS2_1   /*!< Update event is used as trigger output 2 */
#define LL_TIM_TRGO2_CC1F       (TIM_CR2_MMS2_1 | TIM_CR2_MMS2_0)     /*!< CC1 capture or a compare match
                                                                      is used as trigger output 2 */
#define LL_TIM_TRGO2_OC1        TIM_CR2_MMS2_2                        /*!< OC1REFC signal is used as trigger output 2 */
#define LL_TIM_TRGO2_OC2        (TIM_CR2_MMS2_2 | TIM_CR2_MMS2_0)     /*!< OC2REFC signal is used as trigger output 2 */
#define LL_TIM_TRGO2_OC3        (TIM_CR2_MMS2_2 | TIM_CR2_MMS2_1)     /*!< OC3REFC signal is used as trigger output 2 */
#define LL_TIM_TRGO2_OC4        (TIM_CR2_MMS2_2 | TIM_CR2_MMS2_1 \
                                 | TIM_CR2_MMS2_0)                    /*!< OC4REFC signal is used as trigger output 2 */
#define LL_TIM_TRGO2_OC5        TIM_CR2_MMS2_3                        /*!< OC5REFC signal is used as trigger output 2 */
#define LL_TIM_TRGO2_OC6        (TIM_CR2_MMS2_3 | TIM_CR2_MMS2_0)     /*!< OC6REFC signal is used as trigger output 2 */
#define LL_TIM_TRGO2_OC7        TIM_CR2_MMS2_4                        /*!< OC7REFC signal is used as trigger output 2 */
#define LL_TIM_TRGO2_OC4_RISING_FALLING      (TIM_CR2_MMS2_3 | TIM_CR2_MMS2_1)    /*!< OC4REFC rising or falling edges
                                                                                  are used as trigger output 2 */
#define LL_TIM_TRGO2_OC6_RISING_FALLING      (TIM_CR2_MMS2_3 | TIM_CR2_MMS2_1 \
                                              | TIM_CR2_MMS2_0)                   /*!< OC6REFC rising or falling edges
                                                                                  are used as trigger output 2 */
#define LL_TIM_TRGO2_OC7_RISING_FALLING      (TIM_CR2_MMS2_4 | TIM_CR2_MMS2_0)    /*!< OC7REFC rising or falling edges
                                                                                  are used as trigger output 2 */
#define LL_TIM_TRGO2_OC4_RISING_OC6_RISING   (TIM_CR2_MMS2_3 | TIM_CR2_MMS2_2)    /*!< OC4REFC or OC6REFC rising edges
                                                                                  are used as trigger output 2 */
#define LL_TIM_TRGO2_OC4_RISING_OC7_RISING   (TIM_CR2_MMS2_4 | TIM_CR2_MMS2_1)    /*!< OC4REFC or OC7REFC rising edges
                                                                                  are used as trigger output 2 */
#define LL_TIM_TRGO2_OC5_RISING_OC6_RISING   (TIM_CR2_MMS2_3 | TIM_CR2_MMS2_2 \
                                              | TIM_CR2_MMS2_1)                   /*!< OC5REFC or OC6REFC rising edges
                                                                                  are used as trigger output 2 */
#define LL_TIM_TRGO2_OC5_RISING_OC7_RISING   (TIM_CR2_MMS2_4 | TIM_CR2_MMS2_2)    /*!< OC5REFC or OC7REFC rising edges
                                                                                  are used as trigger output 2 */
#define LL_TIM_TRGO2_OC6_RISING_OC7_RISING   (TIM_CR2_MMS2_4 | TIM_CR2_MMS2_2 \
                                              | TIM_CR2_MMS2_1)                   /*!< OC6REFC or OC7REFC rising edges
                                                                                  are used as trigger output 2 */
#define LL_TIM_TRGO2_OC4_RISING_OC6_FALLING  (TIM_CR2_MMS2_3 | TIM_CR2_MMS2_2 \
                                              | TIM_CR2_MMS2_0)                  /*!< OC4REFC rising or OC6REFC falling
                                                                                 edges are used as trigger output 2 */
#define LL_TIM_TRGO2_OC4_RISING_OC7_FALLING  (TIM_CR2_MMS2_4 | TIM_CR2_MMS2_1 \
                                              | TIM_CR2_MMS2_0)                  /*!< OC4REFC rising or OC7REFC falling
                                                                                 edges are used as trigger output 2 */
#define LL_TIM_TRGO2_OC5_RISING_OC6_FALLING  (TIM_CR2_MMS2_3 | TIM_CR2_MMS2_2 \
                                              | TIM_CR2_MMS2_1 | TIM_CR2_MMS2_0) /*!< OC5REFC rising or OC6REFC falling
                                                                                 edges are used as trigger output 2 */
#define LL_TIM_TRGO2_OC5_RISING_OC7_FALLING  (TIM_CR2_MMS2_4 | TIM_CR2_MMS2_2 \
                                              | TIM_CR2_MMS2_0)                  /*!< OC5REFC rising or OC7REFC falling
                                                                                 edges are used as trigger output 2 */
#define LL_TIM_TRGO2_OC6_RISING_OC7_FALLING  (TIM_CR2_MMS2_4 | TIM_CR2_MMS2_2 \
                                              | TIM_CR2_MMS2_1 | TIM_CR2_MMS2_0) /*!< OC6REFC rising or OC7REFC falling
                                                                                 edges are used as trigger output 2 */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_SLAVEMODE Slave Mode
  * @{
  */
#define LL_TIM_SLAVEMODE_DISABLED      0x00000000U                        /*!< Slave mode disabled */
#define LL_TIM_SLAVEMODE_RESET         TIM_SMCR_SMS_2                     /*!< Reset Mode - Rising edge of
                                                                          the selected trigger input (TRGI)
                                                                          reinitializes the counter */
#define LL_TIM_SLAVEMODE_GATED         (TIM_SMCR_SMS_2 | TIM_SMCR_SMS_0)  /*!< Gated Mode - The counter clock
                                                                          is enabled when the trigger input
                                                                          (TRGI) is high */
#define LL_TIM_SLAVEMODE_TRIGGER       (TIM_SMCR_SMS_2 | TIM_SMCR_SMS_1)  /*!< Trigger Mode - The counter starts
                                                                          at a rising edge of the trigger TRGI */
#define LL_TIM_SLAVEMODE_COMBINED_RESET_TRIGGER  TIM_SMCR_SMS_3           /*!< Combined reset + trigger mode - Rising
                                                                          edge of the selected trigger input (TRGI)
                                                                          reinitializes the counter, generates an update
                                                                          of the registers and starts the counter */
#define LL_TIM_SLAVEMODE_COMBINED_GATED_RESET    (TIM_SMCR_SMS_3 | TIM_SMCR_SMS_0) /*!< Combined gated + reset mode
                                                                                  - The counter clock is enabled when
                                                                                  the trigger input (TRGI) is high.
                                                                                  The counter stops and is reset) as
                                                                                  soon as the trigger becomes low.Both
                                                                                  startand stop of the counter
                                                                                  are controlled. */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_SMS_PRELOAD_SOURCE SMS Preload Source
  * @{
  */
#define LL_TIM_SLAVE_MODE_PRELOAD_UPDATE   0x00000000U     /*!< The SMS preload transfer is triggered
                                                                by the Timer's Update event */
#define LL_TIM_SLAVE_MODE_PRELOAD_INDEX    TIM_SMCR_SMSPS  /*!< The SMS preload transfer is triggered
                                                                by the Index event */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TS Trigger Selection
  * @{
  */
#define LL_TIM_TS_ITR0      0x00000000U                            /*!< Internal Trigger 0 (ITR0) is used as
                                                                   trigger input */
#define LL_TIM_TS_ITR1      TIM_SMCR_TS_0                          /*!< Internal Trigger 1 (ITR1) is used as
                                                                   trigger input */
#define LL_TIM_TS_ITR2      TIM_SMCR_TS_1                          /*!< Internal Trigger 2 (ITR2) is used as
                                                                   trigger input */
#if defined(TIM3)
#define LL_TIM_TS_ITR3      (TIM_SMCR_TS_0 | TIM_SMCR_TS_1)        /*!< Internal Trigger 3 (ITR3) is used as
                                                                   trigger input */
#endif /* TIM3 */
#if defined(TIM4)
#define LL_TIM_TS_ITR4      (TIM_SMCR_TS_3)                        /*!< Internal Trigger 4 (ITR4) is used as
                                                                   trigger input */
#endif /* TIM4 */
#if defined(TIM5)
#define LL_TIM_TS_ITR5      (TIM_SMCR_TS_0 | TIM_SMCR_TS_3)        /*!< Internal Trigger 5 (ITR5) is used as
                                                                   trigger input */
#endif /* TIM5 */
#define LL_TIM_TS_ITR6      (TIM_SMCR_TS_1 | TIM_SMCR_TS_3)        /*!< Internal Trigger 6 (ITR6) is used as
                                                                   trigger input */
#define LL_TIM_TS_ITR7      (TIM_SMCR_TS_0 | TIM_SMCR_TS_1 \
                             | TIM_SMCR_TS_3)                      /*!< Internal Trigger 7 (ITR7) is used as
                                                                   trigger input */
#define LL_TIM_TS_ITR8      (TIM_SMCR_TS_2 | TIM_SMCR_TS_3)        /*!< Internal Trigger 8 (ITR8) is used as
                                                                   trigger input */
#define LL_TIM_TS_ITR9      (TIM_SMCR_TS_0 | TIM_SMCR_TS_2 \
                             | TIM_SMCR_TS_3)                      /*!< Internal Trigger 9 (ITR9) is used as
                                                                   trigger input */
#if defined(TIM16)
#define LL_TIM_TS_ITR10     (TIM_SMCR_TS_1 | TIM_SMCR_TS_2 \
                             | TIM_SMCR_TS_3)                      /*!< Internal Trigger 10 (ITR10) is used as
                                                                   trigger input */
#define LL_TIM_TS_ITR11     (TIM_SMCR_TS_0 | TIM_SMCR_TS_1 \
                             | TIM_SMCR_TS_2 | TIM_SMCR_TS_3)      /*!< Internal Trigger 11 (ITR11) is used as
                                                                   trigger input */
#endif /* TIM16 */
#define LL_TIM_TS_TI1F_ED   TIM_SMCR_TS_2                          /*!< TI1 Edge Detector (TI1F_ED) is used as
                                                                   trigger input */
#define LL_TIM_TS_TI1FP1    (TIM_SMCR_TS_2 | TIM_SMCR_TS_0)        /*!< Filtered Timer Input 1 (TI1FP1) is used as
                                                                   trigger input */
#define LL_TIM_TS_TI2FP2    (TIM_SMCR_TS_2 | TIM_SMCR_TS_1)        /*!< Filtered Timer Input 2 (TI12P2) is used as
                                                                   trigger input */
#define LL_TIM_TS_ETRF      (TIM_SMCR_TS_2 | TIM_SMCR_TS_1 \
                             | TIM_SMCR_TS_0)                      /*!< Filtered external Trigger (ETRF) is used as
                                                                   trigger input */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_ETR_POLARITY External Trigger Polarity
  * @{
  */
#define LL_TIM_ETR_POLARITY_NONINVERTED   0x00000000U   /*!< ETR is non-inverted, active at high level or rising edge */
#define LL_TIM_ETR_POLARITY_INVERTED      TIM_SMCR_ETP  /*!< ETR is inverted, active at low level or falling edge */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_ETR_PRESCALER External Trigger Prescaler
  * @{
  */
#define LL_TIM_ETR_PRESCALER_DIV1              0x00000000U             /*!< ETR prescaler OFF */
#define LL_TIM_ETR_PRESCALER_DIV2              TIM_SMCR_ETPS_0         /*!< ETR frequency is divided by 2 */
#define LL_TIM_ETR_PRESCALER_DIV4              TIM_SMCR_ETPS_1         /*!< ETR frequency is divided by 4 */
#define LL_TIM_ETR_PRESCALER_DIV8              TIM_SMCR_ETPS           /*!< ETR frequency is divided by 8 */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_ETR_SYNCPRESCALER External Trigger Synchronous Prescaler
  * @{
  */
#define LL_TIM_ETR_SYNC_PRESCALER_DIV1    0x00000000U                             /*!< ETR synchronous prescaler OFF */
#define LL_TIM_ETR_SYNC_PRESCALER_DIV2    TIM_SMCR_SETPS_0                        /*!< ETR frequency is divided by 2 */
#define LL_TIM_ETR_SYNC_PRESCALER_DIV3    TIM_SMCR_SETPS_1                        /*!< ETR frequency is divided by 3 */
#define LL_TIM_ETR_SYNC_PRESCALER_DIV4    (TIM_SMCR_SETPS_1 | TIM_SMCR_SETPS_0)   /*!< ETR frequency is divided by 4 */
#define LL_TIM_ETR_SYNC_PRESCALER_DIV5    TIM_SMCR_SETPS_2                        /*!< ETR frequency is divided by 5 */
#define LL_TIM_ETR_SYNC_PRESCALER_DIV6    (TIM_SMCR_SETPS_2 | TIM_SMCR_SETPS_0)   /*!< ETR frequency is divided by 6 */
#define LL_TIM_ETR_SYNC_PRESCALER_DIV7    (TIM_SMCR_SETPS_2 | TIM_SMCR_SETPS_1)   /*!< ETR frequency is divided by 7 */
#define LL_TIM_ETR_SYNC_PRESCALER_DIV8    (TIM_SMCR_SETPS_2 | TIM_SMCR_SETPS_1 \
                                           | TIM_SMCR_SETPS_0)                    /*!< ETR frequency is divided by 8 */
#define LL_TIM_ETR_SYNC_PRESCALER_DIV9    TIM_SMCR_SETPS_3                        /*!< ETR frequency is divided by 9 */
#define LL_TIM_ETR_SYNC_PRESCALER_DIV10   (TIM_SMCR_SETPS_3 | TIM_SMCR_SETPS_0)   /*!< ETR frequency is divided by 10 */
#define LL_TIM_ETR_SYNC_PRESCALER_DIV11   (TIM_SMCR_SETPS_3 | TIM_SMCR_SETPS_1)   /*!< ETR frequency is divided by 11 */
#define LL_TIM_ETR_SYNC_PRESCALER_DIV12   (TIM_SMCR_SETPS_3 | TIM_SMCR_SETPS_1 \
                                           | TIM_SMCR_SETPS_0)                    /*!< ETR frequency is divided by 12 */
#define LL_TIM_ETR_SYNC_PRESCALER_DIV13   (TIM_SMCR_SETPS_3 | TIM_SMCR_SETPS_2)   /*!< ETR frequency is divided by 13 */
#define LL_TIM_ETR_SYNC_PRESCALER_DIV14   (TIM_SMCR_SETPS_3 | TIM_SMCR_SETPS_2 \
                                           | TIM_SMCR_SETPS_0)                    /*!< ETR frequency is divided by 14 */
#define LL_TIM_ETR_SYNC_PRESCALER_DIV15   (TIM_SMCR_SETPS_3 | TIM_SMCR_SETPS_2 \
                                           | TIM_SMCR_SETPS_1)                    /*!< ETR frequency is divided by 15 */
#define LL_TIM_ETR_SYNC_PRESCALER_DIV16   TIM_SMCR_SETPS                          /*!< ETR frequency is divided by 16 */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_ETR_FILTER External Trigger Filter
  * @{
  */
#define LL_TIM_ETR_FILTER_FDIV1         0x00000000U                          /*!< No filter, sampling is done at fDTS */
#define LL_TIM_ETR_FILTER_FDIV1_N2      TIM_SMCR_ETF_0                       /*!< fSAMPLING=fCK_INT, N=2 */
#define LL_TIM_ETR_FILTER_FDIV1_N4      TIM_SMCR_ETF_1                       /*!< fSAMPLING=fCK_INT, N=4 */
#define LL_TIM_ETR_FILTER_FDIV1_N8      (TIM_SMCR_ETF_1 | TIM_SMCR_ETF_0)    /*!< fSAMPLING=fCK_INT, N=8 */
#define LL_TIM_ETR_FILTER_FDIV2_N6      TIM_SMCR_ETF_2                       /*!< fSAMPLING=fDTS/2, N=6 */
#define LL_TIM_ETR_FILTER_FDIV2_N8      (TIM_SMCR_ETF_2 | TIM_SMCR_ETF_0)    /*!< fSAMPLING=fDTS/2, N=8 */
#define LL_TIM_ETR_FILTER_FDIV4_N6      (TIM_SMCR_ETF_2 | TIM_SMCR_ETF_1)    /*!< fSAMPLING=fDTS/4, N=6 */
#define LL_TIM_ETR_FILTER_FDIV4_N8      (TIM_SMCR_ETF_2 | TIM_SMCR_ETF_1 \
                                         | TIM_SMCR_ETF_0)                   /*!< fSAMPLING=fDTS/4, N=8 */
#define LL_TIM_ETR_FILTER_FDIV8_N6      TIM_SMCR_ETF_3                       /*!< fSAMPLING=fDTS/8, N=6 */
#define LL_TIM_ETR_FILTER_FDIV8_N8      (TIM_SMCR_ETF_3 | TIM_SMCR_ETF_0)    /*!< fSAMPLING=fDTS/16, N=8 */
#define LL_TIM_ETR_FILTER_FDIV16_N5     (TIM_SMCR_ETF_3 | TIM_SMCR_ETF_1)    /*!< fSAMPLING=fDTS/16, N=5 */
#define LL_TIM_ETR_FILTER_FDIV16_N6     (TIM_SMCR_ETF_3 | TIM_SMCR_ETF_1 \
                                         | TIM_SMCR_ETF_0)                   /*!< fSAMPLING=fDTS/16, N=6 */
#define LL_TIM_ETR_FILTER_FDIV16_N8     (TIM_SMCR_ETF_3 | TIM_SMCR_ETF_2)    /*!< fSAMPLING=fDTS/16, N=8 */
#define LL_TIM_ETR_FILTER_FDIV32_N5     (TIM_SMCR_ETF_3 | TIM_SMCR_ETF_2 \
                                         | TIM_SMCR_ETF_0)                   /*!< fSAMPLING=fDTS/32, N=5 */
#define LL_TIM_ETR_FILTER_FDIV32_N6     (TIM_SMCR_ETF_3 | TIM_SMCR_ETF_2 \
                                         | TIM_SMCR_ETF_1)                   /*!< fSAMPLING=fDTS/32, N=6 */
#define LL_TIM_ETR_FILTER_FDIV32_N8     TIM_SMCR_ETF                         /*!< fSAMPLING=fDTS/32, N=8 */
/**
  * @}
  */

