MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_tim.h
/** @defgroup TIM_LL_EC_TIM1_ETR_IN  TIM1 External Trigger Input
  * @{
  */
#define LL_TIM_TIM1_ETR_IN_GPIO              0x00000000U                                                                    /*!< tim1_etr_in is connected to TIM1_ETR */
#define LL_TIM_TIM1_ETR_IN_COMP1_OUT         TIM_AF1_ETRSEL_0                                                               /*!< tim1_etr_in is connected to comp1_out */
#if defined(COMP2)
#define LL_TIM_TIM1_ETR_IN_COMP2_OUT         TIM_AF1_ETRSEL_1                                                               /*!< tim1_etr_in is connected to comp2_out */
#endif /* COMP2 && !COMP3 */
#define LL_TIM_TIM1_ETR_IN_ADC1_AWD1         (TIM_AF1_ETRSEL_1 | TIM_AF1_ETRSEL_0)                                          /*!< tim1_etr_in is connected to adc1_awd1 */
#define LL_TIM_TIM1_ETR_IN_ADC1_AWD2         TIM_AF1_ETRSEL_2                                                               /*!< tim1_etr_in is connected to adc1_awd2 */
#define LL_TIM_TIM1_ETR_IN_ADC1_AWD3         (TIM_AF1_ETRSEL_2 | TIM_AF1_ETRSEL_0)                                          /*!< tim1_etr_in is connected to adc1_awd3 */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM2_ETR_IN  TIM2 External Trigger Input
  * @{
  */
#define LL_TIM_TIM2_ETR_IN_GPIO              0x00000000U                                                                    /*!< tim2_etr_in is connected to TIM2_ETR */
#define LL_TIM_TIM2_ETR_IN_COMP1_OUT         TIM_AF1_ETRSEL_0                                                               /*!< tim2_etr_in is connected to comp1_out */
#if defined(COMP2)
#define LL_TIM_TIM2_ETR_IN_COMP2_OUT         TIM_AF1_ETRSEL_1                                                               /*!< tim2_etr_in is connected to comp2_out */
#endif /* COMP2 && !COMP3 */
#define LL_TIM_TIM2_ETR_IN_ADC1_AWD1         (TIM_AF1_ETRSEL_1 | TIM_AF1_ETRSEL_0)                                          /*!< tim2_etr_in is connected to adc1_awd1 */
#define LL_TIM_TIM2_ETR_IN_ADC1_AWD2         TIM_AF1_ETRSEL_2                                                               /*!< tim2_etr_in is connected to adc1_awd2 */
#define LL_TIM_TIM2_ETR_IN_ADC1_AWD3         (TIM_AF1_ETRSEL_2 | TIM_AF1_ETRSEL_0)                                          /*!< tim2_etr_in is connected to adc1_awd3 */
#define LL_TIM_TIM2_ETR_IN_LSE               (TIM_AF1_ETRSEL_2 | TIM_AF1_ETRSEL_1)                                          /*!< tim2_etr_in is connected to LSE */
#define LL_TIM_TIM2_ETR_IN_MCO1              (TIM_AF1_ETRSEL_2 | TIM_AF1_ETRSEL_1 | TIM_AF1_ETRSEL_0)                       /*!< tim2_etr_in is connected to MCO1 */
#if defined(TIM3)
#define LL_TIM_TIM2_ETR_IN_TIM3_ETR          (TIM_AF1_ETRSEL_3 | TIM_AF1_ETRSEL_0)                                          /*!< tim2_etr_in is connected to TIM3_ETR */
#endif /* TIM3 */
#if defined(TIM4)
#define LL_TIM_TIM2_ETR_IN_TIM4_ETR          (TIM_AF1_ETRSEL_3 | TIM_AF1_ETRSEL_1)                                          /*!< tim2_etr_in is connected to TIM4_ETR */
#endif /* TIM4 */
#if defined(TIM5)
#define LL_TIM_TIM2_ETR_IN_TIM5_ETR          (TIM_AF1_ETRSEL_3 | TIM_AF1_ETRSEL_1 | TIM_AF1_ETRSEL_0)                       /*!< tim2_etr_in is connected to TIM5_ETR */
#endif /* TIM5 */
#if defined(ETH1)
#define LL_TIM_TIM2_ETR_IN_ETH1_PTP_PPS_OUT  (TIM_AF1_ETRSEL_3 | TIM_AF1_ETRSEL_2 | TIM_AF1_ETRSEL_1)                       /*!< tim2_etr_in is connected to eth1_ptp_pps_out */
#endif /* ETH1 */
/**
  * @}
  */

#if defined(TIM3)
/** @defgroup TIM_LL_EC_TIM3_ETR_IN  TIM3 External Trigger Input
  * @{
  */
#define LL_TIM_TIM3_ETR_IN_GPIO              0x00000000U                                                                    /*!< tim3_etr_in is connected to TIM3_ETR */
#define LL_TIM_TIM3_ETR_IN_COMP1_OUT         TIM_AF1_ETRSEL_0                                                               /*!< tim3_etr_in is connected to comp1_out */
#define LL_TIM_TIM3_ETR_IN_TIM2_ETR          TIM_AF1_ETRSEL_3                                                               /*!< tim3_etr_in is connected to TIM2_ETR */
#if defined(TIM4)
#define LL_TIM_TIM3_ETR_IN_TIM4_ETR          (TIM_AF1_ETRSEL_3 | TIM_AF1_ETRSEL_1)                                          /*!< tim3_etr_in is connected to TIM4_ETR */
#endif /* TIM4 */
#define LL_TIM_TIM3_ETR_IN_TIM5_ETR          (TIM_AF1_ETRSEL_3 | TIM_AF1_ETRSEL_1 | TIM_AF1_ETRSEL_0)                       /*!< tim3_etr_in is connected to TIM5_ETR */
#if defined(ETH1)
#define LL_TIM_TIM3_ETR_IN_ETH1_PTP_PPS_OUT  (TIM_AF1_ETRSEL_3 | TIM_AF1_ETRSEL_2 | TIM_AF1_ETRSEL_1)                       /*!< tim3_etr_in is connected to eth1_ptp_pps_out */
#endif /* ETH1 */
/**
  * @}
  */
#endif /* TIM3 */

#if defined(TIM4)
/** @defgroup TIM_LL_EC_TIM4_ETR_IN  TIM4 External Trigger Input
  * @{
  */
#define LL_TIM_TIM4_ETR_IN_GPIO              0x00000000U                                                                    /*!< tim4_etr_in is connected to TIM4_ETR */
#define LL_TIM_TIM4_ETR_IN_COMP1_OUT         TIM_AF1_ETRSEL_0                                                               /*!< tim4_etr_in is connected to comp1_out */
#define LL_TIM_TIM4_ETR_IN_ADC3_AWD1         (TIM_AF1_ETRSEL_1 | TIM_AF1_ETRSEL_0)                                          /*!< tim4_etr_in is connected to adc3_awd1 */
#define LL_TIM_TIM4_ETR_IN_ADC3_AWD2         TIM_AF1_ETRSEL_2                                                               /*!< tim4_etr_in is connected to adc3_awd2 */
#define LL_TIM_TIM4_ETR_IN_ADC3_AWD3         (TIM_AF1_ETRSEL_2 | TIM_AF1_ETRSEL_0)                                          /*!< tim4_etr_in is connected to adc3_awd3 */
#define LL_TIM_TIM4_ETR_IN_TIM2_ETR          TIM_AF1_ETRSEL_3                                                               /*!< tim4_etr_in is connected to TIM2_ETR */
#define LL_TIM_TIM4_ETR_IN_TIM3_ETR          (TIM_AF1_ETRSEL_3 | TIM_AF1_ETRSEL_0)                                          /*!< tim4_etr_in is connected to TIM3_ETR */
#define LL_TIM_TIM4_ETR_IN_TIM5_ETR          (TIM_AF1_ETRSEL_3 | TIM_AF1_ETRSEL_1 | TIM_AF1_ETRSEL_0)                       /*!< tim4_etr_in is connected to TIM5_ETR */
/**
  * @}
  */
#endif /* TIM4 */

#if defined(TIM5)
/** @defgroup TIM_LL_EC_TIM5_ETR_IN  TIM5 External Trigger Input
  * @{
  */
#define LL_TIM_TIM5_ETR_IN_GPIO              0x00000000U                                                                    /*!< tim5_etr_in is connected to TIM5_ETR */
#define LL_TIM_TIM5_ETR_IN_COMP1_OUT         TIM_AF1_ETRSEL_0                                                               /*!< tim5_etr_in is connected to comp1_out */
#define LL_TIM_TIM5_ETR_IN_TIM2_ETR          TIM_AF1_ETRSEL_3                                                               /*!< tim5_etr_in is connected to TIM2_ETR */
#if defined(TIM3)
#define LL_TIM_TIM5_ETR_IN_TIM3_ETR          (TIM_AF1_ETRSEL_3 | TIM_AF1_ETRSEL_0)                                          /*!< tim5_etr_in is connected to TIM3_ETR */
#endif /* TIM3 */
#if defined(TIM4)
#define LL_TIM_TIM5_ETR_IN_TIM4_ETR          (TIM_AF1_ETRSEL_3 | TIM_AF1_ETRSEL_1)                                          /*!< tim5_etr_in is connected to TIM4_ETR */
#endif /* TIM4 */
/**
  * @}
  */
#endif /* TIM5 */

/** @defgroup TIM_LL_EC_TIM8_ETR_IN  TIM8 External Trigger Input
  * @{
  */
#define LL_TIM_TIM8_ETR_IN_GPIO              0x00000000U                                                                    /*!< tim8_etr_in is connected to TIM8_ETR */
#define LL_TIM_TIM8_ETR_IN_COMP1_OUT         TIM_AF1_ETRSEL_0                                                               /*!< tim8_etr_in is connected to comp1_out */
#if defined(COMP2)
#define LL_TIM_TIM8_ETR_IN_COMP2_OUT         TIM_AF1_ETRSEL_1                                                               /*!< tim8_etr_in is connected to comp2_out */
#endif /* COMP2 && !COMP3 */
#if defined(ADC1) && defined(ADC2)
#define LL_TIM_TIM8_ETR_IN_ADC2_AWD1         (TIM_AF1_ETRSEL_1 | TIM_AF1_ETRSEL_0)                                          /*!< tim8_etr_in is connected to adc2_awd1 */
#define LL_TIM_TIM8_ETR_IN_ADC2_AWD2         TIM_AF1_ETRSEL_2                                                               /*!< tim8_etr_in is connected to adc2_awd2 */
#define LL_TIM_TIM8_ETR_IN_ADC2_AWD3         (TIM_AF1_ETRSEL_2 | TIM_AF1_ETRSEL_0)                                          /*!< tim8_etr_in is connected to adc2_awd3 */
#elif defined(ADC1)
#define LL_TIM_TIM8_ETR_IN_ADC1_AWD1         (TIM_AF1_ETRSEL_1 | TIM_AF1_ETRSEL_0)                                          /*!< tim8_etr_in is connected to adc1_awd1 */
#define LL_TIM_TIM8_ETR_IN_ADC1_AWD2         TIM_AF1_ETRSEL_2                                                               /*!< tim8_etr_in is connected to adc1_awd2 */
#define LL_TIM_TIM8_ETR_IN_ADC1_AWD3         (TIM_AF1_ETRSEL_2 | TIM_AF1_ETRSEL_0)                                          /*!< tim8_etr_in is connected to adc1_awd3 */
#endif /* ADC1 && ADC2 */
#if defined(ADC3)
#define LL_TIM_TIM8_ETR_IN_ADC3_AWD1         (TIM_AF1_ETRSEL_2 | TIM_AF1_ETRSEL_1)                                          /*!< tim8_etr_in is connected to adc3_awd1 */
#define LL_TIM_TIM8_ETR_IN_ADC3_AWD2         (TIM_AF1_ETRSEL_2 | TIM_AF1_ETRSEL_1 | TIM_AF1_ETRSEL_0)                       /*!< tim8_etr_in is connected to adc3_awd2 */
#define LL_TIM_TIM8_ETR_IN_ADC3_AWD3         TIM_AF1_ETRSEL_3                                                               /*!< tim8_etr_in is connected to adc3_awd3 */
#endif /* ADC3 */
/**
  * @}
  */


