MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_tim.h
/** @defgroup TIM_LL_EC_BREAK_POLARITY break polarity
  * @{
  */
#define LL_TIM_BREAK_POLARITY_LOW              0x00000000U               /*!< Break input BRK is active low */
#define LL_TIM_BREAK_POLARITY_HIGH             TIM_BDTR_BKP              /*!< Break input BRK is active high */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_BREAK_FILTER break filter
  * @{
  */
#define LL_TIM_BREAK_FILTER_FDIV1              0x00000000U   /*!< No filter, BRK acts asynchronously */
#define LL_TIM_BREAK_FILTER_FDIV1_N2           0x00010000U   /*!< fSAMPLING=fCK_INT, N=2 */
#define LL_TIM_BREAK_FILTER_FDIV1_N4           0x00020000U   /*!< fSAMPLING=fCK_INT, N=4 */
#define LL_TIM_BREAK_FILTER_FDIV1_N8           0x00030000U   /*!< fSAMPLING=fCK_INT, N=8 */
#define LL_TIM_BREAK_FILTER_FDIV2_N6           0x00040000U   /*!< fSAMPLING=fDTS/2, N=6 */
#define LL_TIM_BREAK_FILTER_FDIV2_N8           0x00050000U   /*!< fSAMPLING=fDTS/2, N=8 */
#define LL_TIM_BREAK_FILTER_FDIV4_N6           0x00060000U   /*!< fSAMPLING=fDTS/4, N=6 */
#define LL_TIM_BREAK_FILTER_FDIV4_N8           0x00070000U   /*!< fSAMPLING=fDTS/4, N=8 */
#define LL_TIM_BREAK_FILTER_FDIV8_N6           0x00080000U   /*!< fSAMPLING=fDTS/8, N=6 */
#define LL_TIM_BREAK_FILTER_FDIV8_N8           0x00090000U   /*!< fSAMPLING=fDTS/8, N=8 */
#define LL_TIM_BREAK_FILTER_FDIV16_N5          0x000A0000U   /*!< fSAMPLING=fDTS/16, N=5 */
#define LL_TIM_BREAK_FILTER_FDIV16_N6          0x000B0000U   /*!< fSAMPLING=fDTS/16, N=6 */
#define LL_TIM_BREAK_FILTER_FDIV16_N8          0x000C0000U   /*!< fSAMPLING=fDTS/16, N=8 */
#define LL_TIM_BREAK_FILTER_FDIV32_N5          0x000D0000U   /*!< fSAMPLING=fDTS/32, N=5 */
#define LL_TIM_BREAK_FILTER_FDIV32_N6          0x000E0000U   /*!< fSAMPLING=fDTS/32, N=6 */
#define LL_TIM_BREAK_FILTER_FDIV32_N8          0x000F0000U   /*!< fSAMPLING=fDTS/32, N=8 */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_BREAK2_POLARITY BREAK2 POLARITY
  * @{
  */
#define LL_TIM_BREAK2_POLARITY_LOW             0x00000000U             /*!< Break input BRK2 is active low */
#define LL_TIM_BREAK2_POLARITY_HIGH            TIM_BDTR_BK2P           /*!< Break input BRK2 is active high */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_BREAK2_FILTER BREAK2 FILTER
  * @{
  */
#define LL_TIM_BREAK2_FILTER_FDIV1             0x00000000U   /*!< No filter, BRK acts asynchronously */
#define LL_TIM_BREAK2_FILTER_FDIV1_N2          0x00100000U   /*!< fSAMPLING=fCK_INT, N=2 */
#define LL_TIM_BREAK2_FILTER_FDIV1_N4          0x00200000U   /*!< fSAMPLING=fCK_INT, N=4 */
#define LL_TIM_BREAK2_FILTER_FDIV1_N8          0x00300000U   /*!< fSAMPLING=fCK_INT, N=8 */
#define LL_TIM_BREAK2_FILTER_FDIV2_N6          0x00400000U   /*!< fSAMPLING=fDTS/2, N=6 */
#define LL_TIM_BREAK2_FILTER_FDIV2_N8          0x00500000U   /*!< fSAMPLING=fDTS/2, N=8 */
#define LL_TIM_BREAK2_FILTER_FDIV4_N6          0x00600000U   /*!< fSAMPLING=fDTS/4, N=6 */
#define LL_TIM_BREAK2_FILTER_FDIV4_N8          0x00700000U   /*!< fSAMPLING=fDTS/4, N=8 */
#define LL_TIM_BREAK2_FILTER_FDIV8_N6          0x00800000U   /*!< fSAMPLING=fDTS/8, N=6 */
#define LL_TIM_BREAK2_FILTER_FDIV8_N8          0x00900000U   /*!< fSAMPLING=fDTS/8, N=8 */
#define LL_TIM_BREAK2_FILTER_FDIV16_N5         0x00A00000U   /*!< fSAMPLING=fDTS/16, N=5 */
#define LL_TIM_BREAK2_FILTER_FDIV16_N6         0x00B00000U   /*!< fSAMPLING=fDTS/16, N=6 */
#define LL_TIM_BREAK2_FILTER_FDIV16_N8         0x00C00000U   /*!< fSAMPLING=fDTS/16, N=8 */
#define LL_TIM_BREAK2_FILTER_FDIV32_N5         0x00D00000U   /*!< fSAMPLING=fDTS/32, N=5 */
#define LL_TIM_BREAK2_FILTER_FDIV32_N6         0x00E00000U   /*!< fSAMPLING=fDTS/32, N=6 */
#define LL_TIM_BREAK2_FILTER_FDIV32_N8         0x00F00000U   /*!< fSAMPLING=fDTS/32, N=8 */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_OSSI OSSI
  * @{
  */
#define LL_TIM_OSSI_DISABLE      0x00000000U       /*!< When inactive, OCx/OCxN outputs are disabled */
#define LL_TIM_OSSI_ENABLE       TIM_BDTR_OSSI     /*!< When inactive, OxC/OCxN outputs are first forced with their
                                                        inactive level then forced to their idle level after the
                                                        deadtime */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_OSSR OSSR
  * @{
  */
#define LL_TIM_OSSR_DISABLE      0x00000000U       /*!< When inactive, OCx/OCxN outputs are disabled */
#define LL_TIM_OSSR_ENABLE       TIM_BDTR_OSSR     /*!< When inactive, OCx/OCxN outputs are enabled with their inactive
                                                        level as soon as CCxE=1 or CCxNE=1 */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_OUTPUT OUTPUT DISABLE STATUS
  * @{
  */
#define LL_TIM_OUTPUT_IDLE_STATE               0x00000000U   /*!< Break was triggered (or MOE was written to 0) and
                                                             OIS states are forced on tim_ocx and tim_ocxn outputs */
#define LL_TIM_OUTPUT_DISABLED_STATE           TIM_SR_ODS    /*!< Break2 was triggered, tim_ocx and
                                                             tim_ocxn outputs are inactive */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_BREAK_INPUT BREAK INPUT
  * @{
  */
#define LL_TIM_BREAK_INPUT_1                   0x00000000U  /*!< TIMx_BKIN input */
#define LL_TIM_BREAK_INPUT_2                   0x00000001U  /*!< TIMx_BKIN2 input */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_BKIN_SOURCE BKIN SOURCE
  * @{
  */
/** @defgroup TIM_LL_EC_TIM1_BRK  TIM1 Break Input
  * @{
  */
#define LL_TIM_TIM1_BRK_GPIO              TIM_AF1_BKINE      /*!< tim1_brk is connected to TIM1_BKIN */
#define LL_TIM_TIM1_BRK_COMP1_OUT         TIM_AF1_BKCMP1E    /*!< tim1_brk isconnected to comp1_out */
#if defined(COMP2)
#define LL_TIM_TIM1_BRK_COMP2_OUT         TIM_AF1_BKCMP2E    /*!< tim1_brk isconnected to comp2_out */
#endif /* COMP2 */
#define LL_TIM_TIM1_BRK_TIM8_BKIN         TIM_AF1_BKCMP6E    /*!< tim1_brk is connected to TIM8_BKIN */
#define LL_TIM_TIM1_BRK_TIM15_BKIN        TIM_AF1_BKCMP8E    /*!< tim1_brk is connected to TIM15_BKIN */
#if defined(TIM16)
#define LL_TIM_TIM1_BRK_TIM16_BKIN        TIM_AF1_BKCMP9E    /*!< tim1_brk is connected to TIM16_BKIN */
#define LL_TIM_TIM1_BRK_TIM17_BKIN        TIM_AF1_BKCMP10E   /*!< tim1_brk is connected to TIM17_BKIN */
#endif /* TIM16 */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM8_BRK  TIM8 Break Input
  * @{
  */
#define LL_TIM_TIM8_BRK_GPIO              TIM_AF1_BKINE      /*!< tim8_brk is connected to TIM8_BKIN */
#define LL_TIM_TIM8_BRK_COMP1_OUT         TIM_AF1_BKCMP1E    /*!< tim8_brk isconnected to comp1_out */
#if defined(COMP2)
#define LL_TIM_TIM8_BRK_COMP2_OUT         TIM_AF1_BKCMP2E    /*!< tim8_brk isconnected to comp2_out */
#endif /* COMP2 */
#define LL_TIM_TIM8_BRK_TIM1_BKIN         TIM_AF1_BKCMP5E    /*!< tim8_brk is connected to TIM1_BKIN */
#define LL_TIM_TIM8_BRK_TIM15_BKIN        TIM_AF1_BKCMP8E    /*!< tim8_brk is connected to TIM15_BKIN */
#if defined(TIM16)
#define LL_TIM_TIM8_BRK_TIM16_BKIN        TIM_AF1_BKCMP9E    /*!< tim8_brk is connected to TIM16_BKIN */
#define LL_TIM_TIM8_BRK_TIM17_BKIN        TIM_AF1_BKCMP10E   /*!< tim8_brk is connected to TIM17_BKIN */
#endif /* TIM16 */
/**
  * @}
  */

