MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_tim.h
/** @defgroup TIM_LL_EC_TIM15_BRK  TIM15 Break Input
  * @{
  */
#define LL_TIM_TIM15_BRK_GPIO             TIM_AF1_BKINE      /*!< tim15_brk is connected to TIM1_BKIN */
#define LL_TIM_TIM15_BRK_COMP1_OUT        TIM_AF1_BKCMP1E    /*!< tim15_brk isconnected to comp1_out */
#if defined(COMP2)
#define LL_TIM_TIM15_BRK_COMP2_OUT        TIM_AF1_BKCMP2E    /*!< tim15_brk isconnected to comp2_out */
#endif /* COMP2 */
#define LL_TIM_TIM15_BRK_TIM1_BKIN        TIM_AF1_BKCMP5E    /*!< tim15_brk is connected to TIM1_BKIN */
#define LL_TIM_TIM15_BRK_TIM8_BKIN        TIM_AF1_BKCMP6E    /*!< tim15_brk is connected to TIM8_BKIN */
#if defined(TIM16)
#define LL_TIM_TIM15_BRK_TIM16_BKIN       TIM_AF1_BKCMP9E    /*!< tim15_brk is connected to TIM16_BKIN */
#define LL_TIM_TIM15_BRK_TIM17_BKIN       TIM_AF1_BKCMP10E   /*!< tim15_brk is connected to TIM17_BKIN */
#endif /* TIM16 */
/**
  * @}
  */

#if defined(TIM16)
/** @defgroup TIM_LL_EC_TIM16_BRK  TIM16 Break Input
  * @{
  */
#define LL_TIM_TIM16_BRK_GPIO             TIM_AF1_BKINE      /*!< tim16_brk is connected to TIM1_BKIN */
#define LL_TIM_TIM16_BRK_COMP1_OUT        TIM_AF1_BKCMP1E    /*!< tim16_brk isconnected to comp1_out */
#define LL_TIM_TIM16_BRK_TIM1_BKIN        TIM_AF1_BKCMP5E    /*!< tim16_brk is connected to TIM1_BKIN */
#define LL_TIM_TIM16_BRK_TIM8_BKIN        TIM_AF1_BKCMP6E    /*!< tim16_brk is connected to TIM8_BKIN */
#define LL_TIM_TIM16_BRK_TIM15_BKIN       TIM_AF1_BKCMP8E    /*!< tim16_brk is connected to TIM15_BKIN */
#define LL_TIM_TIM16_BRK_TIM17_BKIN       TIM_AF1_BKCMP10E   /*!< tim16_brk is connected to TIM17_BKIN */
/**
  * @}
  */
#endif /* TIM16 */

#if defined(TIM17)
/** @defgroup TIM_LL_EC_TIM17_BRK  TIM17 Break Input
  * @{
  */
#define LL_TIM_TIM17_BRK_GPIO             TIM_AF1_BKINE      /*!< tim17_brk is connected to TIM1_BKIN */
#define LL_TIM_TIM17_BRK_COMP1_OUT        TIM_AF1_BKCMP1E    /*!< tim17_brk isconnected to comp1_out */
#define LL_TIM_TIM17_BRK_TIM1_BKIN        TIM_AF1_BKCMP5E    /*!< tim17_brk is connected to TIM1_BKIN */
#define LL_TIM_TIM17_BRK_TIM8_BKIN        TIM_AF1_BKCMP6E    /*!< tim17_brk is connected to TIM8_BKIN */
#define LL_TIM_TIM17_BRK_TIM15_BKIN       TIM_AF1_BKCMP8E    /*!< tim17_brk is connected to TIM15_BKIN */
#define LL_TIM_TIM17_BRK_TIM16_BKIN       TIM_AF1_BKCMP9E    /*!< tim17_brk is connected to TIM16_BKIN */
/**
  * @}
  */
#endif /* TIM17 */


/** @defgroup TIM_LL_EC_TIM1_BRK2  TIM1 Break2 Input
  * @{
  */
#define LL_TIM_TIM1_BRK2_GPIO             TIM_AF2_BK2INE     /*!< tim1_brk2 is connected to TIM1_BKIN2 */
#define LL_TIM_TIM1_BRK2_COMP1_OUT        TIM_AF2_BK2CMP1E   /*!< tim1_brk2 isconnected to comp1_out */
#if defined(COMP2)
#define LL_TIM_TIM1_BRK2_COMP2_OUT        TIM_AF2_BK2CMP2E   /*!< tim1_brk2 isconnected to comp2_out */
#endif /* COMP2 */
#define LL_TIM_TIM1_BRK2_TIM8_BKIN2       TIM_AF2_BK2CMP6E   /*!< tim1_brk2 is connected to TIM8_BKIN2 */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM8_BRK2  TIM8 Break2 Input
  * @{
  */
#define LL_TIM_TIM8_BRK2_GPIO             TIM_AF2_BK2INE     /*!< tim8_brk2 is connected to TIM8_BKIN2 */
#define LL_TIM_TIM8_BRK2_COMP1_OUT        TIM_AF2_BK2CMP1E   /*!< tim8_brk2 isconnected to comp1_out */
#if defined(COMP2)
#define LL_TIM_TIM8_BRK2_COMP2_OUT        TIM_AF2_BK2CMP2E   /*!< tim8_brk2 isconnected to comp2_out */
#endif /* COMP2 */
#define LL_TIM_TIM8_BRK2_TIM1_BKIN2       TIM_AF2_BK2CMP5E   /*!< tim8_brk2 is connected to TIM1_BKIN2 */
/**
  * @}
  */

/**
  * @}
  */

/** @defgroup TIM_LL_EC_BKIN_POLARITY BKIN POLARITY
  * @{
  */
#define LL_TIM_BREAK_INPUT_SRC_NONINVERTED     0x00000000U              /*!< BRK BKIN input is active high */
#define LL_TIM_BREAK_INPUT_SRC_INVERTED        TIM_AF1_BKINP            /*!< BRK BKIN input is active low */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_BREAK_AFMODE BREAK AF MODE
  * @{
  */
#define LL_TIM_BREAK_AFMODE_INPUT              0x00000000U              /*!< Break input BRK in input mode */
#define LL_TIM_BREAK_AFMODE_BIDIRECTIONAL      TIM_BDTR_BKBID           /*!< Break input BRK in bidirectional mode */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_BREAK2_AFMODE BREAK2 AF MODE
  * @{
  */
#define LL_TIM_BREAK2_AFMODE_INPUT             0x00000000U             /*!< Break2 input BRK2 in input mode */
#define LL_TIM_BREAK2_AFMODE_BIDIRECTIONAL     TIM_BDTR_BK2BID         /*!< Break2 input BRK2 in bidirectional mode */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_BREAK_DELAY BREAK DELAY
  * @{
  */
#define LL_TIM_BREAK_DELAY1                    0x00000000U             /*!< Delayed 1 break */
#define LL_TIM_BREAK_DELAY2                    0x00000001U             /*!< Delayed 2 break */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_DMABURST_BASEADDR DMA Burst Base Address
  * @{
  */
#define LL_TIM_DMABURST_BASEADDR_CR1            0x00000000U                       /*!< TIMx_CR1 register is the DMA
                                                                                       base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_CR2            TIM_DCR_DBA_0                     /*!< TIMx_CR2 register is the DMA
                                                                                       base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_SMCR           TIM_DCR_DBA_1                     /*!< TIMx_SMCR register is the DMA
                                                                                       base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_DIER           (TIM_DCR_DBA_1 |  TIM_DCR_DBA_0)  /*!< TIMx_DIER register is the DMA
                                                                                       base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_SR             TIM_DCR_DBA_2                     /*!< TIMx_SR register is the DMA
                                                                                       base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_EGR            (TIM_DCR_DBA_2 | TIM_DCR_DBA_0)   /*!< TIMx_EGR register is the DMA
                                                                                       base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_CCMR1          (TIM_DCR_DBA_2 | TIM_DCR_DBA_1)   /*!< TIMx_CCMR1 register is the DMA
                                                                                       base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_CCMR2          (TIM_DCR_DBA_2 | TIM_DCR_DBA_1 \
                                                 | TIM_DCR_DBA_0)                 /*!< TIMx_CCMR2 register is the DMA
                                                                                       base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_CCER           TIM_DCR_DBA_3                     /*!< TIMx_CCER register is the DMA
                                                                                       base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_CNT            (TIM_DCR_DBA_3 | TIM_DCR_DBA_0)   /*!< TIMx_CNT register is the DMA
                                                                                       base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_PSC            (TIM_DCR_DBA_3 | TIM_DCR_DBA_1)   /*!< TIMx_PSC register is the DMA
                                                                                       base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_ARR            (TIM_DCR_DBA_3 | TIM_DCR_DBA_1 \
                                                 | TIM_DCR_DBA_0)                 /*!< TIMx_ARR register is the DMA
                                                                                       base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_RCR            (TIM_DCR_DBA_3 | TIM_DCR_DBA_2)   /*!< TIMx_RCR register is the DMA
                                                                                       base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_CCR1           (TIM_DCR_DBA_3 | TIM_DCR_DBA_2 \
                                                 | TIM_DCR_DBA_0)                 /*!< TIMx_CCR1 register is the DMA
                                                                                       base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_CCR2           (TIM_DCR_DBA_3 | TIM_DCR_DBA_2 \
                                                 | TIM_DCR_DBA_1)                 /*!< TIMx_CCR2 register is the DMA
                                                                                       base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_CCR3           (TIM_DCR_DBA_3 | TIM_DCR_DBA_2 \
                                                 | TIM_DCR_DBA_1 | TIM_DCR_DBA_0) /*!< TIMx_CCR3 register is the DMA
                                                                                       base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_CCR4           TIM_DCR_DBA_4                     /*!< TIMx_CCR4 register is the DMA
                                                                                       base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_BDTR           (TIM_DCR_DBA_4 | TIM_DCR_DBA_0)   /*!< TIMx_BDTR register is the DMA
                                                                                       base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_CCR5           (TIM_DCR_DBA_4 | TIM_DCR_DBA_1)   /*!< TIMx_CCR5 register is the DMA
                                                                                       base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_CCR6           (TIM_DCR_DBA_4 | TIM_DCR_DBA_1 \
                                                 | TIM_DCR_DBA_0)                 /*!< TIMx_CCR6 register is the DMA
                                                                                       base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_CCMR3          (TIM_DCR_DBA_4 | TIM_DCR_DBA_2)   /*!< TIMx_CCMR3 register is the DMA
                                                                                       base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_DTR2           (TIM_DCR_DBA_4 | TIM_DCR_DBA_2 \
                                                 | TIM_DCR_DBA_0)                 /*!< TIMx_DTR2 register is the DMA
                                                                                       base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_ECR            (TIM_DCR_DBA_4 | TIM_DCR_DBA_2 \
                                                 | TIM_DCR_DBA_1)                 /*!< TIMx_ECR register is the DMA
                                                                                       base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_TISEL          (TIM_DCR_DBA_4 | TIM_DCR_DBA_2 \
                                                 | TIM_DCR_DBA_1 | TIM_DCR_DBA_0) /*!< TIMx_TISEL register is the DMA
                                                                                       base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_AF1            (TIM_DCR_DBA_4 | TIM_DCR_DBA_3)   /*!< TIMx_AF1 register is the DMA
                                                                                       base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_AF2            (TIM_DCR_DBA_4 | TIM_DCR_DBA_3 \
                                                 | TIM_DCR_DBA_0)                 /*!< TIMx_AF2 register is the DMA
                                                                                       base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_CCR7           (TIM_DCR_DBA_4 | TIM_DCR_DBA_3 \
                                                 | TIM_DCR_DBA_2)                 /*!< TIMx_CCR7 register is the DMA
                                                                                       base address for DMA burst */
#define LL_TIM_DMABURST_BASEADDR_CCMR4          (TIM_DCR_DBA_4 | TIM_DCR_DBA_3 \
                                                 | TIM_DCR_DBA_2 | TIM_DCR_DBA_1) /*!< TIMx_CCMR4 register is the DMA
                                                                                       base address for DMA burst */
/**
  * @}
  */

