MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_tim.h
/** @defgroup TIM_LL_EC_DMABURST_LENGTH DMA Burst Length
  * @{
  */
#define LL_TIM_DMABURST_LENGTH_1TRANSFER       0x00000000U                        /*!< Transfer is done to 1 register
                                                                                  starting from the DMA burst base
                                                                                  address */
#define LL_TIM_DMABURST_LENGTH_2TRANSFERS      TIM_DCR_DBL_0                      /*!< Transfer is done to 2 registers
                                                                                  starting from the DMA burst base
                                                                                  address */
#define LL_TIM_DMABURST_LENGTH_3TRANSFERS      TIM_DCR_DBL_1                      /*!< Transfer is done to 3 registers
                                                                                  starting from the DMA burst base
                                                                                  address */
#define LL_TIM_DMABURST_LENGTH_4TRANSFERS      (TIM_DCR_DBL_1 | TIM_DCR_DBL_0)    /*!< Transfer is done to 4 registers
                                                                                  starting from the DMA burst base
                                                                                  address */
#define LL_TIM_DMABURST_LENGTH_5TRANSFERS      TIM_DCR_DBL_2                      /*!< Transfer is done to 5 registers
                                                                                  starting from the DMA burst base
                                                                                  address */
#define LL_TIM_DMABURST_LENGTH_6TRANSFERS      (TIM_DCR_DBL_2 | TIM_DCR_DBL_0)    /*!< Transfer is done to 6 registers
                                                                                  starting from the DMA burst base
                                                                                  address */
#define LL_TIM_DMABURST_LENGTH_7TRANSFERS      (TIM_DCR_DBL_2 | TIM_DCR_DBL_1)    /*!< Transfer is done to 7 registers
                                                                                  starting from the DMA burst base
                                                                                  address */
#define LL_TIM_DMABURST_LENGTH_8TRANSFERS      (TIM_DCR_DBL_2 | TIM_DCR_DBL_1 \
                                                | TIM_DCR_DBL_0)                  /*!< Transfer is done to 1 registers
                                                                                  starting from the DMA burst base
                                                                                  address */
#define LL_TIM_DMABURST_LENGTH_9TRANSFERS      TIM_DCR_DBL_3                      /*!< Transfer is done to 9 registers
                                                                                  starting from the DMA burst base
                                                                                  address */
#define LL_TIM_DMABURST_LENGTH_10TRANSFERS     (TIM_DCR_DBL_3 | TIM_DCR_DBL_0)    /*!< Transfer is done to 10 registers
                                                                                  starting from the DMA burst base
                                                                                  address */
#define LL_TIM_DMABURST_LENGTH_11TRANSFERS     (TIM_DCR_DBL_3 | TIM_DCR_DBL_1)    /*!< Transfer is done to 11 registers
                                                                                  starting from the DMA burst base
                                                                                  address */
#define LL_TIM_DMABURST_LENGTH_12TRANSFERS     (TIM_DCR_DBL_3 | TIM_DCR_DBL_1 \
                                                | TIM_DCR_DBL_0)                  /*!< Transfer is done to 12 registers
                                                                                  starting from the DMA burst base
                                                                                  address */
#define LL_TIM_DMABURST_LENGTH_13TRANSFERS     (TIM_DCR_DBL_3 | TIM_DCR_DBL_2)    /*!< Transfer is done to 13 registers
                                                                                  starting from the DMA burst base
                                                                                  address */
#define LL_TIM_DMABURST_LENGTH_14TRANSFERS     (TIM_DCR_DBL_3 | TIM_DCR_DBL_2 \
                                                | TIM_DCR_DBL_0)                  /*!< Transfer is done to 14 registers
                                                                                  starting from the DMA burst base
                                                                                  address */
#define LL_TIM_DMABURST_LENGTH_15TRANSFERS     (TIM_DCR_DBL_3 | TIM_DCR_DBL_2 \
                                                | TIM_DCR_DBL_1)                  /*!< Transfer is done to 15 registers
                                                                                  starting from the DMA burst base
                                                                                  address */
#define LL_TIM_DMABURST_LENGTH_16TRANSFERS     (TIM_DCR_DBL_3 | TIM_DCR_DBL_2 \
                                                | TIM_DCR_DBL_1 | TIM_DCR_DBL_0)  /*!< Transfer is done to 16 registers
                                                                                  starting from the DMA burst base
                                                                                  address */
#define LL_TIM_DMABURST_LENGTH_17TRANSFERS     TIM_DCR_DBL_4                      /*!< Transfer is done to 17 registers
                                                                                  starting from the DMA burst base
                                                                                  address */
#define LL_TIM_DMABURST_LENGTH_18TRANSFERS     (TIM_DCR_DBL_4 | TIM_DCR_DBL_0)    /*!< Transfer is done to 18 registers
                                                                                  starting from the DMA burst base
                                                                                  address */
#define LL_TIM_DMABURST_LENGTH_19TRANSFERS     (TIM_DCR_DBL_4 | TIM_DCR_DBL_1)    /*!< Transfer is done to 19 registers
                                                                                  starting from the DMA burst base
                                                                                  address */
#define LL_TIM_DMABURST_LENGTH_20TRANSFERS     (TIM_DCR_DBL_4 | TIM_DCR_DBL_1 \
                                                | TIM_DCR_DBL_0)                  /*!< Transfer is done to 20 registers
                                                                                  starting from the DMA burst base
                                                                                  address */
#define LL_TIM_DMABURST_LENGTH_21TRANSFERS     (TIM_DCR_DBL_4 | TIM_DCR_DBL_2)    /*!< Transfer is done to 21 registers
                                                                                  starting from the DMA burst base
                                                                                  address */
#define LL_TIM_DMABURST_LENGTH_22TRANSFERS     (TIM_DCR_DBL_4 | TIM_DCR_DBL_2 \
                                                | TIM_DCR_DBL_0)                  /*!< Transfer is done to 22 registers
                                                                                  starting from the DMA burst base
                                                                                  address */
#define LL_TIM_DMABURST_LENGTH_23TRANSFERS     (TIM_DCR_DBL_4 | TIM_DCR_DBL_2 \
                                                | TIM_DCR_DBL_1)                  /*!< Transfer is done to 23 registers
                                                                                  starting from the DMA burst base
                                                                                  address */
#define LL_TIM_DMABURST_LENGTH_24TRANSFERS     (TIM_DCR_DBL_4 | TIM_DCR_DBL_2 \
                                                | TIM_DCR_DBL_1 | TIM_DCR_DBL_0)  /*!< Transfer is done to 24 registers
                                                                                  starting from the DMA burst base
                                                                                  address */
#define LL_TIM_DMABURST_LENGTH_25TRANSFERS     (TIM_DCR_DBL_4 | TIM_DCR_DBL_3)    /*!< Transfer is done to 25 registers
                                                                                  starting from the DMA burst base
                                                                                  address */
#define LL_TIM_DMABURST_LENGTH_26TRANSFERS     (TIM_DCR_DBL_4 | TIM_DCR_DBL_3 \
                                                | TIM_DCR_DBL_0)                  /*!< Transfer is done to 26 registers
                                                                                  starting from the DMA burst base
                                                                                  address */
#define LL_TIM_DMABURST_LENGTH_27TRANSFERS     (TIM_DCR_DBL_4 | TIM_DCR_DBL_3 \
                                                | TIM_DCR_DBL_1)                  /*!< Transfer is done to 27 registers
                                                                                  starting from the DMA burst base
                                                                                  address */
#define LL_TIM_DMABURST_LENGTH_28TRANSFERS     (TIM_DCR_DBL_4 | TIM_DCR_DBL_3 \
                                                | TIM_DCR_DBL_1 | TIM_DCR_DBL_0)  /*!< Transfer is done to 28 registers
                                                                                  starting from the DMA burst base
                                                                                  address */
#define LL_TIM_DMABURST_LENGTH_29TRANSFERS     (TIM_DCR_DBL_4 | TIM_DCR_DBL_3 \
                                                | TIM_DCR_DBL_2)                  /*!< Transfer is done to 29 registers
                                                                                  starting from the DMA burst base
                                                                                  address */
#define LL_TIM_DMABURST_LENGTH_30TRANSFERS     (TIM_DCR_DBL_4 | TIM_DCR_DBL_3 \
                                                | TIM_DCR_DBL_2 | TIM_DCR_DBL_0)  /*!< Transfer is done to 30 registers
                                                                                  starting from the DMA burst base
                                                                                  address */
#define LL_TIM_DMABURST_LENGTH_31TRANSFERS     (TIM_DCR_DBL_4 | TIM_DCR_DBL_3 \
                                                | TIM_DCR_DBL_2 | TIM_DCR_DBL_1)  /*!< Transfer is done to 31 registers
                                                                                  starting from the DMA burst base
                                                                                  address */
#define LL_TIM_DMABURST_LENGTH_32TRANSFERS     TIM_DCR_DBL                        /*!< Transfer is done to 32 registers
                                                                                  starting from the DMA burst base
                                                                                  address */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_DMABURST_SOURCE DMA Burst Source
  * @{
  */
#define LL_TIM_DMABURST_UPD               TIM_DCR_DBSS_0                      /*!< Transfer source is update event */
#define LL_TIM_DMABURST_CC1               TIM_DCR_DBSS_1                      /*!< Transfer source is CC1 event */
#define LL_TIM_DMABURST_CC2               (TIM_DCR_DBSS_1 |  TIM_DCR_DBSS_0)  /*!< Transfer source is CC2 event */
#define LL_TIM_DMABURST_CC3               TIM_DCR_DBSS_2                      /*!< Transfer source is CC3 event */
#define LL_TIM_DMABURST_CC4               (TIM_DCR_DBSS_2 | TIM_DCR_DBSS_0)   /*!< Transfer source is CC4 event */
#define LL_TIM_DMABURST_COM               (TIM_DCR_DBSS_2 | TIM_DCR_DBSS_1)   /*!< Transfer source is COM event */
#define LL_TIM_DMABURST_TRGI              (TIM_DCR_DBSS_2 | TIM_DCR_DBSS_1 \
                                           | TIM_DCR_DBSS_0)                  /*!< Transfer source is trigger event */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM1_TI1  TIM1 Input Ch1
  * @{
  */
#define LL_TIM_TIM1_TI1_GPIO                 0x00000000U                                                     /*!< tim1_ti1 is connected to TIM1_CH1 */
#define LL_TIM_TIM1_TI1_COMP1_OUT            TIM_TISEL_TI1SEL_0                                              /*!< tim1_ti1 is connected to comp1_out */
#if defined(COMP2)
#define LL_TIM_TIM1_TI1_COMP2_OUT            TIM_TISEL_TI1SEL_1                                              /*!< tim1_ti1 is connected to comp2_out */
#endif /* COMP2 && !COMP3 */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM1_TI2  TIM1 Input Ch2
  * @{
  */
#define LL_TIM_TIM1_TI2_GPIO                 0x00000000U                                                     /*!< tim1_ti2 is connected to TIM1_CH2 */
/**
  * @}
  */

