MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_tim.h
/** @defgroup TIM_LL_EC_TIM1_TI3  TIM1 Input Ch3
  * @{
  */
#define LL_TIM_TIM1_TI3_GPIO                 0x00000000U                                                     /*!< tim1_ti3 is connected to TIM1_CH3 */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM1_TI4  TIM1 Input Ch4
  * @{
  */
#define LL_TIM_TIM1_TI4_GPIO                 0x00000000U                                                     /*!< tim1_ti4 is connected to TIM1_CH4 */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM2_TI1  TIM2 Input Ch1
  * @{
  */
#define LL_TIM_TIM2_TI1_GPIO                 0x00000000U                                                     /*!< tim2_ti1 is connected to TIM2_CH1 */
#define LL_TIM_TIM2_TI1_COMP1_OUT            TIM_TISEL_TI1SEL_0                                              /*!< tim2_ti1 is connected to comp1_out */
#if defined(COMP2)
#define LL_TIM_TIM2_TI1_COMP2_OUT            TIM_TISEL_TI1SEL_1                                              /*!< tim2_ti1 is connected to comp2_out */
#elif defined(ETH1)
#define LL_TIM_TIM2_TI1_ETH1_PTP_PPS_OUT     TIM_TISEL_TI1SEL_1                                              /*!< tim2_ti1 is connected to eth1_ptp_pps_out */
#endif /* COMP2 && !COMP3 */
#define LL_TIM_TIM2_TI1_LSI                  (TIM_TISEL_TI1SEL_1 | TIM_TISEL_TI1SEL_0)                       /*!< tim2_ti1 is connected to LSI */
#define LL_TIM_TIM2_TI1_LSE                  TIM_TISEL_TI1SEL_2                                              /*!< tim2_ti1 is connected to LSE */
#define LL_TIM_TIM2_TI1_RTC_WUT_TRG          (TIM_TISEL_TI1SEL_2 | TIM_TISEL_TI1SEL_0)                       /*!< tim2_ti1 is connected to rtc_wut_trg */
#if defined(TIM5)
#define LL_TIM_TIM2_TI1_TIM5_CH1             (TIM_TISEL_TI1SEL_2 | TIM_TISEL_TI1SEL_1)                       /*!< tim2_ti1 is connected to TIM5_CH1 */
#endif /* TIM5 */
#if defined(FDCAN1)
#define LL_TIM_TIM2_TI1_FDCAN1_RXEOF_EVT     (TIM_TISEL_TI1SEL_2 | TIM_TISEL_TI1SEL_1 | TIM_TISEL_TI1SEL_0)  /*!< tim2_ti1 is connected to fdcan1_rxeof_evt */
#endif /* FDCAN1 */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM2_TI2  TIM2 Input Ch2
  * @{
  */
#define LL_TIM_TIM2_TI2_GPIO                 0x00000000U                                                     /*!< tim2_ti2 is connected to TIM2_CH2 */
#define LL_TIM_TIM2_TI2_HSE_RTC              (TIM_TISEL_TI2SEL_1 | TIM_TISEL_TI2SEL_0)                       /*!< tim2_ti2 is connected to hse_1M_ck */
#define LL_TIM_TIM2_TI2_MCO1                 TIM_TISEL_TI2SEL_2                                              /*!< tim2_ti2 is connected to MCO1 */
#define LL_TIM_TIM2_TI2_MCO2                 (TIM_TISEL_TI2SEL_2 | TIM_TISEL_TI2SEL_0)                       /*!< tim2_ti2 is connected to MCO2 */
#if defined(FDCAN1)
#define LL_TIM_TIM2_TI2_FDCAN1_TXEOF_EVT     (TIM_TISEL_TI2SEL_2 | TIM_TISEL_TI2SEL_1 | TIM_TISEL_TI2SEL_0)  /*!< tim2_ti2 is connected to fdcan1_txeof_evt */
#endif /* FDCAN1 */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM2_TI3  TIM2 Input Ch3
  * @{
  */
#define LL_TIM_TIM2_TI3_GPIO                 0x00000000U                                                     /*!< tim2_ti3 is connected to TIM2_CH3 */
#if defined(FDCAN2)
#define LL_TIM_TIM2_TI3_FDCAN2_RXEOF_EVT     (TIM_TISEL_TI3SEL_2 | TIM_TISEL_TI3SEL_1 | TIM_TISEL_TI3SEL_0)  /*!< tim2_ti3 is connected to fdcan2_rxeof_evt */
#endif /* FDCAN2 */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM2_TI4  TIM2 Input Ch4
  * @{
  */
#define LL_TIM_TIM2_TI4_GPIO                 0x00000000U                                                     /*!< tim2_ti4 is connected to TIM2_CH4 */
#define LL_TIM_TIM2_TI4_COMP1_OUT            TIM_TISEL_TI4SEL_0                                              /*!< tim2_ti4 is connected to comp1_out */
#if defined(COMP2)
#define LL_TIM_TIM2_TI4_COMP2_OUT            TIM_TISEL_TI4SEL_1                                              /*!< tim2_ti4 is connected to comp2_out */
#endif /* COMP2 */
#if defined(FDCAN2)
#define LL_TIM_TIM2_TI4_FDCAN2_TXEOF_EVT     (TIM_TISEL_TI4SEL_2 | TIM_TISEL_TI4SEL_1 | TIM_TISEL_TI4SEL_0)  /*!< tim2_ti4 is connected to fdcan2_txeof_evt */
#endif /* FDCAN2 */
/**
  * @}
  */

#if defined(TIM3)
/** @defgroup TIM_LL_EC_TIM3_TI1  TIM3 Input Ch1
  * @{
  */
#define LL_TIM_TIM3_TI1_GPIO                 0x00000000U                                                     /*!< tim3_ti1 is connected to TIM3_CH1 */
#define LL_TIM_TIM3_TI1_COMP1_OUT            TIM_TISEL_TI1SEL_0                                              /*!< tim3_ti1 is connected to comp1_out */
#if defined(FDCAN2)
#define LL_TIM_TIM3_TI1_ETH1_PTP_PPS_OUT     TIM_TISEL_TI1SEL_1                                              /*!< tim3_ti1 is connected to eth1_ptp_pps_out */
#define LL_TIM_TIM3_TI1_FDCAN2_RXEOF_EVT     (TIM_TISEL_TI1SEL_2 | TIM_TISEL_TI1SEL_1 | TIM_TISEL_TI1SEL_0)  /*!< tim3_ti1 is connected to fdcan2_rxeof_evt */
#endif /* FDCAN2 */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM3_TI2  TIM3 Input Ch2
  * @{
  */
#define LL_TIM_TIM3_TI2_GPIO                 0x00000000U                                                     /*!< tim3_ti2 is connected to TIM3_CH2 */
#if defined(FDCAN2)
#define LL_TIM_TIM3_TI2_FDCAN2_TXEOF_EVT     (TIM_TISEL_TI2SEL_2 | TIM_TISEL_TI2SEL_1 | TIM_TISEL_TI2SEL_0)  /*!< tim3_ti2 is connected to fdcan2_txeof_evt */
#endif /* FDCAN2 */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM3_TI3  TIM3 Input Ch3
  * @{
  */
#define LL_TIM_TIM3_TI3_GPIO                 0x00000000U                                                     /*!< tim3_ti3 is connected to TIM3_CH3 */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM3_TI4  TIM3 Input Ch4
  * @{
  */
#define LL_TIM_TIM3_TI4_GPIO                 0x00000000U                                                     /*!< tim3_ti4 is connected to TIM3_CH4 */
/**
  * @}
  */

#endif /* TIM3 */

#if defined(TIM4)
/** @defgroup TIM_LL_EC_TIM4_TI1  TIM4 Input Ch1
  * @{
  */
#define LL_TIM_TIM4_TI1_GPIO                 0x00000000U                                                     /*!< tim4_ti1 is connected to TIM4_CH1 */
#define LL_TIM_TIM4_TI1_COMP1_OUT            TIM_TISEL_TI1SEL_0                                              /*!< tim4_ti1 is connected to comp1_out */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM4_TI2  TIM4 Input Ch2
  * @{
  */
#define LL_TIM_TIM4_TI2_GPIO                 0x00000000U                                                     /*!< tim4_ti2 is connected to TIM4_CH2 */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM4_TI3  TIM4 Input Ch3
  * @{
  */
#define LL_TIM_TIM4_TI3_GPIO                 0x00000000U                                                     /*!< tim4_ti3 is connected to TIM4_CH3 */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM4_TI4  TIM4 Input Ch4
  * @{
  */
#define LL_TIM_TIM4_TI4_GPIO                 0x00000000U                                                     /*!< tim4_ti4 is connected to TIM4_CH4 */
/**
  * @}
  */
#endif /* TIM4 */

#if defined(TIM5)
/** @defgroup TIM_LL_EC_TIM5_TI1  TIM5 Input Ch1
  * @{
  */
#define LL_TIM_TIM5_TI1_GPIO                 0x00000000U                                                     /*!< tim5_ti1 is connected to TIM5_CH1 */
#define LL_TIM_TIM5_TI1_COMP1_OUT            TIM_TISEL_TI1SEL_0                                              /*!< tim5_ti1 is connected to comp1_out */
/**
  * @}
  */

