MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_tim.h
/** @defgroup TIM_LL_EC_TIM5_TI2  TIM5 Input Ch2
  * @{
  */
#define LL_TIM_TIM5_TI2_GPIO                 0x00000000U                                                     /*!< tim5_ti2 is connected to TIM5_CH2 */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM5_TI3  TIM5 Input Ch3
  * @{
  */
#define LL_TIM_TIM5_TI3_GPIO                 0x00000000U                                                     /*!< tim5_ti3 is connected to TIM5_CH3 */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM5_TI4  TIM5 Input Ch4
  * @{
  */
#define LL_TIM_TIM5_TI4_GPIO                 0x00000000U                                                     /*!< tim5_ti4 is connected to TIM5_CH4 */
/**
  * @}
  */
#endif /* TIM5 */

/** @defgroup TIM_LL_EC_TIM8_TI1  TIM8 Input Ch1
  * @{
  */
#define LL_TIM_TIM8_TI1_GPIO                 0x00000000U                                                     /*!< tim8_ti1 is connected to TIM8_CH1 */
#define LL_TIM_TIM8_TI1_COMP1_OUT            TIM_TISEL_TI1SEL_0                                              /*!< tim8_ti1 is connected to comp1_out */
#if defined(COMP2)
#define LL_TIM_TIM8_TI1_COMP2_OUT            TIM_TISEL_TI1SEL_1                                              /*!< tim8_ti1 is connected to comp2_out */
#endif /* COMP2 && !COMP3 */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM8_TI2  TIM8 Input Ch2
  * @{
  */
#define LL_TIM_TIM8_TI2_GPIO                 0x00000000U                                                     /*!< tim8_ti2 is connected to TIM8_CH2 */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM8_TI3  TIM8 Input Ch3
  * @{
  */
#define LL_TIM_TIM8_TI3_GPIO                 0x00000000U                                                     /*!< tim8_ti3 is connected to TIM8_CH3 */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM8_TI4  TIM8 Input Ch4
  * @{
  */
#define LL_TIM_TIM8_TI4_GPIO                 0x00000000U                                                     /*!< tim8_ti4 is connected to TIM8_CH4 */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM12_TI1  TIM12 Input Ch1
  * @{
  */
#define LL_TIM_TIM12_TI1_GPIO                0x00000000U                                                     /*!< tim12_ti1 is connected to TIM12_CH1 */
#define LL_TIM_TIM12_TI1_COMP1_OUT           TIM_TISEL_TI1SEL_0                                              /*!< tim12_ti1 is connected to comp1_out */
#if defined(COMP2)
#define LL_TIM_TIM12_TI1_COMP2_OUT           TIM_TISEL_TI1SEL_1                                              /*!< tim12_ti1 is connected to comp2_out */
#endif /* COMP2 && !COMP3 */
#define LL_TIM_TIM12_TI1_MCO1                (TIM_TISEL_TI1SEL_1 | TIM_TISEL_TI1SEL_0)                       /*!< tim12_ti1 is connected to MCO1 */
#define LL_TIM_TIM12_TI1_MCO2                TIM_TISEL_TI1SEL_2                                              /*!< tim12_ti1 is connected to MCO2 */
#define LL_TIM_TIM12_TI1_HSE_RTC             (TIM_TISEL_TI1SEL_2 | TIM_TISEL_TI1SEL_0)                       /*!< tim12_ti1 is connected to hse_1M_ck */
#define LL_TIM_TIM12_TI1_I3C1_IBI_ACK        (TIM_TISEL_TI1SEL_2 | TIM_TISEL_TI1SEL_1 | TIM_TISEL_TI1SEL_0)  /*!< tim12_ti1 is connected to i3c1_ibi_ack */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM12_TI2  TIM12 Input Ch2
  * @{
  */
#define LL_TIM_TIM12_TI2_GPIO                0x00000000U                                                     /*!< tim12_ti2 is connected to TIM12_CH2 */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM15_TI1  TIM15 Input Ch1
  * @{
  */
#define LL_TIM_TIM15_TI1_GPIO                0x00000000U                                                     /*!< tim15_ti1 is connected to TIM15_CH1 */
#define LL_TIM_TIM15_TI1_COMP1_OUT           TIM_TISEL_TI1SEL_0                                              /*!< tim15_ti1 is connected to comp1_out */
#if defined(COMP2)
#define LL_TIM_TIM15_TI1_COMP2_OUT           TIM_TISEL_TI1SEL_1                                              /*!< tim15_ti1 is connected to comp2_out */
#endif /* COMP2 && !COMP3 */
#define LL_TIM_TIM15_TI1_LSE                 (TIM_TISEL_TI1SEL_2 | TIM_TISEL_TI1SEL_0)                       /*!< tim15_ti1 is connected to LSE */
#if defined(FDCAN2)
#define LL_TIM_TIM15_TI1_FDCAN2_RXEOF_EVT    (TIM_TISEL_TI1SEL_2 | TIM_TISEL_TI1SEL_1 | TIM_TISEL_TI1SEL_0)  /*!< tim15_ti1 is connected to fdcan2_rxeof_evt */
#endif /* FDCAN2 */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM15_TI2  TIM15 Input Ch2
  * @{
  */
#define LL_TIM_TIM15_TI2_GPIO                0x00000000U                                                     /*!< tim15_ti2 is connected to TIM15_CH2 */
#if defined(FDCAN2)
#define LL_TIM_TIM15_TI2_FDCAN2_TXEOF_EVT    (TIM_TISEL_TI2SEL_2 | TIM_TISEL_TI2SEL_1 | TIM_TISEL_TI2SEL_0)  /*!< tim15_ti2 is connected to fdcan2_txeof_evt */
#endif /* FDCAN2 */
/**
  * @}
  */

#if defined(TIM16)
/** @defgroup TIM_LL_EC_TIM16_TI1  TIM16 Input Ch1
  * @{
  */
#define LL_TIM_TIM16_TI1_GPIO                0x00000000U                                                     /*!< tim16_ti1 is connected to TIM16_CH1 */
#define LL_TIM_TIM16_TI1_COMP1_OUT           TIM_TISEL_TI1SEL_0                                              /*!< tim16_ti1 is connected to comp1_out */
#define LL_TIM_TIM16_TI1_LSI                 (TIM_TISEL_TI1SEL_1 | TIM_TISEL_TI1SEL_0)                       /*!< tim16_ti1 is connected to LSI */
#define LL_TIM_TIM16_TI1_LSE                 TIM_TISEL_TI1SEL_2                                              /*!< tim16_ti1 is connected to LSE */
#define LL_TIM_TIM16_TI1_RTC_WUT_TRG         (TIM_TISEL_TI1SEL_2 | TIM_TISEL_TI1SEL_0)                       /*!< tim16_ti1 is connected to rtc_wut_trg */
#define LL_TIM_TIM16_TI1_MCO1                (TIM_TISEL_TI1SEL_2 | TIM_TISEL_TI1SEL_1)                       /*!< tim16_ti1 is connected to MCO1 */
#define LL_TIM_TIM16_TI1_MCO2                (TIM_TISEL_TI1SEL_2 | TIM_TISEL_TI1SEL_1 | TIM_TISEL_TI1SEL_0)  /*!< tim16_ti1 is connected to MCO2 */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM17_TI1  TIM17 Input Ch1
  * @{
  */
#define LL_TIM_TIM17_TI1_GPIO                0x00000000U                                                     /*!< tim17_ti1 is connected to TIM17_CH1 */
#define LL_TIM_TIM17_TI1_COMP1_OUT           TIM_TISEL_TI1SEL_0                                              /*!< tim17_ti1 is connected to comp1_out */
#define LL_TIM_TIM17_TI1_HSE_RTC             TIM_TISEL_TI1SEL_2                                              /*!< tim17_ti1 is connected to hse_rtc_ck */
#define LL_TIM_TIM17_TI1_MCO1                (TIM_TISEL_TI1SEL_2 | TIM_TISEL_TI1SEL_0)                       /*!< tim17_ti1 is connected to MCO1 */
#define LL_TIM_TIM17_TI1_MCO2                (TIM_TISEL_TI1SEL_2 | TIM_TISEL_TI1SEL_1)                       /*!< tim17_ti1 is connected to MCO2 */
#define LL_TIM_TIM17_TI1_I3C1_IBI_ACK        (TIM_TISEL_TI1SEL_2 | TIM_TISEL_TI1SEL_1 | TIM_TISEL_TI1SEL_0)  /*!< tim17_ti1 is connected to i3c1_ibi_ack */
/**
  * @}
  */
#endif /* TIM16 */


/** @defgroup TIM_LL_EC_OCREF_CLR_INT OCREF clear input selection
  * @{
  */
/** @defgroup TIM_LL_EC_TIM1_OCREF_CLR_INT  TIM1 OCRef Clear Input
  * @{
  */
#define LL_TIM_TIM1_OCREF_CLR_INT_ETR          TIM_SMCR_OCCS        /*!< tim1_ocref_clr is connected to tim_etrf */
#define LL_TIM_TIM1_OCREF_CLR_INT_COMP1_OUT    0x00000000U          /*!< tim1_ocref_clr is connected to comp1_out */
#if defined(COMP2)
#define LL_TIM_TIM1_OCREF_CLR_INT_COMP2_OUT    TIM_AF2_OCRSEL_0     /*!< tim1_ocref_clr is connected to comp2_out */
#endif /* COMP2 */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM2_OCREF_CLR_INT  TIM2 OCRef Clear Input
  * @{
  */
#define LL_TIM_TIM2_OCREF_CLR_INT_ETR          TIM_SMCR_OCCS        /*!< tim2_ocref_clr is connected to tim_etrf */
#define LL_TIM_TIM2_OCREF_CLR_INT_COMP1_OUT    0x00000000U          /*!< tim2_ocref_clr is connected to comp1_out */
#if defined(COMP2)
#define LL_TIM_TIM2_OCREF_CLR_INT_COMP2_OUT    TIM_AF2_OCRSEL_0     /*!< tim2_ocref_clr is connected to comp2_out */
#endif /* COMP2 */
/**
  * @}
  */

#if defined(TIM3)
/** @defgroup TIM_LL_EC_TIM3_OCREF_CLR_INT  TIM3 OCRef Clear Input
  * @{
  */
#define LL_TIM_TIM3_OCREF_CLR_INT_ETR          TIM_SMCR_OCCS        /*!< tim3_ocref_clr is connected to tim_etrf */
#define LL_TIM_TIM3_OCREF_CLR_INT_COMP1_OUT    0x00000000U          /*!< tim3_ocref_clr is connected to comp1_out */
/**
  * @}
  */
#endif /* TIM3 */

#if defined(TIM4)
/** @defgroup TIM_LL_EC_TIM4_OCREF_CLR_INT  TIM4 OCRef Clear Input
  * @{
  */
#define LL_TIM_TIM4_OCREF_CLR_INT_ETR          TIM_SMCR_OCCS        /*!< tim4_ocref_clr is connected to tim_etrf */
#define LL_TIM_TIM4_OCREF_CLR_INT_COMP1_OUT    0x00000000U          /*!< tim4_ocref_clr is connected to comp1_out */
/**
  * @}
  */
#endif /* TIM4 */

#if defined(TIM5)
/** @defgroup TIM_LL_EC_TIM5_OCREF_CLR_INT  TIM5 OCRef Clear Input
  * @{
  */
#define LL_TIM_TIM5_OCREF_CLR_INT_ETR          TIM_SMCR_OCCS        /*!< tim5_ocref_clr is connected to tim_etrf */
#define LL_TIM_TIM5_OCREF_CLR_INT_COMP1_OUT    0x00000000U          /*!< tim5_ocref_clr is connected to comp1_out */
/**
  * @}
  */
#endif /* TIM5 */

/** @defgroup TIM_LL_EC_TIM8_OCREF_CLR_INT  TIM8 OCRef Clear Input
  * @{
  */
#define LL_TIM_TIM8_OCREF_CLR_INT_ETR          TIM_SMCR_OCCS        /*!< tim8_ocref_clr is connected to tim_etrf */
#define LL_TIM_TIM8_OCREF_CLR_INT_COMP1_OUT    0x00000000U          /*!< tim8_ocref_clr is connected to comp1_out */
#if defined(COMP2)
#define LL_TIM_TIM8_OCREF_CLR_INT_COMP2_OUT    TIM_AF2_OCRSEL_0     /*!< tim8_ocref_clr is connected to comp2_out */
#endif /* COMP2 */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM15_OCREF_CLR_INT  TIM15 OCRef Clear Input
  * @{
  */
#define LL_TIM_TIM15_OCREF_CLR_INT_COMP1_OUT   0x00000000U          /*!< tim15_ocref_clr is connected to comp1_out */
#if defined(COMP2)
#define LL_TIM_TIM15_OCREF_CLR_INT_COMP2_OUT   TIM_AF2_OCRSEL_0     /*!< tim15_ocref_clr is connected to comp2_out */
#endif /* COMP2 */
/**
  * @}
  */

#if defined(TIM16)
/** @defgroup TIM_LL_EC_TIM16_OCREF_CLR_INT  TIM16 OCRef Clear Input
  * @{
  */
#define LL_TIM_TIM16_OCREF_CLR_INT_COMP1_OUT   0x00000000U          /*!< tim16_ocref_clr is connected to comp1_out */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM17_OCREF_CLR_INT  TIM16 OCRef Clear Input
  * @{
  */
#define LL_TIM_TIM17_OCREF_CLR_INT_COMP1_OUT   0x00000000U          /*!< tim17_ocref_clr is connected to comp1_out */
/**
  * @}
  */
#endif /* TIM16 */

/**
  * @}
  */

/** @defgroup TIM_LL_EC_INDEX_DIR index direction selection
  * @{
  */
#define LL_TIM_INDEX_UP_DOWN     0x00000000U         /*!< Index resets the counter whatever the direction */
#define LL_TIM_INDEX_UP          TIM_ECR_IDIR_0      /*!< Index resets the counter when up-counting only */
#define LL_TIM_INDEX_DOWN        TIM_ECR_IDIR_1      /*!< Index resets the counter when down-counting only */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_INDEX_BLANK index blanking selection
  * @{
  */
#define LL_TIM_INDEX_BLANK_ALWAYS     0x00000000U         /*!< Index always active */
#define LL_TIM_INDEX_BLANK_TI3        TIM_ECR_IBLK_0      /*!< Index disabled when TI3 input is active,
                                                           as per CC3P bitfield */
#define LL_TIM_INDEX_BLANK_TI4        TIM_ECR_IBLK_1      /*!< Index disabled when TI4 input is active,
                                                           as per CC4P bitfield */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_INDEX_POSITION index positioning selection
  * @{
  */
#define LL_TIM_INDEX_POSITION_DOWN_DOWN    0x00000000U                  /*!< Index resets the counter when AB = 00 */
#define LL_TIM_INDEX_POSITION_DOWN_UP      TIM_ECR_IPOS_0               /*!< Index resets the counter when AB = 01 */
#define LL_TIM_INDEX_POSITION_UP_DOWN      TIM_ECR_IPOS_1               /*!< Index resets the counter when AB = 10 */
#define LL_TIM_INDEX_POSITION_UP_UP        (TIM_ECR_IPOS_1 \
                                            | TIM_ECR_IPOS_0)           /*!< Index resets the counter when AB = 11 */
#define LL_TIM_INDEX_POSITION_DOWN         0x00000000U                  /*!< Index resets the counter when clock is 0 */
#define LL_TIM_INDEX_POSITION_UP           TIM_ECR_IPOS_0               /*!< Index resets the counter when clock is 1 */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_FIRST_INDEX first index selection
  * @{
  */
#define LL_TIM_INDEX_ALL           0x00000000U                           /*!< Index is always active */
#define LL_TIM_INDEX_FIRST_ONLY    TIM_ECR_FIDX                          /*!< The first Index only resets the counter */
/**
  * @}
  */
/** @defgroup TIM_LL_EC_PWPRSC Pulse on compare pulse width prescaler
  * @{
  */
#define LL_TIM_PWPRSC_DIV1     0x00000000U                           /*!< Pulse on compare pulse width prescaler 1 */
#define LL_TIM_PWPRSC_DIV2     TIM_ECR_PWPRSC_0                      /*!< Pulse on compare pulse width prescaler 2 */
#define LL_TIM_PWPRSC_DIV4     TIM_ECR_PWPRSC_1                      /*!< Pulse on compare pulse width prescaler 4 */
#define LL_TIM_PWPRSC_DIV8     (TIM_ECR_PWPRSC_1 | TIM_ECR_PWPRSC_0) /*!< Pulse on compare pulse width prescaler 8 */
#define LL_TIM_PWPRSC_DIV16    TIM_ECR_PWPRSC_2                      /*!< Pulse on compare pulse width prescaler 16 */
#define LL_TIM_PWPRSC_DIV32    (TIM_ECR_PWPRSC_2 | TIM_ECR_PWPRSC_0) /*!< Pulse on compare pulse width prescaler 32 */
#define LL_TIM_PWPRSC_DIV64    (TIM_ECR_PWPRSC_2 | TIM_ECR_PWPRSC_1) /*!< Pulse on compare pulse width prescaler 64 */
#define LL_TIM_PWPRSC_DIV128   (TIM_ECR_PWPRSC_2 | TIM_ECR_PWPRSC_1 \
                                | TIM_ECR_PWPRSC_0)                  /*!< Pulse on compare pulse width prescaler 128 */
/**
  * @}
  */


/** @defgroup TIM_LL_EC_SW_EVENT Software Event
  * @{
  */
#define LL_TIM_SW_EVENT_UPD       TIM_EGR_UG      /*!< Update generation */
#define LL_TIM_SW_EVENT_CC1       TIM_EGR_CC1G    /*!< Capture/Compare 1 generation */
#define LL_TIM_SW_EVENT_CC2       TIM_EGR_CC2G    /*!< Capture/Compare 2 generation */
#define LL_TIM_SW_EVENT_CC3       TIM_EGR_CC3G    /*!< Capture/Compare 3 generation */
#define LL_TIM_SW_EVENT_CC4       TIM_EGR_CC4G    /*!< Capture/Compare 4 generation */
#define LL_TIM_SW_EVENT_COM       TIM_EGR_COMG    /*!< Commutation generation */
#define LL_TIM_SW_EVENT_TRGI      TIM_EGR_TG      /*!< Trigger generation */
#define LL_TIM_SW_EVENT_BRK       TIM_EGR_BG      /*!< Break generation */
#define LL_TIM_SW_EVENT_BRK2      TIM_EGR_B2G     /*!< Break 2 generation */

/** Legacy definitions for compatibility purpose
  * @cond LEGACY_DEFINITIONS
  */
#define LL_TIM_BKIN_SOURCE_DFBK  LL_TIM_BKIN_SOURCE_DF1BK
/**
  * @endcond
  */

/**
  * @}
  */

