MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_tim.h
/* Exported macro ----------------------------------------------------------------------------------------------------*/
/** @defgroup TIM_LL_Exported_Macros LL TIM Macros
  * @{
  */

/** @defgroup TIM_LL_EM_WRITE_READ Common Write and read registers Macros
  * @{
  */
/**
  * @brief  Write a value in TIM register.
  * @param  instance TIM Instance
  * @param  reg Register to be written
  * @param  value Value to be written in the register
  */
#define LL_TIM_WRITE_REG(instance, reg, value) STM32_WRITE_REG((instance)->reg, (value))

/**
  * @brief  Read a value in TIM register.
  * @param  instance TIM Instance
  * @param  reg Register to be read
  * @retval Register value
  */
#define LL_TIM_READ_REG(instance, reg) STM32_READ_REG((instance)->reg)
/**
  * @}
  */

/**
  * @brief  HELPER macro that retrieves the UIFCPY flag from the counter value.
  * @param  cnt Counter value
  * @note   e.g., LL_TIM_GETFLAG_UIFCPY(@ref LL_TIM_GetCounter()).
  * @note   Relevant only if UIF flag remapping has been enabled (UIF status bit is copied
  *         to TIMx_CNT register bit 31).
  * @retval UIF status bit
  */
#define LL_TIM_GETFLAG_UIFCPY(cnt)  \
  (STM32_READ_BIT((cnt), TIM_CNT_UIFCPY) >> TIM_CNT_UIFCPY_Pos)

/**
  * @brief  HELPER macro calculating DTG[0:7] in the TIMx_BDTR register to achieve the requested dead time duration.
  * @param  tim_clk timer input clock frequency (in Hz)
  * @param  clk_div This parameter can be one of the following values:
  *         @arg @ref LL_TIM_CLOCKDIVISION_DIV1
  *         @arg @ref LL_TIM_CLOCKDIVISION_DIV2
  *         @arg @ref LL_TIM_CLOCKDIVISION_DIV4
  *         @arg @ref LL_TIM_CLOCKDIVISION_DIV8
  * @param  dt deadtime duration (in ns)
  * @note   e.g., LL_TIM_CALC_DEADTIME(80000000, @ref LL_TIM_GetClockDivision(), 120).
  * @retval DTG[0:7]
  */
#define LL_TIM_CALC_DEADTIME(tim_clk, clk_div, dt)  \
  ( (((uint64_t)((dt)*1000U)) < ((LL_TIM_DT_DELAY_1+1U) * LL_TIM_CALC_DTS((tim_clk), (clk_div))))    ?  \
    (uint8_t)(((uint64_t)((dt)*1000U) / LL_TIM_CALC_DTS((tim_clk), (clk_div)))  & LL_TIM_DT_DELAY_1) :      \
    (((uint64_t)((dt)*1000U)) < ((64U + (LL_TIM_DT_DELAY_2+1U)) * 2U * LL_TIM_CALC_DTS((tim_clk), (clk_div))))  ?  \
    (uint8_t)(LL_TIM_DT_RANGE_2 | ((uint8_t)((uint8_t)((((uint64_t)((dt)*1000U))/ LL_TIM_CALC_DTS((tim_clk),   \
                                                        (clk_div))) >> 1U) - (uint8_t) 64) & LL_TIM_DT_DELAY_2)) :\
    (((uint64_t)((dt)*1000U)) < ((32U + (LL_TIM_DT_DELAY_3+1U)) * 8U * LL_TIM_CALC_DTS((tim_clk), (clk_div))))  ?  \
    (uint8_t)(LL_TIM_DT_RANGE_3 | ((uint8_t)((uint8_t)(((((uint64_t)(dt)*1000U))/ LL_TIM_CALC_DTS((tim_clk),  \
                                                        (clk_div))) >> 3U) - (uint8_t) 32) & LL_TIM_DT_DELAY_3)) :\
    (((uint64_t)((dt)*1000U)) < ((32U + (LL_TIM_DT_DELAY_4+1U)) * 16U * LL_TIM_CALC_DTS((tim_clk), (clk_div)))) ?  \
    (uint8_t)(LL_TIM_DT_RANGE_4 | ((uint8_t)((uint8_t)(((((uint64_t)(dt)*1000U))/ LL_TIM_CALC_DTS((tim_clk),  \
                                                        (clk_div))) >> 4U) - (uint8_t) 32) & LL_TIM_DT_DELAY_4)) :\
    0U)

/**
  * @brief  HELPER macro calculating the prescaler value to achieve the required counter clock frequency.
  * @param  tim_clk timer input clock frequency (in Hz)
  * @param  cnt_clk counter clock frequency (in Hz)
  * @note   e.g., LL_TIM_CALC_PSC(80000000, 1000000).
  * @retval Prescaler value (between Min_Data=0 and Max_Data=65535)
  */
#define LL_TIM_CALC_PSC(tim_clk, cnt_clk)   \
  (((tim_clk) >= (cnt_clk)) ? (uint32_t)((((tim_clk) + (cnt_clk)/2U)/(cnt_clk)) - 1U) : 0U)

/**
  * @brief  HELPER macro calculating the auto-reload value to achieve the required output signal frequency.
  * @param  tim_clk timer input clock frequency (in Hz)
  * @param  psc prescaler
  * @param  freq output signal frequency (in Hz)
  * @note   e.g., LL_TIM_CALC_ARR(1000000, @ref LL_TIM_GetPrescaler(), 10000).
  * @retval Auto-reload value (between Min_Data=0 and Max_Data=65535)
  */
#define LL_TIM_CALC_ARR(tim_clk, psc, freq) \
  ((((tim_clk)/((psc) + 1U)) >= (freq)) ? (((tim_clk)/((freq) * ((psc) + 1U))) - 1U) : 0U)

/**
  * @brief  HELPER macro calculating the auto-reload value, with dithering feature enabled, to achieve the required
  *         output signal frequency.
  * @param  tim_clk timer input clock frequency (in Hz)
  * @param  psc prescaler
  * @param  freq output signal frequency (in Hz)
  * @note   e.g., LL_TIM_CALC_ARR_DITHER(1000000, @ref LL_TIM_GetPrescaler(), 10000).
  * @retval Auto-reload value (between Min_Data=0 and Max_Data=65535)
  */
#define LL_TIM_CALC_ARR_DITHER(tim_clk, psc, freq) \
  ((((tim_clk)/((psc) + 1U)) >= (freq)) ? \
   (uint32_t)((((uint64_t)(tim_clk) * 16U/((freq) * ((psc) + 1U))) - 16U)) : 0U)

/**
  * @brief  HELPER macro calculating the compare value required to achieve the required timer output compare
  *         active/inactive delay.
  * @param  tim_clk timer input clock frequency (in Hz)
  * @param  psc prescaler
  * @param  delay timer output compare active/inactive delay (in us)
  * @note   e.g., LL_TIM_CALC_DELAY(1000000, @ref LL_TIM_GetPrescaler(), 10).
  * @retval Compare value (between Min_Data=0 and Max_Data=65535)
  */
#define LL_TIM_CALC_DELAY(tim_clk, psc, delay)  \
  ((uint32_t)(((uint64_t)(tim_clk) * (uint64_t)(delay)) \
              / ((uint64_t)1000000U * (uint64_t)((psc) + 1U))))

/**
  * @brief  HELPER macro calculating the compare value, with dithering feature enabled, to achieve the required timer
  *         output compare active/inactive delay.
  * @param  tim_clk timer input clock frequency (in Hz)
  * @param  psc prescaler
  * @param  delay timer output compare active/inactive delay (in us)
  * @note   e.g., LL_TIM_CALC_DELAY_DITHER(1000000, @ref LL_TIM_GetPrescaler(), 10).
  * @retval Compare value (between Min_Data=0 and Max_Data=65535)
  */
#define LL_TIM_CALC_DELAY_DITHER(tim_clk, psc, delay)  \
  ((uint32_t)(((uint64_t)(tim_clk) * (uint64_t)(delay) * 16U) \
              / ((uint64_t)1000000U * (uint64_t)((psc) + 1U))))

/**
  * @brief  HELPER macro calculating the auto-reload value to achieve the required pulse duration
  *         (when the timer operates in one pulse mode).
  * @param  tim_clk timer input clock frequency (in Hz)
  * @param  psc prescaler
  * @param  delay timer output compare active/inactive delay (in us)
  * @param  pulse pulse duration (in us)
  * @note   e.g., LL_TIM_CALC_PULSE(1000000, @ref LL_TIM_GetPrescaler(), 10, 20).
  * @retval Auto-reload value (between Min_Data=0 and Max_Data=65535)
  */
#define LL_TIM_CALC_PULSE(tim_clk, psc, delay, pulse)  \
  ((uint32_t)(LL_TIM_CALC_DELAY((tim_clk), (psc), (pulse)) \
              + LL_TIM_CALC_DELAY((tim_clk), (psc), (delay))))

/**
  * @brief  HELPER macro calculating the auto-reload value, with dithering feature enabled, to achieve the required
  *         pulse duration (when the timer operates in one pulse mode).
  * @param  tim_clk timer input clock frequency (in Hz)
  * @param  psc prescaler
  * @param  delay timer output compare active/inactive delay (in us)
  * @param  pulse pulse duration (in us)
  * @note   e.g., LL_TIM_CALC_PULSE_DITHER(1000000, @ref LL_TIM_GetPrescaler(), 10, 20).
  * @retval Auto-reload value (between Min_Data=0 and Max_Data=65535)
  */
#define LL_TIM_CALC_PULSE_DITHER(tim_clk, psc, delay, pulse)  \
  ((uint32_t)(LL_TIM_CALC_DELAY_DITHER((tim_clk), (psc), (pulse)) \
              + LL_TIM_CALC_DELAY_DITHER((tim_clk), (psc), (delay))))

/**
  * @brief  HELPER macro retrieving the ratio of the input capture prescaler.
  * @param  ic_psc This parameter can be one of the following values:
  *         @arg @ref LL_TIM_ICPSC_DIV1
  *         @arg @ref LL_TIM_ICPSC_DIV2
  *         @arg @ref LL_TIM_ICPSC_DIV4
  *         @arg @ref LL_TIM_ICPSC_DIV8
  * @note   e.g., LL_TIM_GET_ICPSC_RATIO(@ref LL_TIM_IC_GetPrescaler()).
  * @retval Input capture prescaler ratio (1, 2, 4, or 8).
  */
#define LL_TIM_GET_ICPSC_RATIO(ic_psc)  \
  ((uint32_t)(0x01U << (((ic_psc) >> 16U) >> TIM_CCMR1_IC1PSC_Pos)))


/**
  * @}
  */

/* Exported functions ------------------------------------------------------------------------------------------------*/
/** @defgroup TIM_LL_Exported_Functions LL TIM Functions
  * @{
  */

/** @defgroup TIM_LL_EF_Time_Base Time Base configuration
  * @{
  */
/**
  * @brief  Enable timer counter.
  * @rmtoll
  *  CR1          CEN           LL_TIM_EnableCounter
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_EnableCounter(TIM_TypeDef *timx)
{
  STM32_SET_BIT(timx->CR1, TIM_CR1_CEN);
}

/**
  * @brief  Disable timer counter.
  * @rmtoll
  *  CR1          CEN           LL_TIM_DisableCounter
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_DisableCounter(TIM_TypeDef *timx)
{
  STM32_CLEAR_BIT(timx->CR1, TIM_CR1_CEN);
}

/**
  * @brief  Indicates whether the timer counter is enabled.
  * @rmtoll
  *  CR1          CEN           LL_TIM_IsEnabledCounter
  * @param  timx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsEnabledCounter(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->CR1, TIM_CR1_CEN) == (TIM_CR1_CEN)) ? 1UL : 0UL);
}

/**
  * @brief  Enable update event generation.
  * @rmtoll
  *  CR1          UDIS          LL_TIM_EnableUpdateEvent
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_EnableUpdateEvent(TIM_TypeDef *timx)
{
  STM32_CLEAR_BIT(timx->CR1, TIM_CR1_UDIS);
}

/**
  * @brief  Disable update event generation.
  * @rmtoll
  *  CR1          UDIS          LL_TIM_DisableUpdateEvent
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_DisableUpdateEvent(TIM_TypeDef *timx)
{
  STM32_SET_BIT(timx->CR1, TIM_CR1_UDIS);
}

/**
  * @brief  Indicates whether update event generation is enabled.
  * @rmtoll
  *  CR1          UDIS          LL_TIM_IsEnabledUpdateEvent
  * @param  timx Timer instance
  * @retval Inverted state of bit (0 or 1).
  */
__STATIC_INLINE uint32_t LL_TIM_IsEnabledUpdateEvent(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->CR1, TIM_CR1_UDIS) == 0U) ? 1UL : 0UL);
}

/**
  * @brief  Set update event source.
  * @rmtoll
  *  CR1          URS           LL_TIM_SetUpdateSource
  * @param  timx Timer instance
  * @param  update_source This parameter can be one of the following values:
  *         @arg @ref LL_TIM_UPDATESOURCE_REGULAR
  *         @arg @ref LL_TIM_UPDATESOURCE_COUNTER
  * @note Update event source set to LL_TIM_UPDATESOURCE_REGULAR: any of the following events
  *       generate an update interrupt or DMA request if enabled:
  *        - Counter overflow/underflow
  *        - Setting the UG bit
  *        - Update generation through the slave mode controller
  * @note Update event source set to LL_TIM_UPDATESOURCE_COUNTER: only counter
  *       overflow/underflow generates an update interrupt or DMA request if enabled.
  */
__STATIC_INLINE void LL_TIM_SetUpdateSource(TIM_TypeDef *timx, uint32_t update_source)
{
  STM32_MODIFY_REG(timx->CR1, TIM_CR1_URS, update_source);
}

/**
  * @brief  Get actual event update source.
  * @rmtoll
  *  CR1          URS           LL_TIM_GetUpdateSource
  * @param  timx Timer instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_TIM_UPDATESOURCE_REGULAR
  *         @arg @ref LL_TIM_UPDATESOURCE_COUNTER
  */
__STATIC_INLINE uint32_t LL_TIM_GetUpdateSource(const TIM_TypeDef *timx)
{
  return (uint32_t)(STM32_READ_BIT(timx->CR1, TIM_CR1_URS));
}

/**
  * @brief  Enable one-pulse mode (OPM).
  * @rmtoll
  *  CR1          OPM           LL_TIM_EnableOnePulseMode
  * @param  timx Timer instance
  * @note   When OPM is set, the timer stops counting at the next update event (UEV).
  */
__STATIC_INLINE void LL_TIM_EnableOnePulseMode(TIM_TypeDef *timx)
{
  STM32_SET_BIT(timx->CR1, TIM_CR1_OPM);
}

/**
  * @brief  Disable one-pulse mode (OPM).
  * @rmtoll
  *  CR1          OPM           LL_TIM_DisableOnePulseMode
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_DisableOnePulseMode(TIM_TypeDef *timx)
{
  STM32_CLEAR_BIT(timx->CR1, TIM_CR1_OPM);
}

/**
  * @brief  Indicates whether one-pulse mode (OPM) is enabled.
  * @rmtoll
  *  CR1          OPM           LL_TIM_IsEnabledOnePulseMode
  * @param  timx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsEnabledOnePulseMode(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->CR1, TIM_CR1_OPM) == (TIM_CR1_OPM)) ? 1UL : 0UL);
}

/**
  * @brief  Set the timer counter counting mode.
  * @rmtoll
  *  CR1          DIR           LL_TIM_SetCounterMode \n
  *  CR1          CMS           LL_TIM_SetCounterMode
  * @param  timx Timer instance
  * @param  mode This parameter can be one of the following values:
  *         @arg @ref LL_TIM_COUNTERMODE_UP
  *         @arg @ref LL_TIM_COUNTERMODE_DOWN
  *         @arg @ref LL_TIM_COUNTERMODE_CENTER_UP
  *         @arg @ref LL_TIM_COUNTERMODE_CENTER_DOWN
  *         @arg @ref LL_TIM_COUNTERMODE_CENTER_UP_DOWN
  * @note Macro IS_TIM_COUNTER_MODE_SELECT_INSTANCE(timx) can be used to
  *       check whether or not the counter mode selection feature is supported
  *       by a timer instance.
  * @note Switching from Center Aligned counter mode to Edge counter mode (or reverse)
  *       requires a timer reset to avoid unexpected direction
  *       due to DIR bit readonly in center aligned mode.
  */
__STATIC_INLINE void LL_TIM_SetCounterMode(TIM_TypeDef *timx, uint32_t mode)
{
  STM32_MODIFY_REG(timx->CR1, (TIM_CR1_DIR | TIM_CR1_CMS), mode);
}

/**
  * @brief  Get actual counter mode.
  * @rmtoll
  *  CR1          DIR           LL_TIM_GetCounterMode \n
  *  CR1          CMS           LL_TIM_GetCounterMode
  * @param  timx Timer instance
  * @note Macro IS_TIM_COUNTER_MODE_SELECT_INSTANCE(timx) can be used to
  *       check whether or not the counter mode selection feature is supported
  *       by a timer instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_TIM_COUNTERMODE_UP
  *         @arg @ref LL_TIM_COUNTERMODE_DOWN
  *         @arg @ref LL_TIM_COUNTERMODE_CENTER_UP
  *         @arg @ref LL_TIM_COUNTERMODE_CENTER_DOWN
  *         @arg @ref LL_TIM_COUNTERMODE_CENTER_UP_DOWN
  */
__STATIC_INLINE uint32_t LL_TIM_GetCounterMode(const TIM_TypeDef *timx)
{
  uint32_t counter_mode;

  counter_mode = (uint32_t)(STM32_READ_BIT(timx->CR1, TIM_CR1_CMS));

  if (counter_mode == 0U)
  {
    counter_mode = (uint32_t)(STM32_READ_BIT(timx->CR1, TIM_CR1_DIR));
  }

