MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_tim.h
  return counter_mode;
}

/**
  * @brief  Enable auto-reload (ARR) preload.
  * @rmtoll
  *  CR1          ARPE          LL_TIM_EnableARRPreload
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_EnableARRPreload(TIM_TypeDef *timx)
{
  STM32_SET_BIT(timx->CR1, TIM_CR1_ARPE);
}

/**
  * @brief  Disable auto-reload (ARR) preload.
  * @rmtoll
  *  CR1          ARPE          LL_TIM_DisableARRPreload
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_DisableARRPreload(TIM_TypeDef *timx)
{
  STM32_CLEAR_BIT(timx->CR1, TIM_CR1_ARPE);
}

/**
  * @brief  Indicates whether auto-reload (ARR) preload is enabled.
  * @rmtoll
  *  CR1          ARPE          LL_TIM_IsEnabledARRPreload
  * @param  timx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsEnabledARRPreload(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->CR1, TIM_CR1_ARPE) == (TIM_CR1_ARPE)) ? 1UL : 0UL);
}

/**
  * @brief  Set the division ratio between the timer kernel clock (tim_ker_ck) and the DTS sampling clock (DTS_ck)
  *         used by the dead-time generators (when supported) and the break/break2 filters.
  * @rmtoll
  *  CR1          CKD           LL_TIM_SetClockDivision
  * @param  timx Timer instance
  * @param  clock_division This parameter can be one of the following values:
  *         @arg @ref LL_TIM_CLOCKDIVISION_DIV1
  *         @arg @ref LL_TIM_CLOCKDIVISION_DIV2
  *         @arg @ref LL_TIM_CLOCKDIVISION_DIV4
  * @note Macro IS_TIM_CLOCK_DIVISION_INSTANCE(timx) can be used to check
  *       whether or not the clock division feature is supported by the timer
  *       instance.
  *         @arg @ref LL_TIM_CLOCKDIVISION_DIV8
  */
__STATIC_INLINE void LL_TIM_SetClockDivision(TIM_TypeDef *timx, uint32_t clock_division)
{
  STM32_MODIFY_REG(timx->CR1, TIM_CR1_CKD, clock_division);
}

/**
  * @brief  Get the actual division ratio between the timer kernel clock (tim_ker_ck) and the DTS sampling clock
  *         (DTS_ck) used by the dead-time generators (when supported) and the break/break2 filters.
  * @rmtoll
  *  CR1          CKD           LL_TIM_GetClockDivision
  * @param  timx Timer instance
  * @note Macro IS_TIM_CLOCK_DIVISION_INSTANCE(timx) can be used to check
  *       whether or not the clock division feature is supported by the timer
  *       instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_TIM_CLOCKDIVISION_DIV1
  *         @arg @ref LL_TIM_CLOCKDIVISION_DIV2
  *         @arg @ref LL_TIM_CLOCKDIVISION_DIV4
  *         @arg @ref LL_TIM_CLOCKDIVISION_DIV8
  */
__STATIC_INLINE uint32_t LL_TIM_GetClockDivision(const TIM_TypeDef *timx)
{
  return (uint32_t)(STM32_READ_BIT(timx->CR1, TIM_CR1_CKD));
}

/**
  * @brief  Set the division ratio between the DTS sampling clock (DTS_ck)
  *         and the DTS2 sampling clock (DTS2_ck) used by the digital filters.
  * @rmtoll
  *  CR1          CKD2          LL_TIM_SetClockDivision2
  * @param  timx Timer instance
  * @param  clock_division2 This parameter can be one of the following values:
  *         @arg @ref LL_TIM_CLOCKDIVISION2_DIV1
  *         @arg @ref LL_TIM_CLOCKDIVISION2_DIV4
  *         @arg @ref LL_TIM_CLOCKDIVISION2_DIV16
  *         @arg @ref LL_TIM_CLOCKDIVISION2_DIV64
  *         @arg @ref LL_TIM_CLOCKDIVISION2_DIV256
  *         @arg @ref LL_TIM_CLOCKDIVISION2_DIV1024
  *         @arg @ref LL_TIM_CLOCKDIVISION2_DIV4096
  *         @arg @ref LL_TIM_CLOCKDIVISION2_DIV16384
  *         @arg @ref LL_TIM_CLOCKDIVISION2_DIV65536
  * @note Macro IS_TIM_CLOCK_DIVISION_INSTANCE(timx) can be used to check
  *       whether or not the clock division feature is supported by the timer
  *       instance.
  */
__STATIC_INLINE void LL_TIM_SetClockDivision2(TIM_TypeDef *timx, uint32_t clock_division2)
{
  STM32_MODIFY_REG(timx->CR1, TIM_CR1_CKD2, clock_division2);
}

/**
  * @brief  Get the actual division ratio between the DTS sampling clock (DTS_ck)
  *         and the DTS2 sampling clock (DTS2_ck) used by the digital filters.
  * @rmtoll
  *  CR1          CKD2          LL_TIM_GetClockDivision2
  * @param  timx Timer instance
  * @note Macro IS_TIM_CLOCK_DIVISION_INSTANCE(timx) can be used to check
  *       whether or not the clock division feature is supported by the timer
  *       instance.
  * @retval Returned value can be a combination of the following values:
  *         @arg @ref LL_TIM_CLOCKDIVISION2_DIV1
  *         @arg @ref LL_TIM_CLOCKDIVISION2_DIV4
  *         @arg @ref LL_TIM_CLOCKDIVISION2_DIV16
  *         @arg @ref LL_TIM_CLOCKDIVISION2_DIV64
  *         @arg @ref LL_TIM_CLOCKDIVISION2_DIV256
  *         @arg @ref LL_TIM_CLOCKDIVISION2_DIV1024
  *         @arg @ref LL_TIM_CLOCKDIVISION2_DIV4096
  *         @arg @ref LL_TIM_CLOCKDIVISION2_DIV16384
  *         @arg @ref LL_TIM_CLOCKDIVISION2_DIV65536
  */
__STATIC_INLINE uint32_t LL_TIM_GetClockDivision2(const TIM_TypeDef *timx)
{
  return (uint32_t)(STM32_READ_BIT(timx->CR1, TIM_CR1_CKD2));
}

/**
  * @brief  Set the counter value.
  * @rmtoll
  *  CNT          CNT           LL_TIM_SetCounter
  * @param  timx Timer instance
  * @param  counter Counter value (between Min_Data=0 and Max_Data=0xFFFF or 0xFFFFFFFF)
  * @note Macro IS_TIM_32B_COUNTER_INSTANCE(timx) can be used to check
  *       whether or not a timer instance supports a 32-bit counter.
  * @note If dithering is activated, pay attention to the Counter value interpretation
  */
__STATIC_INLINE void LL_TIM_SetCounter(TIM_TypeDef *timx, uint32_t counter)
{
  STM32_WRITE_REG(timx->CNT, counter);
}

/**
  * @brief  Get the counter value.
  * @rmtoll
  *  CNT          CNT           LL_TIM_GetCounter
  * @param  timx Timer instance
  * @note Macro IS_TIM_32B_COUNTER_INSTANCE(timx) can be used to check
  *       whether or not a timer instance supports a 32-bit counter.
  * @note If dithering is activated, pay attention to the Counter value interpretation
  * @retval Counter value (between Min_Data=0 and Max_Data=0xFFFF or 0xFFFFFFFF)
  */
__STATIC_INLINE uint32_t LL_TIM_GetCounter(const TIM_TypeDef *timx)
{
  return (uint32_t)(STM32_READ_REG(timx->CNT));
}

/**
  * @brief  Get the current direction of the counter.
  * @rmtoll
  *  CR1          DIR           LL_TIM_GetDirection
  * @param  timx Timer instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_TIM_COUNTERDIRECTION_UP
  *         @arg @ref LL_TIM_COUNTERDIRECTION_DOWN
  */
__STATIC_INLINE uint32_t LL_TIM_GetDirection(const TIM_TypeDef *timx)
{
  return (uint32_t)(STM32_READ_BIT(timx->CR1, TIM_CR1_DIR));
}

/**
  * @brief  Set the prescaler value.
  * @rmtoll
  *  PSC          PSC           LL_TIM_SetPrescaler
  * @param  timx Timer instance
  * @param  prescaler between Min_Data=0 and Max_Data=65535
  * @note The counter clock frequency CK_CNT is equal to fCK_PSC / (PSC[15:0] + 1).
  * @note The prescaler can be changed on the fly as this control register is buffered. The new
  *       prescaler ratio is taken into account at the next update event.
  * @note Helper macro @ref LL_TIM_CALC_PSC can be used to calculate the prescaler parameter
  */
__STATIC_INLINE void LL_TIM_SetPrescaler(TIM_TypeDef *timx, uint32_t prescaler)
{
  STM32_WRITE_REG(timx->PSC, prescaler);
}

/**
  * @brief  Get the prescaler value.
  * @rmtoll
  *  PSC          PSC           LL_TIM_GetPrescaler
  * @param  timx Timer instance
  * @retval  Prescaler value between Min_Data=0 and Max_Data=65535
  */
__STATIC_INLINE uint32_t LL_TIM_GetPrescaler(const TIM_TypeDef *timx)
{
  return (uint32_t)(STM32_READ_REG(timx->PSC));
}

/**
  * @brief  Set the auto-reload value.
  * @rmtoll
  *  ARR          ARR           LL_TIM_SetAutoReload
  * @param  timx Timer instance
  * @param  auto_reload between Min_Data=0 and Max_Data=65535
  * @note The counter is blocked while the auto-reload value is null.
  * @note Macro IS_TIM_32B_COUNTER_INSTANCE(timx) can be used to check
  *       whether or not a timer instance supports a 32-bit counter.
  * @note Helper macro @ref LL_TIM_CALC_ARR can be used to calculate the auto_reload parameter
  *       In case dithering is activated,macro LL_TIM_CALC_ARR_DITHER can be used instead, to calculate the auto_reload
  *       parameter.
  */
__STATIC_INLINE void LL_TIM_SetAutoReload(TIM_TypeDef *timx, uint32_t auto_reload)
{
  STM32_WRITE_REG(timx->ARR, auto_reload);
}

/**
  * @brief  Get the auto-reload value.
  * @rmtoll
  *  ARR          ARR           LL_TIM_GetAutoReload
  * @param  timx Timer instance
  * @note Macro IS_TIM_32B_COUNTER_INSTANCE(timx) can be used to check
  *       whether or not a timer instance supports a 32-bit counter.
  * @note If dithering is activated, pay attention to the returned value interpretation
  * @retval Auto-reload value
  */
__STATIC_INLINE uint32_t LL_TIM_GetAutoReload(const TIM_TypeDef *timx)
{
  return (uint32_t)(STM32_READ_REG(timx->ARR));
}

/**
  * @brief  Set the repetition counter value.
  * @rmtoll
  *  RCR          REP           LL_TIM_SetRepetitionCounter
  * @param  timx Timer instance
  * @param  repetition_counter between Min_Data=0 and Max_Data=255 or 65535 for advanced timer.
  * @note Macro IS_TIM_REPETITION_COUNTER_INSTANCE(timx) can be used to check
  *       whether or not a timer instance supports a repetition counter.
  */
__STATIC_INLINE void LL_TIM_SetRepetitionCounter(TIM_TypeDef *timx, uint32_t repetition_counter)
{
  STM32_WRITE_REG(timx->RCR, repetition_counter);
}

/**
  * @brief  Get the repetition counter value.
  * @rmtoll
  *  RCR          REP           LL_TIM_GetRepetitionCounter
  * @param  timx Timer instance
  * @note Macro IS_TIM_REPETITION_COUNTER_INSTANCE(timx) can be used to check
  *       whether or not a timer instance supports a repetition counter.
  * @retval Repetition counter value
  */
__STATIC_INLINE uint32_t LL_TIM_GetRepetitionCounter(const TIM_TypeDef *timx)
{
  return (uint32_t)(STM32_READ_REG(timx->RCR));
}

/**
  * @brief  Force a continuous copy of the update interrupt flag (UIF) into the timer counter register (bit 31).
  * @rmtoll
  *  CR1          UIFREMAP      LL_TIM_EnableUIFRemap
  * @param  timx Timer instance
  * @note This allows both the counter value and a potential roll-over condition signalled by the UIFCPY flag to be read
  *       in an atomic way.
  */
__STATIC_INLINE void LL_TIM_EnableUIFRemap(TIM_TypeDef *timx)
{
  STM32_SET_BIT(timx->CR1, TIM_CR1_UIFREMAP);
}

/**
  * @brief  Disable update interrupt flag (UIF) remapping.
  * @rmtoll
  *  CR1          UIFREMAP      LL_TIM_DisableUIFRemap
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_DisableUIFRemap(TIM_TypeDef *timx)
{
  STM32_CLEAR_BIT(timx->CR1, TIM_CR1_UIFREMAP);
}

/**
  * @brief  Indicates whether the update interrupt flag (UIF)
  *         remapping is enabled.
  * @rmtoll
  *  CR1          UIFREMAP      LL_TIM_IsEnabledUIFRemap
  * @param  timx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsEnabledUIFRemap(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->CR1, TIM_CR1_UIFREMAP) == (TIM_CR1_UIFREMAP)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether update interrupt flag (UIF) copy is set.
  * @param  Counter Counter value
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsActiveUIFCPY(uint32_t Counter)
{
  return ((STM32_READ_BIT(Counter, TIM_CNT_UIFCPY) == (TIM_CNT_UIFCPY)) ? 1UL : 0UL);
}

/**
  * @brief  Enable dithering.
  * @rmtoll
  *  CR1          DITHEN          LL_TIM_EnableDithering
  * @param  timx Timer instance
  * @warning Dithering can only be enabled when the counter is disabled.
  */
__STATIC_INLINE void LL_TIM_EnableDithering(TIM_TypeDef *timx)
{
  STM32_SET_BIT(timx->CR1, TIM_CR1_DITHEN);
}

/**
  * @brief  Disable dithering.
  * @rmtoll
  *  CR1          DITHEN          LL_TIM_DisableDithering
  * @param  timx Timer instance
  * @warning Dithering can only be disabled when the counter is disabled.
  */
__STATIC_INLINE void LL_TIM_DisableDithering(TIM_TypeDef *timx)
{
  STM32_CLEAR_BIT(timx->CR1, TIM_CR1_DITHEN);
}

/**
  * @brief  Indicates whether dithering is activated.
  * @rmtoll
  *  CR1          DITHEN          LL_TIM_IsEnabledDithering
  * @param  timx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsEnabledDithering(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->CR1, TIM_CR1_DITHEN) == (TIM_CR1_DITHEN)) ? 1UL : 0UL);
}

/**
  * @}
  */

