MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_tim.h
/** @defgroup TIM_LL_EF_Capture_Compare Capture Compare configuration
  * @{
  */
/**
  * @brief  Enable  the capture/compare control bits (CCxE, CCxNE and OCxM) preload.
  * @rmtoll
  *  CR2          CCPC          LL_TIM_CC_EnablePreload
  * @param  timx Timer instance
  * @note CCxE, CCxNE and OCxM bits are preloaded, after having been written,
  *       they are updated only when a commutation event (COM) occurs.
  * @note Only on channels that have a complementary output.
  * @note Macro IS_TIM_COMMUTATION_EVENT_INSTANCE(timx) can be used to check
  *       whether or not a timer instance is able to generate a commutation event.
  */
__STATIC_INLINE void LL_TIM_CC_EnablePreload(TIM_TypeDef *timx)
{
  STM32_SET_BIT(timx->CR2, TIM_CR2_CCPC);
}

/**
  * @brief  Disable  the capture/compare control bits (CCxE, CCxNE and OCxM) preload.
  * @rmtoll
  *  CR2          CCPC          LL_TIM_CC_DisablePreload
  * @param  timx Timer instance
  * @note Macro IS_TIM_COMMUTATION_EVENT_INSTANCE(timx) can be used to check
  *       whether or not a timer instance is able to generate a commutation event.
  */
__STATIC_INLINE void LL_TIM_CC_DisablePreload(TIM_TypeDef *timx)
{
  STM32_CLEAR_BIT(timx->CR2, TIM_CR2_CCPC);
}

/**
  * @brief  Indicates whether the capture/compare control bits (CCxE, CCxNE and OCxM) preload is enabled.
  * @rmtoll
  *  CR2          CCPC          LL_TIM_CC_IsEnabledPreload
  * @param  timx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_CC_IsEnabledPreload(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->CR2, TIM_CR2_CCPC) == (TIM_CR2_CCPC)) ? 1UL : 0UL);
}

/**
  * @brief  Set the updated source of the capture/compare control bits (CCxE, CCxNE and OCxM).
  * @rmtoll
  *  CR2          CCUS          LL_TIM_CC_SetUpdate
  * @param  timx Timer instance
  * @param  cc_update_source This parameter can be one of the following values:
  *         @arg @ref LL_TIM_CCUPDATESOURCE_SOFTWARE
  *         @arg @ref LL_TIM_CCUPDATESOURCE_SOFTWARE_AND_TRIGGER
  * @note Macro IS_TIM_COMMUTATION_EVENT_INSTANCE(timx) can be used to check
  *       whether or not a timer instance is able to generate a commutation event.
  */
__STATIC_INLINE void LL_TIM_CC_SetUpdate(TIM_TypeDef *timx, uint32_t cc_update_source)
{
  STM32_MODIFY_REG(timx->CR2, TIM_CR2_CCUS, cc_update_source);
}

/**
  * @brief  Get the updated source of the capture/compare control bits (CCxE, CCxNE and OCxM).
  * @rmtoll
  *  CR2          CCUS          LL_TIM_CC_GetUpdate
  * @param  timx Timer instance
  * @note Macro IS_TIM_COMMUTATION_EVENT_INSTANCE(timx) can be used to check
  *       whether or not a timer instance is able to generate a commutation event.
  * @retval The returned value can be one of the following values:
  *         @arg @ref LL_TIM_CCUPDATESOURCE_SOFTWARE
  *         @arg @ref LL_TIM_CCUPDATESOURCE_SOFTWARE_AND_TRIGGER
  */
__STATIC_INLINE uint32_t LL_TIM_CC_GetUpdate(const TIM_TypeDef *timx)
{
  return (uint32_t)(STM32_READ_BIT(timx->CR2, TIM_CR2_CCUS));
}

/**
  * @brief  Set the trigger of the capture/compare DMA request.
  * @rmtoll
  *  CR2          CCDS          LL_TIM_CC_SetDMAReqTrigger
  * @param  timx Timer instance
  * @param  dma_req_trigger This parameter can be one of the following values:
  *         @arg @ref LL_TIM_CCDMAREQUEST_CC
  *         @arg @ref LL_TIM_CCDMAREQUEST_UPD
  */
__STATIC_INLINE void LL_TIM_CC_SetDMAReqTrigger(TIM_TypeDef *timx, uint32_t dma_req_trigger)
{
  STM32_MODIFY_REG(timx->CR2, TIM_CR2_CCDS, dma_req_trigger);
}

/**
  * @brief  Get actual trigger of the capture/compare DMA request.
  * @rmtoll
  *  CR2          CCDS          LL_TIM_CC_GetDMAReqTrigger
  * @param  timx Timer instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_TIM_CCDMAREQUEST_CC
  *         @arg @ref LL_TIM_CCDMAREQUEST_UPD
  */
__STATIC_INLINE uint32_t LL_TIM_CC_GetDMAReqTrigger(const TIM_TypeDef *timx)
{
  return (uint32_t)(STM32_READ_BIT(timx->CR2, TIM_CR2_CCDS));
}

/**
  * @brief  Set the lock level to freeze the
  *         configuration of several capture/compare parameters.
  * @rmtoll
  *  BDTR         LOCK          LL_TIM_CC_SetLockLevel
  * @param  timx Timer instance
  * @param  lock_level This parameter can be one of the following values:
  *         @arg @ref LL_TIM_LOCKLEVEL_OFF
  *         @arg @ref LL_TIM_LOCKLEVEL_1
  *         @arg @ref LL_TIM_LOCKLEVEL_2
  *         @arg @ref LL_TIM_LOCKLEVEL_3
  * @note Macro IS_TIM_BREAK_INSTANCE(timx) can be used to check whether or not
  *       the lock mechanism is supported by a timer instance.
  */
__STATIC_INLINE void LL_TIM_CC_SetLockLevel(TIM_TypeDef *timx, uint32_t lock_level)
{
  STM32_MODIFY_REG(timx->BDTR, TIM_BDTR_LOCK, lock_level);
}

/**
  * @brief  Get the lock level that freezes the
  *         configuration of several capture/compare parameters.
  * @rmtoll
  *  BDTR         LOCK          LL_TIM_CC_GetLockLevel
  * @param  timx Timer instance
  * @note Macro IS_TIM_BREAK_INSTANCE(timx) can be used to check whether or not
  *       the lock mechanism is supported by a timer instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_TIM_LOCKLEVEL_OFF
  *         @arg @ref LL_TIM_LOCKLEVEL_1
  *         @arg @ref LL_TIM_LOCKLEVEL_2
  *         @arg @ref LL_TIM_LOCKLEVEL_3
  */
__STATIC_INLINE uint32_t LL_TIM_CC_GetLockLevel(const TIM_TypeDef *timx)
{
  return (uint32_t)(STM32_READ_BIT(timx->BDTR, TIM_BDTR_LOCK));
}

/**
  * @brief  Enable capture/compare channels.
  * @rmtoll
  *  CCER         CC1E          LL_TIM_CC_EnableChannel \n
  *  CCER         CC1NE         LL_TIM_CC_EnableChannel \n
  *  CCER         CC2E          LL_TIM_CC_EnableChannel \n
  *  CCER         CC2NE         LL_TIM_CC_EnableChannel \n
  *  CCER         CC3E          LL_TIM_CC_EnableChannel \n
  *  CCER         CC3NE         LL_TIM_CC_EnableChannel \n
  *  CCER         CC4E          LL_TIM_CC_EnableChannel \n
  *  CCER         CC4NE         LL_TIM_CC_EnableChannel \n
  *  CCER         CC5E          LL_TIM_CC_EnableChannel \n
  *  CCER         CC6E          LL_TIM_CC_EnableChannel \n
  *  CCER         CC7E          LL_TIM_CC_EnableChannel
  * @param  timx Timer instance
  * @param  channels This parameter can be a combination of the following values:
  *         @arg @ref LL_TIM_CHANNEL_CH1
  *         @arg @ref LL_TIM_CHANNEL_CH1N
  *         @arg @ref LL_TIM_CHANNEL_CH2
  *         @arg @ref LL_TIM_CHANNEL_CH2N
  *         @arg @ref LL_TIM_CHANNEL_CH3
  *         @arg @ref LL_TIM_CHANNEL_CH3N
  *         @arg @ref LL_TIM_CHANNEL_CH4
  *         @arg @ref LL_TIM_CHANNEL_CH4N
  *         @arg @ref LL_TIM_CHANNEL_CH5
  *         @arg @ref LL_TIM_CHANNEL_CH6
  *         @arg @ref LL_TIM_CHANNEL_CH7
  */
__STATIC_INLINE void LL_TIM_CC_EnableChannel(TIM_TypeDef *timx, uint32_t channels)
{
  STM32_SET_BIT(timx->CCER, channels);
}

/**
  * @brief  Disable capture/compare channels.
  * @rmtoll
  *  CCER         CC1E          LL_TIM_CC_DisableChannel \n
  *  CCER         CC1NE         LL_TIM_CC_DisableChannel \n
  *  CCER         CC2E          LL_TIM_CC_DisableChannel \n
  *  CCER         CC2NE         LL_TIM_CC_DisableChannel \n
  *  CCER         CC3E          LL_TIM_CC_DisableChannel \n
  *  CCER         CC3NE         LL_TIM_CC_DisableChannel \n
  *  CCER         CC4E          LL_TIM_CC_DisableChannel \n
  *  CCER         CC4NE         LL_TIM_CC_DisableChannel \n
  *  CCER         CC5E          LL_TIM_CC_DisableChannel \n
  *  CCER         CC6E          LL_TIM_CC_DisableChannel \n
  *  CCER         CC7E          LL_TIM_CC_DisableChannel
  * @param  timx Timer instance
  * @param  channels This parameter can be a combination of the following values:
  *         @arg @ref LL_TIM_CHANNEL_CH1
  *         @arg @ref LL_TIM_CHANNEL_CH1N
  *         @arg @ref LL_TIM_CHANNEL_CH2
  *         @arg @ref LL_TIM_CHANNEL_CH2N
  *         @arg @ref LL_TIM_CHANNEL_CH3
  *         @arg @ref LL_TIM_CHANNEL_CH3N
  *         @arg @ref LL_TIM_CHANNEL_CH4
  *         @arg @ref LL_TIM_CHANNEL_CH4N
  *         @arg @ref LL_TIM_CHANNEL_CH5
  *         @arg @ref LL_TIM_CHANNEL_CH6
  *         @arg @ref LL_TIM_CHANNEL_CH7
  */
__STATIC_INLINE void LL_TIM_CC_DisableChannel(TIM_TypeDef *timx, uint32_t channels)
{
  STM32_CLEAR_BIT(timx->CCER, channels);
}

/**
  * @brief  Indicate whether channel(s) is(are) enabled.
  * @rmtoll
  *  CCER         CC1E          LL_TIM_CC_IsEnabledChannel \n
  *  CCER         CC1NE         LL_TIM_CC_IsEnabledChannel \n
  *  CCER         CC2E          LL_TIM_CC_IsEnabledChannel \n
  *  CCER         CC2NE         LL_TIM_CC_IsEnabledChannel \n
  *  CCER         CC3E          LL_TIM_CC_IsEnabledChannel \n
  *  CCER         CC3NE         LL_TIM_CC_IsEnabledChannel \n
  *  CCER         CC4E          LL_TIM_CC_IsEnabledChannel \n
  *  CCER         CC4NE         LL_TIM_CC_IsEnabledChannel \n
  *  CCER         CC5E          LL_TIM_CC_IsEnabledChannel \n
  *  CCER         CC6E          LL_TIM_CC_IsEnabledChannel \n
  *  CCER         CC7E          LL_TIM_CC_IsEnabledChannel
  * @param  timx Timer instance
  * @param  channels This parameter can be a combination of the following values:
  *         @arg @ref LL_TIM_CHANNEL_CH1
  *         @arg @ref LL_TIM_CHANNEL_CH1N
  *         @arg @ref LL_TIM_CHANNEL_CH2
  *         @arg @ref LL_TIM_CHANNEL_CH2N
  *         @arg @ref LL_TIM_CHANNEL_CH3
  *         @arg @ref LL_TIM_CHANNEL_CH3N
  *         @arg @ref LL_TIM_CHANNEL_CH4
  *         @arg @ref LL_TIM_CHANNEL_CH4N
  *         @arg @ref LL_TIM_CHANNEL_CH5
  *         @arg @ref LL_TIM_CHANNEL_CH6
  *         @arg @ref LL_TIM_CHANNEL_CH7
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_CC_IsEnabledChannel(const TIM_TypeDef *timx, uint32_t channels)
{
  return ((STM32_READ_BIT(timx->CCER, channels) == (channels)) ? 1UL : 0UL);
}

/**
  * @}
  */

/** @defgroup TIM_LL_EF_Output_Channel Output channel configuration
  * @{
  */
/**
  * @brief  Configure an output channel.
  * @rmtoll
  *  CCMR1        CC1S          LL_TIM_OC_ConfigOutput \n
  *  CCMR1        CC2S          LL_TIM_OC_ConfigOutput \n
  *  CCMR2        CC3S          LL_TIM_OC_ConfigOutput \n
  *  CCMR2        CC4S          LL_TIM_OC_ConfigOutput \n
  *  CCER         CC1P          LL_TIM_OC_ConfigOutput \n
  *  CCER         CC2P          LL_TIM_OC_ConfigOutput \n
  *  CCER         CC3P          LL_TIM_OC_ConfigOutput \n
  *  CCER         CC4P          LL_TIM_OC_ConfigOutput \n
  *  CCER         CC5P          LL_TIM_OC_ConfigOutput \n
  *  CCER         CC6P          LL_TIM_OC_ConfigOutput \n
  *  CCER         CC7P          LL_TIM_OC_ConfigOutput \n
  *  CR2          OIS1          LL_TIM_OC_ConfigOutput \n
  *  CR2          OIS2          LL_TIM_OC_ConfigOutput \n
  *  CR2          OIS3          LL_TIM_OC_ConfigOutput \n
  *  CR2          OIS4          LL_TIM_OC_ConfigOutput \n
  *  CR2          OIS5          LL_TIM_OC_ConfigOutput \n
  *  CR2          OIS6          LL_TIM_OC_ConfigOutput \n
  *  CR2          OIS7          LL_TIM_OC_ConfigOutput
  * @param  timx Timer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_TIM_CHANNEL_CH1
  *         @arg @ref LL_TIM_CHANNEL_CH2
  *         @arg @ref LL_TIM_CHANNEL_CH3
  *         @arg @ref LL_TIM_CHANNEL_CH4
  *         @arg @ref LL_TIM_CHANNEL_CH5
  *         @arg @ref LL_TIM_CHANNEL_CH6
  *         @arg @ref LL_TIM_CHANNEL_CH7
  * @param  configuration This parameter must be a combination of all the following values:
  *         @arg @ref LL_TIM_OCPOLARITY_HIGH or @ref LL_TIM_OCPOLARITY_LOW
  *         @arg @ref LL_TIM_OCIDLESTATE_RESET or @ref LL_TIM_OCIDLESTATE_SET
  */
__STATIC_INLINE void LL_TIM_OC_ConfigOutput(TIM_TypeDef *timx, uint32_t channel, uint32_t configuration)
{
  uint32_t ichannel = LL_TIM_GET_CHANNEL_INDEX(channel);
  __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&timx->CCMR1) + LL_TIM_OFFSET_TAB_CCMRx[ichannel]));
  STM32_CLEAR_BIT(*pReg, (TIM_CCMR1_CC1S << LL_TIM_SHIFT_TAB_OCxx[ichannel]));
  STM32_MODIFY_REG(timx->CCER, (TIM_CCER_CC1P << LL_TIM_SHIFT_TAB_CCxP[ichannel]),
                   (configuration & TIM_CCER_CC1P) << LL_TIM_SHIFT_TAB_CCxP[ichannel]);
  STM32_MODIFY_REG(timx->CR2, (TIM_CR2_OIS1 << LL_TIM_SHIFT_TAB_OISx[ichannel]),
                   (configuration & TIM_CR2_OIS1) << LL_TIM_SHIFT_TAB_OISx[ichannel]);
}

/**
  * @brief  Define the behavior of the output reference signal OCxREF from which
  *         OCx and OCxN (when relevant) are derived.
  * @rmtoll
  *  CCMR1        OC1M          LL_TIM_OC_SetMode \n
  *  CCMR1        OC2M          LL_TIM_OC_SetMode \n
  *  CCMR2        OC3M          LL_TIM_OC_SetMode \n
  *  CCMR2        OC4M          LL_TIM_OC_SetMode \n
  *  CCMR3        OC5M          LL_TIM_OC_SetMode \n
  *  CCMR3        OC6M          LL_TIM_OC_SetMode \n
  *  CCMR4        OC7M          LL_TIM_OC_SetMode
  * @param  timx Timer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_TIM_CHANNEL_CH1
  *         @arg @ref LL_TIM_CHANNEL_CH2
  *         @arg @ref LL_TIM_CHANNEL_CH3
  *         @arg @ref LL_TIM_CHANNEL_CH4
  *         @arg @ref LL_TIM_CHANNEL_CH5
  *         @arg @ref LL_TIM_CHANNEL_CH6
  *         @arg @ref LL_TIM_CHANNEL_CH7
  * @param  mode This parameter can be one of the following values:
  *         @arg @ref LL_TIM_OCMODE_FROZEN
  *         @arg @ref LL_TIM_OCMODE_ACTIVE_ON_MATCH
  *         @arg @ref LL_TIM_OCMODE_INACTIVE_ON_MATCH
  *         @arg @ref LL_TIM_OCMODE_TOGGLE
  *         @arg @ref LL_TIM_OCMODE_FORCED_INACTIVE
  *         @arg @ref LL_TIM_OCMODE_FORCED_ACTIVE
  *         @arg @ref LL_TIM_OCMODE_PWM1
  *         @arg @ref LL_TIM_OCMODE_PWM2
  *         @arg @ref LL_TIM_OCMODE_RETRIGERRABLE_OPM1
  *         @arg @ref LL_TIM_OCMODE_RETRIGERRABLE_OPM2
  *         @arg @ref LL_TIM_OCMODE_COMBINED_PWM1
  *         @arg @ref LL_TIM_OCMODE_COMBINED_PWM2
  *         @arg @ref LL_TIM_OCMODE_COMBINED_PWM3
  *         @arg @ref LL_TIM_OCMODE_COMBINED_PWM4
  *         @arg @ref LL_TIM_OCMODE_ASYMMETRIC_PWM1
  *         @arg @ref LL_TIM_OCMODE_ASYMMETRIC_PWM2
  *         @arg @ref LL_TIM_OCMODE_ASYMMETRIC_PWM3
  *         @arg @ref LL_TIM_OCMODE_ASYMMETRIC_PWM4
  *         @arg @ref LL_TIM_OCMODE_ASYMMETRIC_PWM5
  *         @arg @ref LL_TIM_OCMODE_ASYMMETRIC_PWM6
  *         @arg @ref LL_TIM_OCMODE_ASYMMETRIC_PWM7
  *         @arg @ref LL_TIM_OCMODE_ASYMMETRIC_PWM8
  *         @arg @ref LL_TIM_OCMODE_ASYMMETRIC_PWM9
  *         @arg @ref LL_TIM_OCMODE_ASYMMETRIC_PWM10
  *         @arg @ref LL_TIM_OCMODE_PULSE_ON_COMPARE   (for channel 3 or channel 4 only)
  *         @arg @ref LL_TIM_OCMODE_DIRECTION_OUTPUT   (for channel 3 or channel 4 only)
  */
__STATIC_INLINE void LL_TIM_OC_SetMode(TIM_TypeDef *timx, uint32_t channel, uint32_t mode)
{
  uint32_t ichannel = LL_TIM_GET_CHANNEL_INDEX(channel);
  __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&timx->CCMR1) + LL_TIM_OFFSET_TAB_CCMRx[ichannel]));
  STM32_MODIFY_REG(*pReg, ((TIM_CCMR1_OC1M  | TIM_CCMR1_CC1S) << LL_TIM_SHIFT_TAB_OCxx[ichannel]),
                   mode << LL_TIM_SHIFT_TAB_OCxx[ichannel]);
}

/**
  * @brief  Get the output compare mode of an output channel.
  * @rmtoll
  *  CCMR1        OC1M          LL_TIM_OC_GetMode \n
  *  CCMR1        OC2M          LL_TIM_OC_GetMode \n
  *  CCMR2        OC3M          LL_TIM_OC_GetMode \n
  *  CCMR2        OC4M          LL_TIM_OC_GetMode \n
  *  CCMR3        OC5M          LL_TIM_OC_GetMode \n
  *  CCMR3        OC6M          LL_TIM_OC_GetMode \n
  *  CCMR4        OC7M          LL_TIM_OC_GetMode
  * @param  timx Timer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_TIM_CHANNEL_CH1
  *         @arg @ref LL_TIM_CHANNEL_CH2
  *         @arg @ref LL_TIM_CHANNEL_CH3
  *         @arg @ref LL_TIM_CHANNEL_CH4
  *         @arg @ref LL_TIM_CHANNEL_CH5
  *         @arg @ref LL_TIM_CHANNEL_CH6
  *         @arg @ref LL_TIM_CHANNEL_CH7
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_TIM_OCMODE_FROZEN
  *         @arg @ref LL_TIM_OCMODE_ACTIVE_ON_MATCH
  *         @arg @ref LL_TIM_OCMODE_INACTIVE_ON_MATCH
  *         @arg @ref LL_TIM_OCMODE_TOGGLE
  *         @arg @ref LL_TIM_OCMODE_FORCED_INACTIVE
  *         @arg @ref LL_TIM_OCMODE_FORCED_ACTIVE
  *         @arg @ref LL_TIM_OCMODE_PWM1
  *         @arg @ref LL_TIM_OCMODE_PWM2
  *         @arg @ref LL_TIM_OCMODE_RETRIGERRABLE_OPM1
  *         @arg @ref LL_TIM_OCMODE_RETRIGERRABLE_OPM2
  *         @arg @ref LL_TIM_OCMODE_COMBINED_PWM1
  *         @arg @ref LL_TIM_OCMODE_COMBINED_PWM2
  *         @arg @ref LL_TIM_OCMODE_COMBINED_PWM3
  *         @arg @ref LL_TIM_OCMODE_COMBINED_PWM4
  *         @arg @ref LL_TIM_OCMODE_ASYMMETRIC_PWM1
  *         @arg @ref LL_TIM_OCMODE_ASYMMETRIC_PWM2
  *         @arg @ref LL_TIM_OCMODE_ASYMMETRIC_PWM3
  *         @arg @ref LL_TIM_OCMODE_ASYMMETRIC_PWM4
  *         @arg @ref LL_TIM_OCMODE_ASYMMETRIC_PWM5
  *         @arg @ref LL_TIM_OCMODE_ASYMMETRIC_PWM6
  *         @arg @ref LL_TIM_OCMODE_ASYMMETRIC_PWM7
  *         @arg @ref LL_TIM_OCMODE_ASYMMETRIC_PWM8
  *         @arg @ref LL_TIM_OCMODE_ASYMMETRIC_PWM9
  *         @arg @ref LL_TIM_OCMODE_ASYMMETRIC_PWM10
  *         @arg @ref LL_TIM_OCMODE_PULSE_ON_COMPARE   (for channel 3 or channel 4 only)
  *         @arg @ref LL_TIM_OCMODE_DIRECTION_OUTPUT   (for channel 3 or channel 4 only)
  */
__STATIC_INLINE uint32_t LL_TIM_OC_GetMode(const TIM_TypeDef *timx, uint32_t channel)
{
  uint32_t ichannel = LL_TIM_GET_CHANNEL_INDEX(channel);
  const __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&timx->CCMR1) + \
                                                           LL_TIM_OFFSET_TAB_CCMRx[ichannel]));
  return (STM32_READ_BIT(*pReg, ((TIM_CCMR1_OC1M | TIM_CCMR1_CC1S) << LL_TIM_SHIFT_TAB_OCxx[ichannel])) \
          >> LL_TIM_SHIFT_TAB_OCxx[ichannel]);
}

/**
  * @brief  Set the polarity of an output channel.
  * @rmtoll
  *  CCER         CC1P          LL_TIM_OC_SetPolarity \n
  *  CCER         CC1NP         LL_TIM_OC_SetPolarity \n
  *  CCER         CC2P          LL_TIM_OC_SetPolarity \n
  *  CCER         CC2NP         LL_TIM_OC_SetPolarity \n
  *  CCER         CC3P          LL_TIM_OC_SetPolarity \n
  *  CCER         CC3NP         LL_TIM_OC_SetPolarity \n
  *  CCER         CC4P          LL_TIM_OC_SetPolarity \n
  *  CCER         CC4NP         LL_TIM_OC_SetPolarity \n
  *  CCER         CC5P          LL_TIM_OC_SetPolarity \n
  *  CCER         CC6P          LL_TIM_OC_SetPolarity \n
  *  CCER         CC7P          LL_TIM_OC_SetPolarity
  * @param  timx Timer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_TIM_CHANNEL_CH1
  *         @arg @ref LL_TIM_CHANNEL_CH1N
  *         @arg @ref LL_TIM_CHANNEL_CH2
  *         @arg @ref LL_TIM_CHANNEL_CH2N
  *         @arg @ref LL_TIM_CHANNEL_CH3
  *         @arg @ref LL_TIM_CHANNEL_CH3N
  *         @arg @ref LL_TIM_CHANNEL_CH4
  *         @arg @ref LL_TIM_CHANNEL_CH4N
  *         @arg @ref LL_TIM_CHANNEL_CH5
  *         @arg @ref LL_TIM_CHANNEL_CH6
  *         @arg @ref LL_TIM_CHANNEL_CH7
  * @param  polarity This parameter can be one of the following values:
  *         @arg @ref LL_TIM_OCPOLARITY_HIGH
  *         @arg @ref LL_TIM_OCPOLARITY_LOW
  */
__STATIC_INLINE void LL_TIM_OC_SetPolarity(TIM_TypeDef *timx, uint32_t channel, uint32_t polarity)
{
  uint32_t ichannel = LL_TIM_GET_CHANNEL_INDEX(channel);
  STM32_MODIFY_REG(timx->CCER, (TIM_CCER_CC1P << LL_TIM_SHIFT_TAB_CCxP[ichannel]),
                   polarity << LL_TIM_SHIFT_TAB_CCxP[ichannel]);
}

/**
  * @brief  Get the polarity of an output channel.
  * @rmtoll
  *  CCER         CC1P          LL_TIM_OC_GetPolarity \n
  *  CCER         CC1NP         LL_TIM_OC_GetPolarity \n
  *  CCER         CC2P          LL_TIM_OC_GetPolarity \n
  *  CCER         CC2NP         LL_TIM_OC_GetPolarity \n
  *  CCER         CC3P          LL_TIM_OC_GetPolarity \n
  *  CCER         CC3NP         LL_TIM_OC_GetPolarity \n
  *  CCER         CC4P          LL_TIM_OC_GetPolarity \n
  *  CCER         CC4NP         LL_TIM_OC_GetPolarity \n
  *  CCER         CC5P          LL_TIM_OC_GetPolarity \n
  *  CCER         CC6P          LL_TIM_OC_GetPolarity \n
  *  CCER         CC7P          LL_TIM_OC_GetPolarity
  * @param  timx Timer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_TIM_CHANNEL_CH1
  *         @arg @ref LL_TIM_CHANNEL_CH1N
  *         @arg @ref LL_TIM_CHANNEL_CH2
  *         @arg @ref LL_TIM_CHANNEL_CH2N
  *         @arg @ref LL_TIM_CHANNEL_CH3
  *         @arg @ref LL_TIM_CHANNEL_CH3N
  *         @arg @ref LL_TIM_CHANNEL_CH4
  *         @arg @ref LL_TIM_CHANNEL_CH4N
  *         @arg @ref LL_TIM_CHANNEL_CH5
  *         @arg @ref LL_TIM_CHANNEL_CH6
  *         @arg @ref LL_TIM_CHANNEL_CH7
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_TIM_OCPOLARITY_HIGH
  *         @arg @ref LL_TIM_OCPOLARITY_LOW
  */
__STATIC_INLINE uint32_t LL_TIM_OC_GetPolarity(const TIM_TypeDef *timx, uint32_t channel)
{
  uint32_t ichannel = LL_TIM_GET_CHANNEL_INDEX(channel);
  return (STM32_READ_BIT(timx->CCER, (TIM_CCER_CC1P << LL_TIM_SHIFT_TAB_CCxP[ichannel])) \
          >> LL_TIM_SHIFT_TAB_CCxP[ichannel]);
}

/**
  * @brief  Set the idle state of an output channel.
  * @rmtoll
  *  CR2         OIS1          LL_TIM_OC_SetIdleState \n
  *  CR2         OIS2N         LL_TIM_OC_SetIdleState \n
  *  CR2         OIS2          LL_TIM_OC_SetIdleState \n
  *  CR2         OIS2N         LL_TIM_OC_SetIdleState \n
  *  CR2         OIS3          LL_TIM_OC_SetIdleState \n
  *  CR2         OIS3N         LL_TIM_OC_SetIdleState \n
  *  CR2         OIS4          LL_TIM_OC_SetIdleState \n
  *  CR2         OIS4N         LL_TIM_OC_SetIdleState \n
  *  CR2         OIS5          LL_TIM_OC_SetIdleState \n
  *  CR2         OIS6          LL_TIM_OC_SetIdleState \n
  *  CR2         OIS7          LL_TIM_OC_SetIdleState
  * @param  timx Timer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_TIM_CHANNEL_CH1
  *         @arg @ref LL_TIM_CHANNEL_CH1N
  *         @arg @ref LL_TIM_CHANNEL_CH2
  *         @arg @ref LL_TIM_CHANNEL_CH2N
  *         @arg @ref LL_TIM_CHANNEL_CH3
  *         @arg @ref LL_TIM_CHANNEL_CH3N
  *         @arg @ref LL_TIM_CHANNEL_CH4
  *         @arg @ref LL_TIM_CHANNEL_CH4N
  *         @arg @ref LL_TIM_CHANNEL_CH5
  *         @arg @ref LL_TIM_CHANNEL_CH6
  *         @arg @ref LL_TIM_CHANNEL_CH7
  * @param  idle_state This parameter can be one of the following values:
  *         @arg @ref LL_TIM_OCIDLESTATE_RESET
  *         @arg @ref LL_TIM_OCIDLESTATE_SET
  * @note This function is significant only for the timer instances
  *       supporting the break feature. Macro IS_TIM_BREAK_INSTANCE(timx)
  *       can be used to check whether or not a timer instance provides
  *       a break input.
  */
__STATIC_INLINE void LL_TIM_OC_SetIdleState(TIM_TypeDef *timx, uint32_t channel, uint32_t idle_state)
{
  uint32_t ichannel = LL_TIM_GET_CHANNEL_INDEX(channel);
  STM32_MODIFY_REG(timx->CR2, (TIM_CR2_OIS1 << LL_TIM_SHIFT_TAB_OISx[ichannel]), \
                   idle_state << LL_TIM_SHIFT_TAB_OISx[ichannel]);
}

