MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_tim.h
/**
  * @brief  Get the idle state of an output channel.
  * @rmtoll
  *  CR2         OIS1          LL_TIM_OC_GetIdleState \n
  *  CR2         OIS2N         LL_TIM_OC_GetIdleState \n
  *  CR2         OIS2          LL_TIM_OC_GetIdleState \n
  *  CR2         OIS2N         LL_TIM_OC_GetIdleState \n
  *  CR2         OIS3          LL_TIM_OC_GetIdleState \n
  *  CR2         OIS3N         LL_TIM_OC_GetIdleState \n
  *  CR2         OIS4          LL_TIM_OC_GetIdleState \n
  *  CR2         OIS4N         LL_TIM_OC_GetIdleState \n
  *  CR2         OIS5          LL_TIM_OC_GetIdleState \n
  *  CR2         OIS6          LL_TIM_OC_GetIdleState \n
  *  CR2         OIS7          LL_TIM_OC_GetIdleState
  * @param  timx Timer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_TIM_CHANNEL_CH1
  *         @arg @ref LL_TIM_CHANNEL_CH1N
  *         @arg @ref LL_TIM_CHANNEL_CH2
  *         @arg @ref LL_TIM_CHANNEL_CH2N
  *         @arg @ref LL_TIM_CHANNEL_CH3
  *         @arg @ref LL_TIM_CHANNEL_CH3N
  *         @arg @ref LL_TIM_CHANNEL_CH4
  *         @arg @ref LL_TIM_CHANNEL_CH4N
  *         @arg @ref LL_TIM_CHANNEL_CH5
  *         @arg @ref LL_TIM_CHANNEL_CH6
  *         @arg @ref LL_TIM_CHANNEL_CH7
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_TIM_OCIDLESTATE_RESET
  *         @arg @ref LL_TIM_OCIDLESTATE_SET
  */
__STATIC_INLINE uint32_t LL_TIM_OC_GetIdleState(const TIM_TypeDef *timx, uint32_t channel)
{
  uint32_t ichannel = LL_TIM_GET_CHANNEL_INDEX(channel);
  return (STM32_READ_BIT(timx->CR2, (TIM_CR2_OIS1 << LL_TIM_SHIFT_TAB_OISx[ichannel])) \
          >> LL_TIM_SHIFT_TAB_OISx[ichannel]);
}

/**
  * @brief  Set the override state of a disabled output channel.
  * @rmtoll
  *  OOR         OOS1          LL_TIM_OC_SetOverrideState \n
  *  OOR         OOS1N         LL_TIM_OC_SetOverrideState \n
  *  OOR         OOS2          LL_TIM_OC_SetOverrideState \n
  *  OOR         OOS2N         LL_TIM_OC_SetOverrideState \n
  *  OOR         OOS3          LL_TIM_OC_SetOverrideState \n
  *  OOR         OOS3N         LL_TIM_OC_SetOverrideState \n
  *  OOR         OOS4          LL_TIM_OC_SetOverrideState \n
  *  OOR         OOS4N         LL_TIM_OC_SetOverrideState
  * @param  timx Timer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_TIM_CHANNEL_CH1
  *         @arg @ref LL_TIM_CHANNEL_CH1N
  *         @arg @ref LL_TIM_CHANNEL_CH2
  *         @arg @ref LL_TIM_CHANNEL_CH2N
  *         @arg @ref LL_TIM_CHANNEL_CH3
  *         @arg @ref LL_TIM_CHANNEL_CH3N
  *         @arg @ref LL_TIM_CHANNEL_CH4
  *         @arg @ref LL_TIM_CHANNEL_CH4N
  * @param  override_state This parameter can be one of the following values:
  *         @arg @ref LL_TIM_OCOVERRIDE_RESET
  *         @arg @ref LL_TIM_OCOVERRIDE_SET
  * @note Only applicable to external channels and their complementary (1, 2, 3 and 4).
  * @note This bit-field can not be modified as long as LOCK level 1, 2 or 3 has been programmed
  *       (LOCK bits in TIMx_BDTR register).
  */
__STATIC_INLINE void LL_TIM_OC_SetOverrideState(TIM_TypeDef *timx, uint32_t channel, uint32_t override_state)
{
  uint32_t ichannel = LL_TIM_GET_CHANNEL_INDEX(channel);
  STM32_MODIFY_REG(timx->OOR, (TIM_OOR_OOS1 << ichannel), (override_state << ichannel));
}

/**
  * @brief  Get the override state of a disabled output channel.
  * @rmtoll
  *  OOR         OOS1          LL_TIM_OC_GetOverrideState \n
  *  OOR         OOS1N         LL_TIM_OC_GetOverrideState \n
  *  OOR         OOS2          LL_TIM_OC_GetOverrideState \n
  *  OOR         OOS2N         LL_TIM_OC_GetOverrideState \n
  *  OOR         OOS3          LL_TIM_OC_GetOverrideState \n
  *  OOR         OOS3N         LL_TIM_OC_GetOverrideState \n
  *  OOR         OOS4          LL_TIM_OC_GetOverrideState \n
  *  OOR         OOS4N         LL_TIM_OC_GetOverrideState
  * @param  timx Timer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_TIM_CHANNEL_CH1
  *         @arg @ref LL_TIM_CHANNEL_CH1N
  *         @arg @ref LL_TIM_CHANNEL_CH2
  *         @arg @ref LL_TIM_CHANNEL_CH2N
  *         @arg @ref LL_TIM_CHANNEL_CH3
  *         @arg @ref LL_TIM_CHANNEL_CH3N
  *         @arg @ref LL_TIM_CHANNEL_CH4
  *         @arg @ref LL_TIM_CHANNEL_CH4N
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_TIM_OCOVERRIDE_RESET
  *         @arg @ref LL_TIM_OCOVERRIDE_SET
  */
__STATIC_INLINE uint32_t LL_TIM_OC_GetOverrideState(const TIM_TypeDef *timx, uint32_t channel)
{
  uint32_t ichannel = LL_TIM_GET_CHANNEL_INDEX(channel);
  return (STM32_READ_BIT(timx->OOR, (TIM_OOR_OOS1 << ichannel)) >> ichannel);
}

/**
  * @brief  Enable output override (outputs are forced in an idle state defined with OOSx/OOSxN bits).
  * @rmtoll
  *  OOR          OCC           LL_TIM_OC_EnableOutputOverride
  * @param  timx Timer instance
  * @note This function can only be used when the outputs are in idle state (MOE = 0).
  */
__STATIC_INLINE void LL_TIM_OC_EnableOutputOverride(TIM_TypeDef *timx)
{
  STM32_SET_BIT(timx->OOR, TIM_OOR_OOC);
}

/**
  * @brief  Disable output override (outputs are in the default idle state).
  * @rmtoll
  *  OOR          OCC           LL_TIM_OC_DisableOutputOverride
  * @param  timx Timer instance
  * @note This function can only be used when the outputs are in idle state (MOE = 0).
  */
__STATIC_INLINE void LL_TIM_OC_DisableOutputOverride(TIM_TypeDef *timx)
{
  STM32_CLEAR_BIT(timx->OOR, TIM_OOR_OOC);
}

/**
  * @brief  Indicate whether output override is enabled.
  * @rmtoll
  *  OOR          OCC           LL_TIM_OC_IsEnabledOutputOverride
  * @param  timx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_OC_IsEnabledOutputOverride(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->OOR, TIM_OOR_OOC) == (TIM_OOR_OOC)) ? 1UL : 0UL);
}

/**
  * @brief  Enable fast mode for the output channel.
  * @rmtoll
  *  CCMR1        OC1FE          LL_TIM_OC_EnableFast \n
  *  CCMR1        OC2FE          LL_TIM_OC_EnableFast \n
  *  CCMR2        OC3FE          LL_TIM_OC_EnableFast \n
  *  CCMR2        OC4FE          LL_TIM_OC_EnableFast \n
  *  CCMR3        OC5FE          LL_TIM_OC_EnableFast \n
  *  CCMR3        OC6FE          LL_TIM_OC_EnableFast \n
  *  CCMR4        OC7FE          LL_TIM_OC_EnableFast
  * @param  timx Timer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_TIM_CHANNEL_CH1
  *         @arg @ref LL_TIM_CHANNEL_CH2
  *         @arg @ref LL_TIM_CHANNEL_CH3
  *         @arg @ref LL_TIM_CHANNEL_CH4
  *         @arg @ref LL_TIM_CHANNEL_CH5
  *         @arg @ref LL_TIM_CHANNEL_CH6
  *         @arg @ref LL_TIM_CHANNEL_CH7
  * @note Acts only if the channel is configured in PWM1 or PWM2 mode.
  */
__STATIC_INLINE void LL_TIM_OC_EnableFast(TIM_TypeDef *timx, uint32_t channel)
{
  uint32_t ichannel = LL_TIM_GET_CHANNEL_INDEX(channel);
  __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&timx->CCMR1) + LL_TIM_OFFSET_TAB_CCMRx[ichannel]));
  STM32_SET_BIT(*pReg, (TIM_CCMR1_OC1FE << LL_TIM_SHIFT_TAB_OCxx[ichannel]));

