MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_tim.h
}

/**
  * @brief  Disable fast mode for the output channel.
  * @rmtoll
  *  CCMR1        OC1FE          LL_TIM_OC_DisableFast \n
  *  CCMR1        OC2FE          LL_TIM_OC_DisableFast \n
  *  CCMR2        OC3FE          LL_TIM_OC_DisableFast \n
  *  CCMR2        OC4FE          LL_TIM_OC_DisableFast \n
  *  CCMR3        OC5FE          LL_TIM_OC_DisableFast \n
  *  CCMR3        OC6FE          LL_TIM_OC_DisableFast \n
  *  CCMR4        OC7FE          LL_TIM_OC_DisableFast
  * @param  timx Timer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_TIM_CHANNEL_CH1
  *         @arg @ref LL_TIM_CHANNEL_CH2
  *         @arg @ref LL_TIM_CHANNEL_CH3
  *         @arg @ref LL_TIM_CHANNEL_CH4
  *         @arg @ref LL_TIM_CHANNEL_CH5
  *         @arg @ref LL_TIM_CHANNEL_CH6
  *         @arg @ref LL_TIM_CHANNEL_CH7
  */
__STATIC_INLINE void LL_TIM_OC_DisableFast(TIM_TypeDef *timx, uint32_t channel)
{
  uint32_t ichannel = LL_TIM_GET_CHANNEL_INDEX(channel);
  __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&timx->CCMR1) + LL_TIM_OFFSET_TAB_CCMRx[ichannel]));
  STM32_CLEAR_BIT(*pReg, (TIM_CCMR1_OC1FE << LL_TIM_SHIFT_TAB_OCxx[ichannel]));

}

/**
  * @brief  Indicates whether fast mode is enabled for the output channel.
  * @rmtoll
  *  CCMR1        OC1FE          LL_TIM_OC_IsEnabledFast \n
  *  CCMR1        OC2FE          LL_TIM_OC_IsEnabledFast \n
  *  CCMR2        OC3FE          LL_TIM_OC_IsEnabledFast \n
  *  CCMR2        OC4FE          LL_TIM_OC_IsEnabledFast \n
  *  CCMR3        OC5FE          LL_TIM_OC_IsEnabledFast \n
  *  CCMR3        OC6FE          LL_TIM_OC_IsEnabledFast \n
  *  CCMR4        OC7FE          LL_TIM_OC_IsEnabledFast
  * @param  timx Timer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_TIM_CHANNEL_CH1
  *         @arg @ref LL_TIM_CHANNEL_CH2
  *         @arg @ref LL_TIM_CHANNEL_CH3
  *         @arg @ref LL_TIM_CHANNEL_CH4
  *         @arg @ref LL_TIM_CHANNEL_CH5
  *         @arg @ref LL_TIM_CHANNEL_CH6
  *         @arg @ref LL_TIM_CHANNEL_CH7
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_OC_IsEnabledFast(const TIM_TypeDef *timx, uint32_t channel)
{
  uint32_t ichannel = LL_TIM_GET_CHANNEL_INDEX(channel);
  const __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&timx->CCMR1) + \
                                                           LL_TIM_OFFSET_TAB_CCMRx[ichannel]));
  uint32_t bitfield = TIM_CCMR1_OC1FE << LL_TIM_SHIFT_TAB_OCxx[ichannel];
  return ((STM32_READ_BIT(*pReg, bitfield) == bitfield) ? 1UL : 0UL);
}

/**
  * @brief  Enable compare register (TIMx_CCRx) preload for the output channel.
  * @rmtoll
  *  CCMR1        OC1PE          LL_TIM_OC_EnablePreload \n
  *  CCMR1        OC2PE          LL_TIM_OC_EnablePreload \n
  *  CCMR2        OC3PE          LL_TIM_OC_EnablePreload \n
  *  CCMR2        OC4PE          LL_TIM_OC_EnablePreload \n
  *  CCMR3        OC5PE          LL_TIM_OC_EnablePreload \n
  *  CCMR3        OC6PE          LL_TIM_OC_EnablePreload \n
  *  CCMR4        OC7PE          LL_TIM_OC_EnablePreload
  * @param  timx Timer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_TIM_CHANNEL_CH1
  *         @arg @ref LL_TIM_CHANNEL_CH2
  *         @arg @ref LL_TIM_CHANNEL_CH3
  *         @arg @ref LL_TIM_CHANNEL_CH4
  *         @arg @ref LL_TIM_CHANNEL_CH5
  *         @arg @ref LL_TIM_CHANNEL_CH6
  *         @arg @ref LL_TIM_CHANNEL_CH7
  */
__STATIC_INLINE void LL_TIM_OC_EnablePreload(TIM_TypeDef *timx, uint32_t channel)
{
  uint32_t ichannel = LL_TIM_GET_CHANNEL_INDEX(channel);
  __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&timx->CCMR1) + LL_TIM_OFFSET_TAB_CCMRx[ichannel]));
  STM32_SET_BIT(*pReg, (TIM_CCMR1_OC1PE << LL_TIM_SHIFT_TAB_OCxx[ichannel]));
}

/**
  * @brief  Disable compare register (TIMx_CCRx) preload for the output channel.
  * @rmtoll
  *  CCMR1        OC1PE          LL_TIM_OC_DisablePreload \n
  *  CCMR1        OC2PE          LL_TIM_OC_DisablePreload \n
  *  CCMR2        OC3PE          LL_TIM_OC_DisablePreload \n
  *  CCMR2        OC4PE          LL_TIM_OC_DisablePreload \n
  *  CCMR3        OC5PE          LL_TIM_OC_DisablePreload \n
  *  CCMR3        OC6PE          LL_TIM_OC_DisablePreload \n
  *  CCMR4        OC7PE          LL_TIM_OC_DisablePreload
  * @param  timx Timer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_TIM_CHANNEL_CH1
  *         @arg @ref LL_TIM_CHANNEL_CH2
  *         @arg @ref LL_TIM_CHANNEL_CH3
  *         @arg @ref LL_TIM_CHANNEL_CH4
  *         @arg @ref LL_TIM_CHANNEL_CH5
  *         @arg @ref LL_TIM_CHANNEL_CH6
  *         @arg @ref LL_TIM_CHANNEL_CH7
  */
__STATIC_INLINE void LL_TIM_OC_DisablePreload(TIM_TypeDef *timx, uint32_t channel)
{
  uint32_t ichannel = LL_TIM_GET_CHANNEL_INDEX(channel);
  __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&timx->CCMR1) + LL_TIM_OFFSET_TAB_CCMRx[ichannel]));
  STM32_CLEAR_BIT(*pReg, (TIM_CCMR1_OC1PE << LL_TIM_SHIFT_TAB_OCxx[ichannel]));
}

/**
  * @brief  Indicates whether compare register (TIMx_CCRx) preload is enabled for the output channel.
  * @rmtoll
  *  CCMR1        OC1PE          LL_TIM_OC_IsEnabledPreload \n
  *  CCMR1        OC2PE          LL_TIM_OC_IsEnabledPreload \n
  *  CCMR2        OC3PE          LL_TIM_OC_IsEnabledPreload \n
  *  CCMR2        OC4PE          LL_TIM_OC_IsEnabledPreload \n
  *  CCMR3        OC5PE          LL_TIM_OC_IsEnabledPreload \n
  *  CCMR3        OC6PE          LL_TIM_OC_IsEnabledPreload \n
  *  CCMR4        OC7PE          LL_TIM_OC_IsEnabledPreload
  * @param  timx Timer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_TIM_CHANNEL_CH1
  *         @arg @ref LL_TIM_CHANNEL_CH2
  *         @arg @ref LL_TIM_CHANNEL_CH3
  *         @arg @ref LL_TIM_CHANNEL_CH4
  *         @arg @ref LL_TIM_CHANNEL_CH5
  *         @arg @ref LL_TIM_CHANNEL_CH6
  *         @arg @ref LL_TIM_CHANNEL_CH7
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_OC_IsEnabledPreload(const TIM_TypeDef *timx, uint32_t channel)
{
  uint32_t ichannel = LL_TIM_GET_CHANNEL_INDEX(channel);
  const __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&timx->CCMR1) + \
                                                           LL_TIM_OFFSET_TAB_CCMRx[ichannel]));
  uint32_t bitfield = TIM_CCMR1_OC1PE << LL_TIM_SHIFT_TAB_OCxx[ichannel];
  return ((STM32_READ_BIT(*pReg, bitfield) == bitfield) ? 1UL : 0UL);
}

/**
  * @brief  Enable clearing the output channel on an external event.
  * @rmtoll
  *  CCMR1        OC1CE          LL_TIM_OC_EnableClear \n
  *  CCMR1        OC2CE          LL_TIM_OC_EnableClear \n
  *  CCMR2        OC3CE          LL_TIM_OC_EnableClear \n
  *  CCMR2        OC4CE          LL_TIM_OC_EnableClear \n
  *  CCMR3        OC5CE          LL_TIM_OC_EnableClear \n
  *  CCMR3        OC6CE          LL_TIM_OC_EnableClear \n
  *  CCMR4        OC7CE          LL_TIM_OC_EnableClear
  * @param  timx Timer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_TIM_CHANNEL_CH1
  *         @arg @ref LL_TIM_CHANNEL_CH2
  *         @arg @ref LL_TIM_CHANNEL_CH3
  *         @arg @ref LL_TIM_CHANNEL_CH4
  *         @arg @ref LL_TIM_CHANNEL_CH5
  *         @arg @ref LL_TIM_CHANNEL_CH6
  *         @arg @ref LL_TIM_CHANNEL_CH7
  * @note This function can only be used in Output compare and PWM modes. It does not work in Forced mode.
  * @note Macro IS_TIM_OCXREF_CLEAR_INSTANCE(timx) can be used to check whether
  *       or not a timer instance can clear the OCxREF signal on an external event.
  */
__STATIC_INLINE void LL_TIM_OC_EnableClear(TIM_TypeDef *timx, uint32_t channel)
{
  uint32_t ichannel = LL_TIM_GET_CHANNEL_INDEX(channel);
  __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&timx->CCMR1) + LL_TIM_OFFSET_TAB_CCMRx[ichannel]));
  STM32_SET_BIT(*pReg, (TIM_CCMR1_OC1CE << LL_TIM_SHIFT_TAB_OCxx[ichannel]));
}

/**
  * @brief  Disable clearing the output channel on an external event.
  * @rmtoll
  *  CCMR1        OC1CE          LL_TIM_OC_DisableClear \n
  *  CCMR1        OC2CE          LL_TIM_OC_DisableClear \n
  *  CCMR2        OC3CE          LL_TIM_OC_DisableClear \n
  *  CCMR2        OC4CE          LL_TIM_OC_DisableClear \n
  *  CCMR3        OC5CE          LL_TIM_OC_DisableClear \n
  *  CCMR3        OC6CE          LL_TIM_OC_DisableClear \n
  *  CCMR4        OC7CE          LL_TIM_OC_DisableClear
  * @param  timx Timer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_TIM_CHANNEL_CH1
  *         @arg @ref LL_TIM_CHANNEL_CH2
  *         @arg @ref LL_TIM_CHANNEL_CH3
  *         @arg @ref LL_TIM_CHANNEL_CH4
  *         @arg @ref LL_TIM_CHANNEL_CH5
  *         @arg @ref LL_TIM_CHANNEL_CH6
  *         @arg @ref LL_TIM_CHANNEL_CH7
  * @note Macro IS_TIM_OCXREF_CLEAR_INSTANCE(timx) can be used to check whether
  *       or not a timer instance can clear the OCxREF signal on an external event.
  */
__STATIC_INLINE void LL_TIM_OC_DisableClear(TIM_TypeDef *timx, uint32_t channel)
{
  uint32_t ichannel = LL_TIM_GET_CHANNEL_INDEX(channel);
  __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&timx->CCMR1) + LL_TIM_OFFSET_TAB_CCMRx[ichannel]));
  STM32_CLEAR_BIT(*pReg, (TIM_CCMR1_OC1CE << LL_TIM_SHIFT_TAB_OCxx[ichannel]));
}

/**
  * @brief  Indicates clearing the output channel on an external event is enabled for the output channel.
  * @rmtoll
  *  CCMR1        OC1CE          LL_TIM_OC_IsEnabledClear \n
  *  CCMR1        OC2CE          LL_TIM_OC_IsEnabledClear \n
  *  CCMR2        OC3CE          LL_TIM_OC_IsEnabledClear \n
  *  CCMR2        OC4CE          LL_TIM_OC_IsEnabledClear \n
  *  CCMR3        OC5CE          LL_TIM_OC_IsEnabledClear \n
  *  CCMR3        OC6CE          LL_TIM_OC_IsEnabledClear \n
  *  CCMR4        OC7CE          LL_TIM_OC_IsEnabledClear
  * @param  timx Timer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_TIM_CHANNEL_CH1
  *         @arg @ref LL_TIM_CHANNEL_CH2
  *         @arg @ref LL_TIM_CHANNEL_CH3
  *         @arg @ref LL_TIM_CHANNEL_CH4
  *         @arg @ref LL_TIM_CHANNEL_CH5
  *         @arg @ref LL_TIM_CHANNEL_CH6
  *         @arg @ref LL_TIM_CHANNEL_CH7
  * @note This function enables clearing the output channel on an external event.
  * @note This function can only be used in Output compare and PWM modes. It does not work in Forced mode.
  * @note Macro IS_TIM_OCXREF_CLEAR_INSTANCE(timx) can be used to check whether
  *       or not a timer instance can clear the OCxREF signal on an external event.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_OC_IsEnabledClear(const TIM_TypeDef *timx, uint32_t channel)
{
  uint32_t ichannel = LL_TIM_GET_CHANNEL_INDEX(channel);
  const __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&timx->CCMR1) + \
                                                           LL_TIM_OFFSET_TAB_CCMRx[ichannel]));
  uint32_t bitfield = TIM_CCMR1_OC1CE << LL_TIM_SHIFT_TAB_OCxx[ichannel];
  return ((STM32_READ_BIT(*pReg, bitfield) == bitfield) ? 1UL : 0UL);
}

/**
  * @brief  Set the break channel output mode BKxM.
  * @rmtoll
  *  MPR1          BKM1          LL_TIM_OC_SetBreakMode \n
  *  MPR1          BKM1N         LL_TIM_OC_SetBreakMode \n
  *  MPR1          BKM2          LL_TIM_OC_SetBreakMode \n
  *  MPR1          BKM2N         LL_TIM_OC_SetBreakMode \n
  *  MPR1          BKM3          LL_TIM_OC_SetBreakMode \n
  *  MPR1          BKM3N         LL_TIM_OC_SetBreakMode \n
  *  MPR1          BKM4          LL_TIM_OC_SetBreakMode \n
  *  MPR1          BKM4N         LL_TIM_OC_SetBreakMode
  * @param  timx Timer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_TIM_CHANNEL_CH1
  *         @arg @ref LL_TIM_CHANNEL_CH1N
  *         @arg @ref LL_TIM_CHANNEL_CH2
  *         @arg @ref LL_TIM_CHANNEL_CH2N
  *         @arg @ref LL_TIM_CHANNEL_CH3
  *         @arg @ref LL_TIM_CHANNEL_CH3N
  *         @arg @ref LL_TIM_CHANNEL_CH4
  *         @arg @ref LL_TIM_CHANNEL_CH4N
  * @param  break_mode This parameter can be one of the following values:
  *         @arg @ref LL_TIM_OCBREAKMODE_IMMEDIATE
  *         @arg @ref LL_TIM_OCBREAKMODE_DELAY1
  *         @arg @ref LL_TIM_OCBREAKMODE_DELAY2
  * @note This bit must be modified only when the counter is disabled.
  * @note The break2 feature must be disabled when the delayed mode is enabled.
  */
__STATIC_INLINE void LL_TIM_OC_SetBreakMode(TIM_TypeDef *timx, uint32_t channel, uint32_t break_mode)
{
  uint32_t ichannel_shift = (uint32_t)(LL_TIM_GET_CHANNEL_INDEX(channel)) << 1U;
  STM32_MODIFY_REG(timx->MPR1, (TIM_MPR1_BK1M << ichannel_shift), break_mode << ichannel_shift);
}

/**
  * @brief  Get the break channel output mode BKxM.
  * @rmtoll
  *  MPR1          BKM1          LL_TIM_OC_GetBreakMode \n
  *  MPR1          BKM1N         LL_TIM_OC_GetBreakMode \n
  *  MPR1          BKM2          LL_TIM_OC_GetBreakMode \n
  *  MPR1          BKM2N         LL_TIM_OC_GetBreakMode \n
  *  MPR1          BKM3          LL_TIM_OC_GetBreakMode \n
  *  MPR1          BKM3N         LL_TIM_OC_GetBreakMode \n
  *  MPR1          BKM4          LL_TIM_OC_GetBreakMode \n
  *  MPR1          BKM4N         LL_TIM_OC_GetBreakMode
  * @param  timx Timer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_TIM_CHANNEL_CH1
  *         @arg @ref LL_TIM_CHANNEL_CH1N
  *         @arg @ref LL_TIM_CHANNEL_CH2
  *         @arg @ref LL_TIM_CHANNEL_CH2N
  *         @arg @ref LL_TIM_CHANNEL_CH3
  *         @arg @ref LL_TIM_CHANNEL_CH3N
  *         @arg @ref LL_TIM_CHANNEL_CH4
  *         @arg @ref LL_TIM_CHANNEL_CH4N
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_TIM_OCBREAKMODE_IMMEDIATE
  *         @arg @ref LL_TIM_OCBREAKMODE_DELAY1
  *         @arg @ref LL_TIM_OCBREAKMODE_DELAY2
  */
__STATIC_INLINE uint32_t LL_TIM_OC_GetBreakMode(const TIM_TypeDef *timx, uint32_t channel)
{
  uint32_t ichannel_shift = (uint32_t)(LL_TIM_GET_CHANNEL_INDEX(channel)) << 1U;
  return (uint32_t)((STM32_READ_BIT(timx->MPR1, (TIM_MPR1_BK1M << ichannel_shift))) >> ichannel_shift);
}

/**
  * @brief  Set the dead-time delay (delay inserted between the rising edge of the OCxREF signal and the rising edge of
  *         the Ocx and OCxN signals).
  * @rmtoll
  *  BDTR         DTG           LL_TIM_OC_SetDeadTime
  * @param  timx Timer instance
  * @param  deadtime between Min_Data=0 and Max_Data=255
  * @note Macro IS_TIM_BREAK_INSTANCE(timx) can be used to check whether or not
  *       dead-time insertion feature is supported by a timer instance.
  * @note Helper macro @ref LL_TIM_CALC_DEADTIME can be used to calculate the deadtime parameter
  */
__STATIC_INLINE void LL_TIM_OC_SetDeadTime(TIM_TypeDef *timx, uint32_t deadtime)
{
  STM32_MODIFY_REG(timx->BDTR, TIM_BDTR_DTG, deadtime);
}

/**
  * @brief  Get the dead-time delay (delay inserted between the rising edge of the
  *         OCxREF signal and the rising edge of the Ocx and OCxN signals).
  * @rmtoll
  *  BDTR         DTG           LL_TIM_OC_GetDeadTime
  * @param  timx Timer instance
  * @note Macro IS_TIM_BREAK_INSTANCE(timx) can be used to check whether or not
  *       dead-time insertion feature is supported by a timer instance.
  * @note Helper macro @ref LL_TIM_CALC_DEADTIME can be used to calculate the deadtime parameter
  * @retval deadtime between Min_Data=0 and Max_Data=255
  */
__STATIC_INLINE uint32_t LL_TIM_OC_GetDeadTime(const TIM_TypeDef *timx)
{
  return (STM32_READ_REG(timx->BDTR) & TIM_BDTR_DTG);
}

/**
  * @brief  Set compare value for output channel 1 (TIMx_CCR1).
  * @rmtoll
  *  CCR1         CCR1          LL_TIM_OC_SetCompareCH1
  * @param  timx Timer instance
  * @param  compare_value between Min_Data=0 and Max_Data=65535
  * @note In 32-bit timer implementations compare value can be between 0x00000000 and 0xFFFFFFFF.
  * @note Macro IS_TIM_32B_COUNTER_INSTANCE(timx) can be used to check
  *       whether or not a timer instance supports a 32-bit counter.
  * @note Macro IS_TIM_CC1_INSTANCE(timx) can be used to check whether or not
  *       output channel 1 is supported by a timer instance.
  * @note If dithering is activated, compare_value can be calculated with macro @ref LL_TIM_CALC_DELAY_DITHER .
  */
__STATIC_INLINE void LL_TIM_OC_SetCompareCH1(TIM_TypeDef *timx, uint32_t compare_value)
{
  STM32_WRITE_REG(timx->CCR1, compare_value);
}

/**
  * @brief  Set compare value for output channel 2 (TIMx_CCR2).
  * @rmtoll
  *  CCR2         CCR2          LL_TIM_OC_SetCompareCH2
  * @param  timx Timer instance
  * @param  compare_value between Min_Data=0 and Max_Data=65535
  * @note In 32-bit timer implementations compare value can be between 0x00000000 and 0xFFFFFFFF.
  * @note Macro IS_TIM_32B_COUNTER_INSTANCE(timx) can be used to check
  *       whether or not a timer instance supports a 32-bit counter.
  * @note Macro IS_TIM_CC2_INSTANCE(timx) can be used to check whether or not
  *       output channel 2 is supported by a timer instance.
  * @note If dithering is activated, compare_value can be calculated with macro @ref LL_TIM_CALC_DELAY_DITHER .
  */
__STATIC_INLINE void LL_TIM_OC_SetCompareCH2(TIM_TypeDef *timx, uint32_t compare_value)
{
  STM32_WRITE_REG(timx->CCR2, compare_value);
}

/**
  * @brief  Set compare value for output channel 3 (TIMx_CCR3).
  * @rmtoll
  *  CCR3         CCR3          LL_TIM_OC_SetCompareCH3
  * @param  timx Timer instance
  * @param  compare_value between Min_Data=0 and Max_Data=65535
  * @note In 32-bit timer implementations compare value can be between 0x00000000 and 0xFFFFFFFF.
  * @note Macro IS_TIM_32B_COUNTER_INSTANCE(timx) can be used to check
  *       whether or not a timer instance supports a 32-bit counter.
  * @note Macro IS_TIM_CC3_INSTANCE(timx) can be used to check whether or not
  *       output channel is supported by a timer instance.
  * @note If dithering is activated, compare_value can be calculated with macro @ref LL_TIM_CALC_DELAY_DITHER .
  */
__STATIC_INLINE void LL_TIM_OC_SetCompareCH3(TIM_TypeDef *timx, uint32_t compare_value)
{
  STM32_WRITE_REG(timx->CCR3, compare_value);
}

/**
  * @brief  Set compare value for output channel 4 (TIMx_CCR4).
  * @rmtoll
  *  CCR4         CCR4          LL_TIM_OC_SetCompareCH4
  * @param  timx Timer instance
  * @param  compare_value between Min_Data=0 and Max_Data=65535
  * @note In 32-bit timer implementations compare value can be between 0x00000000 and 0xFFFFFFFF.
  * @note Macro IS_TIM_32B_COUNTER_INSTANCE(timx) can be used to check
  *       whether or not a timer instance supports a 32-bit counter.
  * @note Macro IS_TIM_CC4_INSTANCE(timx) can be used to check whether or not
  *       output channel 4 is supported by a timer instance.
  * @note If dithering is activated, compare_value can be calculated with macro @ref LL_TIM_CALC_DELAY_DITHER .
  */
__STATIC_INLINE void LL_TIM_OC_SetCompareCH4(TIM_TypeDef *timx, uint32_t compare_value)
{
  STM32_WRITE_REG(timx->CCR4, compare_value);
}

/**
  * @brief  Set compare value for output channel 5 (TIMx_CCR5).
  * @rmtoll
  *  CCR5         CCR5          LL_TIM_OC_SetCompareCH5
  * @param  timx Timer instance
  * @param  compare_value between Min_Data=0 and Max_Data=65535
  * @note Macro IS_TIM_CC5_INSTANCE(timx) can be used to check whether or not
  *       output channel 5 is supported by a timer instance.
  * @note If dithering is activated, compare_value can be calculated with macro @ref LL_TIM_CALC_DELAY_DITHER .
  */
__STATIC_INLINE void LL_TIM_OC_SetCompareCH5(TIM_TypeDef *timx, uint32_t compare_value)
{
  STM32_MODIFY_REG(timx->CCR5, TIM_CCR5_CCR5, compare_value);
}

/**
  * @brief  Set compare value for output channel 6 (TIMx_CCR6).
  * @rmtoll
  *  CCR6         CCR6          LL_TIM_OC_SetCompareCH6
  * @param  timx Timer instance
  * @param  compare_value between Min_Data=0 and Max_Data=65535
  * @note Macro IS_TIM_CC6_INSTANCE(timx) can be used to check whether or not
  *       output channel 6 is supported by a timer instance.
  * @note If dithering is activated, compare_value can be calculated with macro @ref LL_TIM_CALC_DELAY_DITHER .
  */
__STATIC_INLINE void LL_TIM_OC_SetCompareCH6(TIM_TypeDef *timx, uint32_t compare_value)
{
  STM32_WRITE_REG(timx->CCR6, compare_value);
}

/**
  * @brief  Set compare value for output channel 7 (TIMx_CCR7).
  * @rmtoll
  *  CCR7         CCR7          LL_TIM_OC_SetCompareCH7
  * @param  timx Timer instance
  * @param  compare_value between Min_Data=0 and Max_Data=65535
  * @note Macro IS_TIM_CC7_INSTANCE(timx) can be used to check whether or not
  *       output channel 7 is supported by a timer instance.
  * @note If dithering is activated, compare_value can be calculated with macro @ref LL_TIM_CALC_DELAY_DITHER .
  */
__STATIC_INLINE void LL_TIM_OC_SetCompareCH7(TIM_TypeDef *timx, uint32_t compare_value)
{
  STM32_WRITE_REG(timx->CCR7, compare_value);
}

/**
  * @brief  Set compare value for the selected compare unit.
  * @rmtoll
  *  CCR7         CCR7          LL_TIM_OC_SetCompareValue \n
  *  CCR1         CCR1          LL_TIM_OC_SetCompareValue \n
  *  CCR2         CCR2          LL_TIM_OC_SetCompareValue \n
  *  CCR3         CCR3          LL_TIM_OC_SetCompareValue \n
  *  CCR4         CCR4          LL_TIM_OC_SetCompareValue \n
  *  CCR5         CCR5          LL_TIM_OC_SetCompareValue \n
  *  CCR6         CCR6          LL_TIM_OC_SetCompareValue
  * @param  timx Timer instance
  * @param  compare_unit This parameter can be one of the following values:
  *         @arg @ref LL_TIM_OC_COMPARE_UNIT_1
  *         @arg @ref LL_TIM_OC_COMPARE_UNIT_2
  *         @arg @ref LL_TIM_OC_COMPARE_UNIT_3
  *         @arg @ref LL_TIM_OC_COMPARE_UNIT_4
  *         @arg @ref LL_TIM_OC_COMPARE_UNIT_5
  *         @arg @ref LL_TIM_OC_COMPARE_UNIT_6
  *         @arg @ref LL_TIM_OC_COMPARE_UNIT_7
  * @param  compare_value between Min_Data=0 and Max_Data=65535
  * @note Macro IS_TIM_32B_COUNTER_INSTANCE(timx) can be used to check
  *       whether or not a timer instance supports a 32-bit counter.
  * @note Macro IS_TIM_CCx_INSTANCE(timx) can be used to check whether or not
  *       capture unit x is supported by a timer instance.
  * @note If dithering is activated, compare_value can be calculated with macro @ref LL_TIM_CALC_DELAY_DITHER .
  */
__STATIC_INLINE void LL_TIM_OC_SetCompareValue(TIM_TypeDef *timx, uint32_t compare_unit, uint32_t compare_value)
{
  __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&timx->CCR1) + LL_TIM_OFFSET_TAB_CCRx[compare_unit]));
  uint32_t compare_mask = (compare_unit < LL_TIM_OC_COMPARE_UNIT_5) ? TIM_CCR1_CCR1 : TIM_CCR5_CCR5;
  STM32_MODIFY_REG(*pReg, compare_mask, compare_value);
}

/**
  * @brief  Get compare value (TIMx_CCR1) set for output channel 1.
  * @rmtoll
  *  CCR1         CCR1          LL_TIM_OC_GetCompareCH1
  * @param  timx Timer instance
  * @note In 32-bit timer implementations returned compare value can be between 0x00000000 and 0xFFFFFFFF.
  * @note Macro IS_TIM_32B_COUNTER_INSTANCE(timx) can be used to check
  *       whether or not a timer instance supports a 32-bit counter.
  * @note Macro IS_TIM_CC1_INSTANCE(timx) can be used to check whether or not
  *       output channel 1 is supported by a timer instance.
  * @note If dithering is activated, pay attention to the returned value interpretation.
  * @retval compare_value (between Min_Data=0 and Max_Data=65535)
  */
__STATIC_INLINE uint32_t LL_TIM_OC_GetCompareCH1(const TIM_TypeDef *timx)
{
  return (uint32_t)(STM32_READ_REG(timx->CCR1));
}

