MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_tim.h
/**
  * @brief  Get compare value (TIMx_CCR2) set for output channel 2.
  * @rmtoll
  *  CCR2         CCR2          LL_TIM_OC_GetCompareCH2
  * @param  timx Timer instance
  * @note In 32-bit timer implementations returned compare value can be between 0x00000000 and 0xFFFFFFFF.
  * @note Macro IS_TIM_32B_COUNTER_INSTANCE(timx) can be used to check
  *       whether or not a timer instance supports a 32-bit counter.
  * @note Macro IS_TIM_CC2_INSTANCE(timx) can be used to check whether or not
  *       output channel 2 is supported by a timer instance.
  * @note If dithering is activated, pay attention to the returned value interpretation.
  * @retval compare_value (between Min_Data=0 and Max_Data=65535)
  */
__STATIC_INLINE uint32_t LL_TIM_OC_GetCompareCH2(const TIM_TypeDef *timx)
{
  return (uint32_t)(STM32_READ_REG(timx->CCR2));
}

/**
  * @brief  Get compare value (TIMx_CCR3) set for output channel 3.
  * @rmtoll
  *  CCR3         CCR3          LL_TIM_OC_GetCompareCH3
  * @param  timx Timer instance
  * @note In 32-bit timer implementations returned compare value can be between 0x00000000 and 0xFFFFFFFF.
  * @note Macro IS_TIM_32B_COUNTER_INSTANCE(timx) can be used to check
  *       whether or not a timer instance supports a 32-bit counter.
  * @note Macro IS_TIM_CC3_INSTANCE(timx) can be used to check whether or not
  *       output channel 3 is supported by a timer instance.
  * @note If dithering is activated, pay attention to the returned value interpretation.
  * @retval compare_value (between Min_Data=0 and Max_Data=65535)
  */
__STATIC_INLINE uint32_t LL_TIM_OC_GetCompareCH3(const TIM_TypeDef *timx)
{
  return (uint32_t)(STM32_READ_REG(timx->CCR3));
}

/**
  * @brief  Get compare value (TIMx_CCR4) set for output channel 4.
  * @rmtoll
  *  CCR4         CCR4          LL_TIM_OC_GetCompareCH4
  * @param  timx Timer instance
  * @note In 32-bit timer implementations returned compare value can be between 0x00000000 and 0xFFFFFFFF.
  * @note Macro IS_TIM_32B_COUNTER_INSTANCE(timx) can be used to check
  *       whether or not a timer instance supports a 32-bit counter.
  * @note Macro IS_TIM_CC4_INSTANCE(timx) can be used to check whether or not
  *       output channel 4 is supported by a timer instance.
  * @note If dithering is activated, pay attention to the returned value interpretation.
  * @retval compare_value (between Min_Data=0 and Max_Data=65535)
  */
__STATIC_INLINE uint32_t LL_TIM_OC_GetCompareCH4(const TIM_TypeDef *timx)
{
  return (uint32_t)(STM32_READ_REG(timx->CCR4));
}

/**
  * @brief  Get compare value (TIMx_CCR5) set for output channel 5.
  * @rmtoll
  *  CCR5         CCR5          LL_TIM_OC_GetCompareCH5
  * @param  timx Timer instance
  * @note Macro IS_TIM_CC5_INSTANCE(timx) can be used to check whether or not
  *       output channel 5 is supported by a timer instance.
  * @note If dithering is activated, pay attention to the returned value interpretation.
  * @retval compare_value (between Min_Data=0 and Max_Data=65535)
  */
__STATIC_INLINE uint32_t LL_TIM_OC_GetCompareCH5(const TIM_TypeDef *timx)
{
  return (uint32_t)(STM32_READ_BIT(timx->CCR5, TIM_CCR5_CCR5));
}

/**
  * @brief  Get compare value (TIMx_CCR6) set for output channel 6.
  * @rmtoll
  *  CCR6         CCR6          LL_TIM_OC_GetCompareCH6
  * @param  timx Timer instance
  * @note Macro IS_TIM_CC6_INSTANCE(timx) can be used to check whether or not
  *       output channel 6 is supported by a timer instance.
  * @note If dithering is activated, pay attention to the returned value interpretation.
  * @retval compare_value (between Min_Data=0 and Max_Data=65535)
  */
__STATIC_INLINE uint32_t LL_TIM_OC_GetCompareCH6(const TIM_TypeDef *timx)
{
  return (uint32_t)(STM32_READ_REG(timx->CCR6));
}

/**
  * @brief  Get compare value (TIMx_CCR7) set for output channel 7.
  * @rmtoll
  *  CCR7         CCR7          LL_TIM_OC_GetCompareCH7
  * @param  timx Timer instance
  * @note Macro IS_TIM_CC7_INSTANCE(timx) can be used to check whether or not
  *       output channel 7 is supported by a timer instance.
  * @note If dithering is activated, pay attention to the returned value interpretation.
  * @retval compare_value (between Min_Data=0 and Max_Data=65535)
  */
__STATIC_INLINE uint32_t LL_TIM_OC_GetCompareCH7(const TIM_TypeDef *timx)
{
  return (uint32_t)(STM32_READ_REG(timx->CCR7));
}

/**
  * @brief  Get compare value for the selected compare unit.
  * @rmtoll
  *  CCR1         CCR1          LL_TIM_OC_GetCompareValue \n
  *  CCR2         CCR2          LL_TIM_OC_GetCompareValue \n
  *  CCR3         CCR3          LL_TIM_OC_GetCompareValue \n
  *  CCR4         CCR4          LL_TIM_OC_GetCompareValue \n
  *  CCR5         CCR5          LL_TIM_OC_GetCompareValue \n
  *  CCR6         CCR6          LL_TIM_OC_GetCompareValue \n
  *  CCR7         CCR7          LL_TIM_OC_GetCompareValue
  * @param  timx Timer instance
  * @param  compare_unit This parameter can be one of the following values:
  *         @arg @ref LL_TIM_OC_COMPARE_UNIT_1
  *         @arg @ref LL_TIM_OC_COMPARE_UNIT_2
  *         @arg @ref LL_TIM_OC_COMPARE_UNIT_3
  *         @arg @ref LL_TIM_OC_COMPARE_UNIT_4
  *         @arg @ref LL_TIM_OC_COMPARE_UNIT_5
  *         @arg @ref LL_TIM_OC_COMPARE_UNIT_6
  *         @arg @ref LL_TIM_OC_COMPARE_UNIT_7
  * @note Macro IS_TIM_32B_COUNTER_INSTANCE(timx) can be used to check
  *       whether or not a timer instance supports a 32-bit counter.
  * @note Macro IS_TIM_CCx_INSTANCE(timx) can be used to check whether or not
  *       capture unit x is supported by a timer instance.
  * @note If dithering is activated, compare_value can be calculated with macro @ref LL_TIM_CALC_DELAY_DITHER.
  * @retval compare_value (between Min_Data=0 and Max_Data=65535)
  */
__STATIC_INLINE uint32_t LL_TIM_OC_GetCompareValue(TIM_TypeDef *timx, uint32_t compare_unit)
{
  const __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&timx->CCR1) + \
                                                           LL_TIM_OFFSET_TAB_CCRx[compare_unit]));
  uint32_t compare_mask = (compare_unit < LL_TIM_OC_COMPARE_UNIT_5) ? TIM_CCR1_CCR1 : TIM_CCR5_CCR5;
  return (uint32_t)(STM32_READ_BIT(*pReg, compare_mask));
}

/**
  * @brief  Select on which reference signal the OC5REF is combined to.
  * @rmtoll
  *  CCR5         GC5C1          LL_TIM_SetCH5CombinedChannels \n
  *  CCR5         GC5C2          LL_TIM_SetCH5CombinedChannels \n
  *  CCR5         GC5C3          LL_TIM_SetCH5CombinedChannels \n
  *  CCR5         GC5C4          LL_TIM_SetCH5CombinedChannels \n
  *  CCR5         GC5C1O         LL_TIM_SetCH5CombinedChannels \n
  *  CCR5         GC5C2O         LL_TIM_SetCH5CombinedChannels \n
  *  CCR5         GC5C3O         LL_TIM_SetCH5CombinedChannels \n
  *  CCR5         GC5C4O         LL_TIM_SetCH5CombinedChannels
  * @param  timx Timer instance
  * @param  group_ch5 This parameter can be a combination of the following values:
  *         @arg @ref LL_TIM_GROUPCH5_NONE
  *         @arg @ref LL_TIM_GROUPCH5_AND_OC1REFC
  *         @arg @ref LL_TIM_GROUPCH5_AND_OC2REFC
  *         @arg @ref LL_TIM_GROUPCH5_AND_OC3REFC
  *         @arg @ref LL_TIM_GROUPCH5_AND_OC4REFC
  *         @arg @ref LL_TIM_GROUPCH5_OR_OC1REFC
  *         @arg @ref LL_TIM_GROUPCH5_OR_OC2REFC
  *         @arg @ref LL_TIM_GROUPCH5_OR_OC3REFC
  *         @arg @ref LL_TIM_GROUPCH5_OR_OC4REFC
  * @note Macro IS_TIM_COMBINED3PHASEPWM_INSTANCE(timx) can be used to check
  *       whether or not a timer instance supports the combined 3-phase PWM mode.
  */
__STATIC_INLINE void LL_TIM_SetCH5CombinedChannels(TIM_TypeDef *timx, uint32_t group_ch5)
{
  STM32_MODIFY_REG(timx->CCR5, (TIM_CCR5_GC5C1 | TIM_CCR5_GC5C2 | TIM_CCR5_GC5C3 | TIM_CCR5_GC5C4 | \
                                TIM_CCR5_GC5C1O | TIM_CCR5_GC5C2O | TIM_CCR5_GC5C3O | TIM_CCR5_GC5C4O), group_ch5);
}

/**
  * @brief  Get on which reference signal the OC5REF is combined to.
  * @param  timx Timer instance
  * @note Macro IS_TIM_COMBINED3PHASEPWM_INSTANCE(timx) can be used to check
  *       whether or not a timer instance supports the combined 3-phase PWM mode.
  * @retval Returned value can be a combination of the following values:
  *         @arg @ref LL_TIM_GROUPCH5_NONE
  *         @arg @ref LL_TIM_GROUPCH5_AND_OC1REFC
  *         @arg @ref LL_TIM_GROUPCH5_AND_OC2REFC
  *         @arg @ref LL_TIM_GROUPCH5_AND_OC3REFC
  *         @arg @ref LL_TIM_GROUPCH5_AND_OC4REFC
  *         @arg @ref LL_TIM_GROUPCH5_OR_OC1REFC
  *         @arg @ref LL_TIM_GROUPCH5_OR_OC2REFC
  *         @arg @ref LL_TIM_GROUPCH5_OR_OC3REFC
  *         @arg @ref LL_TIM_GROUPCH5_OR_OC4REFC
  */
__STATIC_INLINE uint32_t LL_TIM_GetCH5CombinedChannels(const TIM_TypeDef *timx)
{
  return (uint32_t)(STM32_READ_BIT(timx->CCR5, TIM_CCR5_GC5X));
}

/**
  * @brief  Set the pulse on compare pulse width prescaler.
  * @rmtoll
  *  ECR          PWPRSC           LL_TIM_OC_SetPulseWidthPrescaler
  * @param  timx Timer instance
  * @param  pulse_width_prescaler This parameter can be one of the following values:
  *         @arg @ref LL_TIM_PWPRSC_DIV1
  *         @arg @ref LL_TIM_PWPRSC_DIV2
  *         @arg @ref LL_TIM_PWPRSC_DIV4
  *         @arg @ref LL_TIM_PWPRSC_DIV8
  *         @arg @ref LL_TIM_PWPRSC_DIV16
  *         @arg @ref LL_TIM_PWPRSC_DIV32
  *         @arg @ref LL_TIM_PWPRSC_DIV64
  *         @arg @ref LL_TIM_PWPRSC_DIV128
  * @note Macro IS_TIM_PULSEONCOMPARE_INSTANCE(timx) can be used to check
  *       whether or not the pulse on compare feature is supported by the timer
  *       instance.
  */
__STATIC_INLINE void LL_TIM_OC_SetPulseWidthPrescaler(TIM_TypeDef *timx, uint32_t pulse_width_prescaler)
{
  STM32_MODIFY_REG(timx->ECR, TIM_ECR_PWPRSC, pulse_width_prescaler);
}

/**
  * @brief  Get the pulse on compare pulse width prescaler.
  * @rmtoll
  *  ECR          PWPRSC           LL_TIM_OC_GetPulseWidthPrescaler
  * @param  timx Timer instance
  * @note Macro IS_TIM_PULSEONCOMPARE_INSTANCE(timx) can be used to check
  *       whether or not the pulse on compare feature is supported by the timer
  *       instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_TIM_PWPRSC_DIV1
  *         @arg @ref LL_TIM_PWPRSC_DIV2
  *         @arg @ref LL_TIM_PWPRSC_DIV4
  *         @arg @ref LL_TIM_PWPRSC_DIV8
  *         @arg @ref LL_TIM_PWPRSC_DIV16
  *         @arg @ref LL_TIM_PWPRSC_DIV32
  *         @arg @ref LL_TIM_PWPRSC_DIV64
  *         @arg @ref LL_TIM_PWPRSC_DIV128
  */
__STATIC_INLINE uint32_t LL_TIM_OC_GetPulseWidthPrescaler(const TIM_TypeDef *timx)
{
  return (uint32_t)(STM32_READ_BIT(timx->ECR, TIM_ECR_PWPRSC));
}

/**
  * @brief  Set the pulse on compare pulse width duration.
  * @rmtoll
  *  ECR          PW           LL_TIM_OC_SetPulseWidth
  * @param  timx Timer instance
  * @param  pulse_width This parameter can be between Min_Data=0 and Max_Data=255
  * @note Macro IS_TIM_PULSEONCOMPARE_INSTANCE(timx) can be used to check
  *       whether or not the pulse on compare feature is supported by the timer
  *       instance.
  */
__STATIC_INLINE void LL_TIM_OC_SetPulseWidth(TIM_TypeDef *timx, uint32_t pulse_width)
{
  STM32_MODIFY_REG(timx->ECR, TIM_ECR_PW, pulse_width << TIM_ECR_PW_Pos);
}

/**
  * @brief  Get the pulse on compare pulse width duration.
  * @rmtoll
  *  ECR          PW           LL_TIM_OC_GetPulseWidth
  * @param  timx Timer instance
  * @note Macro IS_TIM_PULSEONCOMPARE_INSTANCE(timx) can be used to check
  *       whether or not the pulse on compare feature is supported by the timer
  *       instance.
  * @retval Returned value can be between Min_Data=0 and Max_Data=255:
  */
__STATIC_INLINE uint32_t LL_TIM_OC_GetPulseWidth(const TIM_TypeDef *timx)
{
  return (uint32_t)((STM32_READ_BIT(timx->ECR, TIM_ECR_PW)) >> TIM_ECR_PW_Pos);
}

/**
  * @}
  */

/** @defgroup TIM_LL_EF_Input_Channel Input channel configuration
  * @{
  */
/**
  * @brief  Configure input channel.
  * @rmtoll
  *  CCMR1        CC1S          LL_TIM_IC_Config \n
  *  CCMR1        IC1PSC        LL_TIM_IC_Config \n
  *  CCMR1        IC1F          LL_TIM_IC_Config \n
  *  CCMR1        CC2S          LL_TIM_IC_Config \n
  *  CCMR1        IC2PSC        LL_TIM_IC_Config \n
  *  CCMR1        IC2F          LL_TIM_IC_Config \n
  *  CCMR2        CC3S          LL_TIM_IC_Config \n
  *  CCMR2        IC3PSC        LL_TIM_IC_Config \n
  *  CCMR2        IC3F          LL_TIM_IC_Config \n
  *  CCMR2        CC4S          LL_TIM_IC_Config \n
  *  CCMR2        IC4PSC        LL_TIM_IC_Config \n
  *  CCMR2        IC4F          LL_TIM_IC_Config \n
  *  CCER         CC1P          LL_TIM_IC_Config \n
  *  CCER         CC1NP         LL_TIM_IC_Config \n
  *  CCER         CC2P          LL_TIM_IC_Config \n
  *  CCER         CC2NP         LL_TIM_IC_Config \n
  *  CCER         CC3P          LL_TIM_IC_Config \n
  *  CCER         CC3NP         LL_TIM_IC_Config \n
  *  CCER         CC4P          LL_TIM_IC_Config \n
  *  CCER         CC4NP         LL_TIM_IC_Config
  * @param  timx Timer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_TIM_CHANNEL_CH1
  *         @arg @ref LL_TIM_CHANNEL_CH2
  *         @arg @ref LL_TIM_CHANNEL_CH3
  *         @arg @ref LL_TIM_CHANNEL_CH4
  * @param  configuration This parameter must be a combination of all the following values:
  *         @arg @ref LL_TIM_ACTIVEINPUT_DIRECT or @ref LL_TIM_ACTIVEINPUT_INDIRECT or @ref LL_TIM_ACTIVEINPUT_TRC
  *         @arg @ref LL_TIM_ICPSC_DIV1 or ... or @ref LL_TIM_ICPSC_DIV8
  *         @arg @ref LL_TIM_IC_FILTER_FDIV1 or ... or @ref LL_TIM_IC_FILTER_FDIV32_N8
  *         @arg @ref LL_TIM_IC_POLARITY_RISING or @ref LL_TIM_IC_POLARITY_FALLING or
                 @ref LL_TIM_IC_POLARITY_RISING_FALLING
  */
__STATIC_INLINE void LL_TIM_IC_Config(TIM_TypeDef *timx, uint32_t channel, uint32_t configuration)
{
  uint32_t ichannel = LL_TIM_GET_CHANNEL_INDEX(channel);
  __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&timx->CCMR1) + LL_TIM_OFFSET_TAB_CCMRx[ichannel]));
  STM32_MODIFY_REG(*pReg, ((TIM_CCMR1_IC1F | TIM_CCMR1_IC1PSC | TIM_CCMR1_CC1S) << LL_TIM_SHIFT_TAB_ICxx[ichannel]),
                   ((configuration >> 16U) & (TIM_CCMR1_IC1F | TIM_CCMR1_IC1PSC | TIM_CCMR1_CC1S))                \
                   << LL_TIM_SHIFT_TAB_ICxx[ichannel]);
  STM32_MODIFY_REG(timx->CCER, ((TIM_CCER_CC1NP | TIM_CCER_CC1P) << LL_TIM_SHIFT_TAB_CCxP[ichannel]),
                   (configuration & (TIM_CCER_CC1NP | TIM_CCER_CC1P)) << LL_TIM_SHIFT_TAB_CCxP[ichannel]);
}

