MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_tim.h
/**
  * @brief  Get the source of the input channel.
  * @rmtoll
  *  TISEL    TI1SEL      LL_TIM_IC_GetSource \n
  *  TISEL    TI2SEL      LL_TIM_IC_GetSource \n
  *  TISEL    TI3SEL      LL_TIM_IC_GetSource \n
  *  TISEL    TI4SEL      LL_TIM_IC_GetSource
  * @param  timx Timer instance
  * @param  channel This parameter can be one of the following values:
  *           @arg @ref LL_TIM_CHANNEL_CH1
  *           @arg @ref LL_TIM_CHANNEL_CH2
  *           @arg @ref LL_TIM_CHANNEL_CH3
  *           @arg @ref LL_TIM_CHANNEL_CH4
  * @retval Returned value can be one of the following values:
  *
  *         TIM1: one of the following values:
  *
  *            . . TI1_RMP can be one of the following values
  *            LL_TIM_TIM1_TI1_GPIO:                tim1_ti1 is connected to TIM1_CH1
  *            LL_TIM_TIM1_TI1_COMP1_OUT:           tim1_ti1 is connected to comp1_out
  *            LL_TIM_TIM1_TI1_COMP2_OUT:           tim1_ti1 is connected to comp2_out (*)
  *            LL_TIM_TIM1_TI1_COMP3_OUT:           tim1_ti1 is connected to comp3_out (*)
  *            LL_TIM_TIM1_TI1_COMP4_OUT:           tim1_ti1 is connected to comp4_out (*)
  *            LL_TIM_TIM1_TI1_PLAY1_OUT0:          tim1_ti1 is connected to play1_out0 (*)
  *
  *            . . TI2_RMP can be one of the following values
  *            LL_TIM_TIM1_TI2_GPIO:                tim1_ti2 is connected to TIM1_CH2
  *            LL_TIM_TIM1_TI2_PLAY1_OUT2:          tim1_ti2 is connected to play1_out2 (*)
  *
  *            . . TI3_RMP can be one of the following values
  *            LL_TIM_TIM1_TI3_GPIO:                tim1_ti3 is connected to TIM1_CH3
  *            LL_TIM_TIM1_TI3_PLAY1_OUT1:          tim1_ti3 is connected to play1_out1 (*)
  *
  *            . . TI4_RMP can be one of the following values
  *            LL_TIM_TIM1_TI4_GPIO:                tim1_ti4 is connected to TIM1_CH4
  *            LL_TIM_TIM1_TI4_PLAY1_OUT8:          tim1_ti4 is connected to play1_out8 (*)
  *
  *         TIM2: one of the following values:
  *
  *            . . TI1_RMP can be one of the following values
  *            LL_TIM_TIM2_TI1_GPIO:                tim2_ti1 is connected to TIM2_CH1
  *            LL_TIM_TIM2_TI1_COMP1_OUT:           tim2_ti1 is connected to comp1_out
  *            LL_TIM_TIM2_TI1_COMP2_OUT:           tim2_ti1 is connected to comp2_out (*)
  *            LL_TIM_TIM2_TI1_ETH1_PTP_PPS_OUT:    tim2_ti1 is connected to eth1_ptp_pps_out (*)
  *            LL_TIM_TIM2_TI1_LSI:                 tim2_ti1 is connected to LSI
  *            LL_TIM_TIM2_TI1_LSE:                 tim2_ti1 is connected to LSE
  *            LL_TIM_TIM2_TI1_RTC_WUT_TRG:         tim2_ti1 is connected to rtc_wut_trg
  *            LL_TIM_TIM2_TI1_TIM5_CH1:            tim2_ti1 is connected to TIM5_CH1 (*)
  *            LL_TIM_TIM2_TI1_FDCAN1_RXEOF_EVT:    tim2_ti1 is connected to fdcan1_rxeof_evt (*)
  *            LL_TIM_TIM2_TI1_COMP3_OUT:           tim2_ti1 is connected to comp3_out (*)
  *            LL_TIM_TIM2_TI1_COMP4_OUT:           tim2_ti1 is connected to comp4_out (*)
  *            LL_TIM_TIM2_TI1_PLAY1_OUT15:         tim2_ti1 is connected to play1_out15 (*)
  *
  *            . . TI2_RMP can be one of the following values
  *            LL_TIM_TIM2_TI2_GPIO:                tim2_ti2 is connected to TIM2_CH2
  *            LL_TIM_TIM2_TI2_HSE_RTC:             tim2_ti2 is connected to hse_1M_ck
  *            LL_TIM_TIM2_TI2_MCO1:                tim2_ti2 is connected to MCO1
  *            LL_TIM_TIM2_TI2_MCO2:                tim2_ti2 is connected to MCO2
  *            LL_TIM_TIM2_TI2_FDCAN1_TXEOF_EVT:    tim2_ti2 is connected to fdcan1_txeof_evt (*)
  *            LL_TIM_TIM2_TI2_PLAY1_OUT15:         tim2_ti2 is connected to play1_out15 (*)
  *
  *            . . TI3_RMP can be one of the following values
  *            LL_TIM_TIM2_TI3_GPIO:                tim2_ti3 is connected to TIM2_CH3
  *            LL_TIM_TIM2_TI3_PLAY1_OUT3:          tim2_ti3 is connected to play1_out3 (*)
  *            LL_TIM_TIM2_TI3_FDCAN2_RXEOF_EVT:    tim2_ti3 is connected to fdcan2_rxeof_evt (*)
  *
  *            . . TI4_RMP can be one of the following values
  *            LL_TIM_TIM2_TI4_GPIO:                tim2_ti4 is connected to TIM2_CH4
  *            LL_TIM_TIM2_TI4_COMP1_OUT:           tim2_ti4 is connected to comp1_out
  *            LL_TIM_TIM2_TI4_COMP2_OUT:           tim2_ti4 is connected to comp2_out (*)
  *            LL_TIM_TIM2_TI4_PLAY1_OUT0:          tim2_ti4 is connected to play1_out0 (*)
  *            LL_TIM_TIM2_TI4_FDCAN2_TXEOF_EVT:    tim2_ti4 is connected to fdcan2_txeof_evt (*)
  *
  *         TIM3: one of the following values: (**)
  *
  *            . . TI1_RMP can be one of the following values
  *            LL_TIM_TIM3_TI1_GPIO:                tim3_ti1 is connected to TIM3_CH1
  *            LL_TIM_TIM3_TI1_COMP1_OUT:           tim3_ti1 is connected to comp1_out
  *            LL_TIM_TIM3_TI1_ETH1_PTP_PPS_OUT:    tim3_ti1 is connected to eth1_ptp_pps_out (*)
  *            LL_TIM_TIM3_TI1_FDCAN2_RXEOF_EVT:    tim3_ti1 is connected to fdcan2_rxeof_evt (*)
  *            LL_TIM_TIM3_TI1_COMP2_OUT:           tim3_ti1 is connected to comp2_out (*)
  *            LL_TIM_TIM3_TI1_COMP3_OUT:           tim3_ti1 is connected to comp3_out (*)
  *            LL_TIM_TIM3_TI1_COMP4_OUT:           tim3_ti1 is connected to comp4_out (*)
  *            LL_TIM_TIM3_TI1_PLAY1_OUT8:          tim3_ti1 is connected to play1_out8 (*)
  *
  *            . . TI2_RMP can be one of the following values
  *            LL_TIM_TIM3_TI2_GPIO:                tim3_ti2 is connected to TIM3_CH2
  *            LL_TIM_TIM3_TI2_FDCAN2_TXEOF_EVT:    tim3_ti2 is connected to fdcan2_txeof_evt (*)
  *            LL_TIM_TIM3_TI2_PLAY1_OUT9:          tim3_ti2 is connected to play1_out9 (*)
  *
  *            . . TI3_RMP can be one of the following values
  *            LL_TIM_TIM3_TI3_GPIO:                tim3_ti3 is connected to TIM3_CH3
  *            LL_TIM_TIM3_TI3_PLAY1_OUT10:         tim3_ti3 is connected to play1_out10 (*)
  *
  *            . . TI4_RMP can be one of the following values
  *            LL_TIM_TIM3_TI4_GPIO:                tim3_ti4 is connected to TIM3_CH4
  *            LL_TIM_TIM3_TI4_PLAY1_OUT11:         tim3_ti4 is connected to play1_out11 (*)
  *
  *         TIM4: one of the following values: (**)
  *
  *            . . TI1_RMP can be one of the following values
  *            LL_TIM_TIM4_TI1_GPIO:                tim4_ti1 is connected to TIM4_CH1
  *            LL_TIM_TIM4_TI1_COMP1_OUT:           tim4_ti1 is connected to comp1_out
  *
  *            . . TI2_RMP can be one of the following values
  *            LL_TIM_TIM4_TI2_GPIO:                tim4_ti2 is connected to TIM4_CH2
  *
  *            . . TI3_RMP can be one of the following values
  *            LL_TIM_TIM4_TI3_GPIO:                tim4_ti3 is connected to TIM4_CH3
  *
  *            . . TI4_RMP can be one of the following values
  *            LL_TIM_TIM4_TI4_GPIO:                tim4_ti4 is connected to TIM4_CH4
  *
  *         TIM5: one of the following values: (**)
  *
  *            . . TI1_RMP can be one of the following values
  *            LL_TIM_TIM5_TI1_GPIO:                tim5_ti1 is connected to TIM5_CH1
  *            LL_TIM_TIM5_TI1_COMP1_OUT:           tim5_ti1 is connected to comp1_out
  *            LL_TIM_TIM5_TI1_COMP2_OUT:           tim5_ti1 is connected to comp2_out (*)
  *            LL_TIM_TIM5_TI1_COMP3_OUT:           tim5_ti1 is connected to comp3_out (*)
  *            LL_TIM_TIM5_TI1_COMP4_OUT:           tim5_ti1 is connected to comp4_out (*)
  *
  *            . . TI2_RMP can be one of the following values
  *            LL_TIM_TIM5_TI2_GPIO:                tim5_ti2 is connected to TIM5_CH2
  *
  *            . . TI3_RMP can be one of the following values
  *            LL_TIM_TIM5_TI3_GPIO:                tim5_ti3 is connected to TIM5_CH3
  *
  *            . . TI4_RMP can be one of the following values
  *            LL_TIM_TIM5_TI4_GPIO:                tim5_ti4 is connected to TIM5_CH4
  *
  *         TIM8: one of the following values:
  *
  *            . . TI1_RMP can be one of the following values
  *            LL_TIM_TIM8_TI1_GPIO:                tim8_ti1 is connected to TIM8_CH1
  *            LL_TIM_TIM8_TI1_COMP1_OUT:           tim8_ti1 is connected to comp1_out
  *            LL_TIM_TIM8_TI1_COMP2_OUT:           tim8_ti1 is connected to comp2_out (*)
  *            LL_TIM_TIM8_TI1_COMP3_OUT:           tim8_ti1 is connected to comp3_out (*)
  *            LL_TIM_TIM8_TI1_COMP4_OUT:           tim8_ti1 is connected to comp4_out (*)
  *            LL_TIM_TIM8_TI1_PLAY1_OUT14:         tim8_ti1 is connected to play1_out14 (*)
  *
  *            . . TI2_RMP can be one of the following values
  *            LL_TIM_TIM8_TI2_GPIO:                tim8_ti2 is connected to TIM8_CH2
  *            LL_TIM_TIM8_TI2_PLAY1_OUT10:         tim8_ti2 is connected to play1_out10 (*)
  *
  *            . . TI3_RMP can be one of the following values
  *            LL_TIM_TIM8_TI3_GPIO:                tim8_ti3 is connected to TIM8_CH3
  *            LL_TIM_TIM8_TI3_PLAY1_OUT12:         tim8_ti3 is connected to play1_out12 (*)
  *
  *            . . TI4_RMP can be one of the following values
  *            LL_TIM_TIM8_TI4_GPIO:                tim8_ti4 is connected to TIM8_CH4
  *            LL_TIM_TIM8_TI4_PLAY1_OUT5:          tim8_ti4 is connected to play1_out5 (*)
  *
  *         TIM12: one of the following values:
  *
  *            . . TI1_RMP can be one of the following values
  *            LL_TIM_TIM12_TI1_GPIO:               tim12_ti1 is connected to TIM12_CH1
  *            LL_TIM_TIM12_TI1_COMP1_OUT:          tim12_ti1 is connected to comp1_out
  *            LL_TIM_TIM12_TI1_COMP2_OUT:          tim12_ti1 is connected to comp2_out (*)
  *            LL_TIM_TIM12_TI1_MCO1:               tim12_ti1 is connected to MCO1
  *            LL_TIM_TIM12_TI1_MCO2:               tim12_ti1 is connected to MCO2
  *            LL_TIM_TIM12_TI1_HSE_RTC:            tim12_ti1 is connected to hse_1M_ck
  *            LL_TIM_TIM12_TI1_I3C1_IBI_ACK:       tim12_ti1 is connected to i3c1_ibi_ack
  *            LL_TIM_TIM12_TI1_COMP3_OUT:          tim12_ti1 is connected to comp3_out (*)
  *            LL_TIM_TIM12_TI1_COMP4_OUT:          tim12_ti1 is connected to comp4_out (*)
  *            LL_TIM_TIM12_TI1_PLAY1_OUT7:         tim12_ti1 is connected to play1_out7 (*)
  *
  *            . . TI2_RMP can be one of the following values
  *            LL_TIM_TIM12_TI2_GPIO:               tim12_ti2 is connected to TIM12_CH2
  *            LL_TIM_TIM12_TI2_PLAY1_OUT14:        tim12_ti2 is connected to play1_out14 (*)
  *
  *         TIM15: one of the following values:
  *
  *            . . TI1_RMP can be one of the following values
  *            LL_TIM_TIM15_TI1_GPIO:               tim15_ti1 is connected to TIM15_CH1
  *            LL_TIM_TIM15_TI1_COMP1_OUT:          tim15_ti1 is connected to comp1_out
  *            LL_TIM_TIM15_TI1_COMP2_OUT:          tim15_ti1 is connected to comp2_out (*)
  *            LL_TIM_TIM15_TI1_LSE:                tim15_ti1 is connected to LSE
  *            LL_TIM_TIM15_TI1_FDCAN2_RXEOF_EVT:   tim15_ti1 is connected to fdcan2_rxeof_evt (*)
  *            LL_TIM_TIM15_TI1_COMP3_OUT:          tim15_ti1 is connected to comp3_out (*)
  *            LL_TIM_TIM15_TI1_COMP4_OUT:          tim15_ti1 is connected to comp4_out (*)
  *            LL_TIM_TIM15_TI1_PLAY1_OUT4:         tim15_ti1 is connected to play1_out4 (*)
  *
  *            . . TI2_RMP can be one of the following values
  *            LL_TIM_TIM15_TI2_GPIO:               tim15_ti2 is connected to TIM15_CH2
  *            LL_TIM_TIM15_TI2_FDCAN2_TXEOF_EVT:   tim15_ti2 is connected to fdcan2_txeof_evt (*)
  *            LL_TIM_TIM15_TI2_PLAY1_OUT5:         tim15_ti2 is connected to play1_out5 (*)
  *
  *         TIM16: one of the following values: (**)
  *            LL_TIM_TIM16_TI1_GPIO:               tim16_ti1 is connected to TIM16_CH1
  *            LL_TIM_TIM16_TI1_COMP1_OUT:          tim16_ti1 is connected to comp1_out
  *            LL_TIM_TIM16_TI1_LSI:                tim16_ti1 is connected to LSI
  *            LL_TIM_TIM16_TI1_LSE:                tim16_ti1 is connected to LSE
  *            LL_TIM_TIM16_TI1_RTC_WUT_TRG:        tim16_ti1 is connected to rtc_wut_trg
  *            LL_TIM_TIM16_TI1_MCO1:               tim16_ti1 is connected to MCO1
  *            LL_TIM_TIM16_TI1_MCO2:               tim16_ti1 is connected to MCO2
  *            LL_TIM_TIM16_TI1_COMP2_OUT:          tim16_ti1 is connected to comp2_out (*)
  *            LL_TIM_TIM16_TI1_COMP3_OUT:          tim16_ti1 is connected to comp3_out (*)
  *            LL_TIM_TIM16_TI1_COMP4_OUT:          tim16_ti1 is connected to comp4_out (*)
  *            LL_TIM_TIM16_TI1_PLAY1_OUT5:         tim16_ti1 is connected to play1_out5 (*)
  *
  *         TIM17: one of the following values: (**)
  *            LL_TIM_TIM17_TI1_GPIO:               tim17_ti1 is connected to TIM17_CH1
  *            LL_TIM_TIM17_TI1_COMP1_OUT:          tim17_ti1 is connected to comp1_out
  *            LL_TIM_TIM17_TI1_HSE_RTC:            tim17_ti1 is connected to hse_1M_ck
  *            LL_TIM_TIM17_TI1_MCO1:               tim17_ti1 is connected to MCO1
  *            LL_TIM_TIM17_TI1_MCO2:               tim17_ti1 is connected to MCO2
  *            LL_TIM_TIM17_TI1_I3C1_IBI_ACK:       tim17_ti1 is connected to i3c1_ibi_ack
  *            LL_TIM_TIM17_TI1_COMP2_OUT:          tim17_ti1 is connected to comp2_out (*)
  *            LL_TIM_TIM17_TI1_COMP3_OUT:          tim17_ti1 is connected to comp3_out (*)
  *            LL_TIM_TIM17_TI1_COMP4_OUT:          tim17_ti1 is connected to comp4_out (*)
  *            LL_TIM_TIM17_TI1_PLAY1_OUT9:         tim17_ti1 is connected to play1_out9 (*)
  *
  *         TIM20: one of the following values: (**)
  *
  *            . . TI1_RMP can be one of the following values
  *            LL_TIM_TIM20_TI1_GPIO:               tim20_ti1 is connected to TIM20_CH1
  *            LL_TIM_TIM20_TI1_COMP1_OUT:          tim20_ti1 is connected to comp1_out
  *            LL_TIM_TIM20_TI1_COMP2_OUT:          tim20_ti1 is connected to comp2_out (*)
  *            LL_TIM_TIM20_TI1_COMP3_OUT:          tim20_ti1 is connected to comp3_out (*)
  *            LL_TIM_TIM20_TI1_COMP4_OUT:          tim20_ti1 is connected to comp4_out (*)
  *            LL_TIM_TIM20_TI1_PLAY1_OUT3:         tim20_ti1 is connected to play1_out3 (*)
  *
  *            . . TI2_RMP can be one of the following values
  *            LL_TIM_TIM20_TI2_GPIO:               tim20_ti2 is connected to TIM20_CH2
  *            LL_TIM_TIM20_TI2_PLAY1_OUT7:         tim20_ti2 is connected to play1_out7 (*)
  *
  *            . . TI3_RMP can be one of the following values
  *            LL_TIM_TIM20_TI3_GPIO:               tim20_ti3 is connected to TIM20_CH3
  *            LL_TIM_TIM20_TI3_PLAY1_OUT8:         tim20_ti3 is connected to play1_out8 (*)
  *
  *            . . TI4_RMP can be one of the following values
  *            LL_TIM_TIM20_TI4_GPIO:               tim20_ti4 is connected to TIM20_CH4
  *            LL_TIM_TIM20_TI4_PLAY1_OUT9:         tim20_ti4 is connected to play1_out9 (*)
  *
  *         (*)  Value not defined in all devices.
  *         (**) Timer instance not available on all devices.
  * @note Macro IS_TIM_REMAP_INSTANCE(timx) can be used to check whether or not
  *       a some timer inputs can be remapped.
  */
__STATIC_INLINE uint32_t LL_TIM_IC_GetSource(const TIM_TypeDef *timx, uint32_t channel)
{
  uint32_t ichannel = LL_TIM_GET_CHANNEL_INDEX(channel);
  uint32_t shift = (ichannel << 2U) & 0x18U;
  return (uint32_t)(STM32_READ_BIT(timx->TISEL, TIM_TISEL_TI1SEL << shift));
}

/**
  * @brief  Set the active input.
  * @rmtoll
  *  CCMR1        CC1S          LL_TIM_IC_SetActiveInput \n
  *  CCMR1        CC2S          LL_TIM_IC_SetActiveInput \n
  *  CCMR2        CC3S          LL_TIM_IC_SetActiveInput \n
  *  CCMR2        CC4S          LL_TIM_IC_SetActiveInput
  * @param  timx Timer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_TIM_CHANNEL_CH1
  *         @arg @ref LL_TIM_CHANNEL_CH2
  *         @arg @ref LL_TIM_CHANNEL_CH3
  *         @arg @ref LL_TIM_CHANNEL_CH4
  * @param  ic_active_input This parameter can be one of the following values:
  *         @arg @ref LL_TIM_ACTIVEINPUT_DIRECT
  *         @arg @ref LL_TIM_ACTIVEINPUT_INDIRECT
  *         @arg @ref LL_TIM_ACTIVEINPUT_TRC
  */
__STATIC_INLINE void LL_TIM_IC_SetActiveInput(TIM_TypeDef *timx, uint32_t channel, uint32_t ic_active_input)
{
  uint32_t ichannel = LL_TIM_GET_CHANNEL_INDEX(channel);
  __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&timx->CCMR1) + LL_TIM_OFFSET_TAB_CCMRx[ichannel]));
  STM32_MODIFY_REG(*pReg, ((TIM_CCMR1_CC1S) << LL_TIM_SHIFT_TAB_ICxx[ichannel]),
                   (ic_active_input >> LL_TIM_IC_CONFIG_POS) << LL_TIM_SHIFT_TAB_ICxx[ichannel]);
}

/**
  * @brief  Get the current active input.
  * @rmtoll
  *  CCMR1        CC1S          LL_TIM_IC_GetActiveInput \n
  *  CCMR1        CC2S          LL_TIM_IC_GetActiveInput \n
  *  CCMR2        CC3S          LL_TIM_IC_GetActiveInput \n
  *  CCMR2        CC4S          LL_TIM_IC_GetActiveInput
  * @param  timx Timer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_TIM_CHANNEL_CH1
  *         @arg @ref LL_TIM_CHANNEL_CH2
  *         @arg @ref LL_TIM_CHANNEL_CH3
  *         @arg @ref LL_TIM_CHANNEL_CH4
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_TIM_ACTIVEINPUT_DIRECT
  *         @arg @ref LL_TIM_ACTIVEINPUT_INDIRECT
  *         @arg @ref LL_TIM_ACTIVEINPUT_TRC
  */
__STATIC_INLINE uint32_t LL_TIM_IC_GetActiveInput(const TIM_TypeDef *timx, uint32_t channel)
{
  uint32_t ichannel = LL_TIM_GET_CHANNEL_INDEX(channel);
  const __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&timx->CCMR1) + \
                                                           LL_TIM_OFFSET_TAB_CCMRx[ichannel]));
  return ((STM32_READ_BIT(*pReg, ((TIM_CCMR1_CC1S) << LL_TIM_SHIFT_TAB_ICxx[ichannel])) \
           >> LL_TIM_SHIFT_TAB_ICxx[ichannel]) << LL_TIM_IC_CONFIG_POS);
}

/**
  * @brief  Set the prescaler of input channel.
  * @rmtoll
  *  CCMR1        IC1PSC        LL_TIM_IC_SetPrescaler \n
  *  CCMR1        IC2PSC        LL_TIM_IC_SetPrescaler \n
  *  CCMR2        IC3PSC        LL_TIM_IC_SetPrescaler \n
  *  CCMR2        IC4PSC        LL_TIM_IC_SetPrescaler
  * @param  timx Timer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_TIM_CHANNEL_CH1
  *         @arg @ref LL_TIM_CHANNEL_CH2
  *         @arg @ref LL_TIM_CHANNEL_CH3
  *         @arg @ref LL_TIM_CHANNEL_CH4
  * @param  ic_prescaler This parameter can be one of the following values:
  *         @arg @ref LL_TIM_ICPSC_DIV1
  *         @arg @ref LL_TIM_ICPSC_DIV2
  *         @arg @ref LL_TIM_ICPSC_DIV4
  *         @arg @ref LL_TIM_ICPSC_DIV8
  */
__STATIC_INLINE void LL_TIM_IC_SetPrescaler(TIM_TypeDef *timx, uint32_t channel, uint32_t ic_prescaler)
{
  uint32_t ichannel = LL_TIM_GET_CHANNEL_INDEX(channel);
  __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&timx->CCMR1) + LL_TIM_OFFSET_TAB_CCMRx[ichannel]));
  STM32_MODIFY_REG(*pReg, ((TIM_CCMR1_IC1PSC) << LL_TIM_SHIFT_TAB_ICxx[ichannel]),
                   (ic_prescaler >> LL_TIM_IC_CONFIG_POS) << LL_TIM_SHIFT_TAB_ICxx[ichannel]);
}

/**
  * @brief  Get the current prescaler value acting on an  input channel.
  * @rmtoll
  *  CCMR1        IC1PSC        LL_TIM_IC_GetPrescaler \n
  *  CCMR1        IC2PSC        LL_TIM_IC_GetPrescaler \n
  *  CCMR2        IC3PSC        LL_TIM_IC_GetPrescaler \n
  *  CCMR2        IC4PSC        LL_TIM_IC_GetPrescaler
  * @param  timx Timer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_TIM_CHANNEL_CH1
  *         @arg @ref LL_TIM_CHANNEL_CH2
  *         @arg @ref LL_TIM_CHANNEL_CH3
  *         @arg @ref LL_TIM_CHANNEL_CH4
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_TIM_ICPSC_DIV1
  *         @arg @ref LL_TIM_ICPSC_DIV2
  *         @arg @ref LL_TIM_ICPSC_DIV4
  *         @arg @ref LL_TIM_ICPSC_DIV8
  */
__STATIC_INLINE uint32_t LL_TIM_IC_GetPrescaler(const TIM_TypeDef *timx, uint32_t channel)
{
  uint32_t ichannel = LL_TIM_GET_CHANNEL_INDEX(channel);
  const __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&timx->CCMR1) + \
                                                           LL_TIM_OFFSET_TAB_CCMRx[ichannel]));
  return ((STM32_READ_BIT(*pReg, ((TIM_CCMR1_IC1PSC) << LL_TIM_SHIFT_TAB_ICxx[ichannel])) \
           >> LL_TIM_SHIFT_TAB_ICxx[ichannel]) << LL_TIM_IC_CONFIG_POS);
}

/**
  * @brief  Set the input filter duration.
  * @rmtoll
  *  CCMR1        IC1F          LL_TIM_IC_SetFilter \n
  *  CCMR1        IC2F          LL_TIM_IC_SetFilter \n
  *  CCMR2        IC3F          LL_TIM_IC_SetFilter \n
  *  CCMR2        IC4F          LL_TIM_IC_SetFilter
  * @param  timx Timer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_TIM_CHANNEL_CH1
  *         @arg @ref LL_TIM_CHANNEL_CH2
  *         @arg @ref LL_TIM_CHANNEL_CH3
  *         @arg @ref LL_TIM_CHANNEL_CH4
  * @param  ic_filter This parameter can be one of the following values:
  *         @arg @ref LL_TIM_IC_FILTER_FDIV1
  *         @arg @ref LL_TIM_IC_FILTER_FDIV1_N2
  *         @arg @ref LL_TIM_IC_FILTER_FDIV1_N4
  *         @arg @ref LL_TIM_IC_FILTER_FDIV1_N8
  *         @arg @ref LL_TIM_IC_FILTER_FDIV2_N6
  *         @arg @ref LL_TIM_IC_FILTER_FDIV2_N8
  *         @arg @ref LL_TIM_IC_FILTER_FDIV4_N6
  *         @arg @ref LL_TIM_IC_FILTER_FDIV4_N8
  *         @arg @ref LL_TIM_IC_FILTER_FDIV8_N6
  *         @arg @ref LL_TIM_IC_FILTER_FDIV8_N8
  *         @arg @ref LL_TIM_IC_FILTER_FDIV16_N5
  *         @arg @ref LL_TIM_IC_FILTER_FDIV16_N6
  *         @arg @ref LL_TIM_IC_FILTER_FDIV16_N8
  *         @arg @ref LL_TIM_IC_FILTER_FDIV32_N5
  *         @arg @ref LL_TIM_IC_FILTER_FDIV32_N6
  *         @arg @ref LL_TIM_IC_FILTER_FDIV32_N8
  */
__STATIC_INLINE void LL_TIM_IC_SetFilter(TIM_TypeDef *timx, uint32_t channel, uint32_t ic_filter)
{
  uint32_t ichannel = LL_TIM_GET_CHANNEL_INDEX(channel);
  __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&timx->CCMR1) + LL_TIM_OFFSET_TAB_CCMRx[ichannel]));
  STM32_MODIFY_REG(*pReg, ((TIM_CCMR1_IC1F) << LL_TIM_SHIFT_TAB_ICxx[ichannel]),
                   (ic_filter >> LL_TIM_IC_CONFIG_POS) << LL_TIM_SHIFT_TAB_ICxx[ichannel]);
}

