MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_tim.h
/**
  * @brief  Get the input filter duration.
  * @rmtoll
  *  CCMR1        IC1F          LL_TIM_IC_GetFilter \n
  *  CCMR1        IC2F          LL_TIM_IC_GetFilter \n
  *  CCMR2        IC3F          LL_TIM_IC_GetFilter \n
  *  CCMR2        IC4F          LL_TIM_IC_GetFilter
  * @param  timx Timer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_TIM_CHANNEL_CH1
  *         @arg @ref LL_TIM_CHANNEL_CH2
  *         @arg @ref LL_TIM_CHANNEL_CH3
  *         @arg @ref LL_TIM_CHANNEL_CH4
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_TIM_IC_FILTER_FDIV1
  *         @arg @ref LL_TIM_IC_FILTER_FDIV1_N2
  *         @arg @ref LL_TIM_IC_FILTER_FDIV1_N4
  *         @arg @ref LL_TIM_IC_FILTER_FDIV1_N8
  *         @arg @ref LL_TIM_IC_FILTER_FDIV2_N6
  *         @arg @ref LL_TIM_IC_FILTER_FDIV2_N8
  *         @arg @ref LL_TIM_IC_FILTER_FDIV4_N6
  *         @arg @ref LL_TIM_IC_FILTER_FDIV4_N8
  *         @arg @ref LL_TIM_IC_FILTER_FDIV8_N6
  *         @arg @ref LL_TIM_IC_FILTER_FDIV8_N8
  *         @arg @ref LL_TIM_IC_FILTER_FDIV16_N5
  *         @arg @ref LL_TIM_IC_FILTER_FDIV16_N6
  *         @arg @ref LL_TIM_IC_FILTER_FDIV16_N8
  *         @arg @ref LL_TIM_IC_FILTER_FDIV32_N5
  *         @arg @ref LL_TIM_IC_FILTER_FDIV32_N6
  *         @arg @ref LL_TIM_IC_FILTER_FDIV32_N8
  */
__STATIC_INLINE uint32_t LL_TIM_IC_GetFilter(const TIM_TypeDef *timx, uint32_t channel)
{
  uint32_t ichannel = LL_TIM_GET_CHANNEL_INDEX(channel);
  const __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&timx->CCMR1) + \
                                                           LL_TIM_OFFSET_TAB_CCMRx[ichannel]));
  return ((STM32_READ_BIT(*pReg, ((TIM_CCMR1_IC1F) << LL_TIM_SHIFT_TAB_ICxx[ichannel])) \
           >> LL_TIM_SHIFT_TAB_ICxx[ichannel]) << LL_TIM_IC_CONFIG_POS);
}

/**
  * @brief  Set the input channel polarity.
  * @rmtoll
  *  CCER         CC1P          LL_TIM_IC_SetPolarity \n
  *  CCER         CC1NP         LL_TIM_IC_SetPolarity \n
  *  CCER         CC2P          LL_TIM_IC_SetPolarity \n
  *  CCER         CC2NP         LL_TIM_IC_SetPolarity \n
  *  CCER         CC3P          LL_TIM_IC_SetPolarity \n
  *  CCER         CC3NP         LL_TIM_IC_SetPolarity \n
  *  CCER         CC4P          LL_TIM_IC_SetPolarity \n
  *  CCER         CC4NP         LL_TIM_IC_SetPolarity
  * @param  timx Timer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_TIM_CHANNEL_CH1
  *         @arg @ref LL_TIM_CHANNEL_CH2
  *         @arg @ref LL_TIM_CHANNEL_CH3
  *         @arg @ref LL_TIM_CHANNEL_CH4
  * @param  ic_polarity This parameter can be one of the following values:
  *         @arg @ref LL_TIM_IC_POLARITY_RISING
  *         @arg @ref LL_TIM_IC_POLARITY_FALLING
  *         @arg @ref LL_TIM_IC_POLARITY_RISING_FALLING
  */
__STATIC_INLINE void LL_TIM_IC_SetPolarity(TIM_TypeDef *timx, uint32_t channel, uint32_t ic_polarity)
{
  uint32_t ichannel = LL_TIM_GET_CHANNEL_INDEX(channel);
  STM32_MODIFY_REG(timx->CCER, ((TIM_CCER_CC1NP | TIM_CCER_CC1P) << LL_TIM_SHIFT_TAB_CCxP[ichannel]),
                   ic_polarity << LL_TIM_SHIFT_TAB_CCxP[ichannel]);
}

/**
  * @brief  Get the current input channel polarity.
  * @rmtoll
  *  CCER         CC1P          LL_TIM_IC_GetPolarity \n
  *  CCER         CC1NP         LL_TIM_IC_GetPolarity \n
  *  CCER         CC2P          LL_TIM_IC_GetPolarity \n
  *  CCER         CC2NP         LL_TIM_IC_GetPolarity \n
  *  CCER         CC3P          LL_TIM_IC_GetPolarity \n
  *  CCER         CC3NP         LL_TIM_IC_GetPolarity \n
  *  CCER         CC4P          LL_TIM_IC_GetPolarity \n
  *  CCER         CC4NP         LL_TIM_IC_GetPolarity
  * @param  timx Timer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_TIM_CHANNEL_CH1
  *         @arg @ref LL_TIM_CHANNEL_CH2
  *         @arg @ref LL_TIM_CHANNEL_CH3
  *         @arg @ref LL_TIM_CHANNEL_CH4
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_TIM_IC_POLARITY_RISING
  *         @arg @ref LL_TIM_IC_POLARITY_FALLING
  *         @arg @ref LL_TIM_IC_POLARITY_RISING_FALLING
  */
__STATIC_INLINE uint32_t LL_TIM_IC_GetPolarity(const TIM_TypeDef *timx, uint32_t channel)
{
  uint32_t ichannel = LL_TIM_GET_CHANNEL_INDEX(channel);
  return (STM32_READ_BIT(timx->CCER, ((TIM_CCER_CC1NP | TIM_CCER_CC1P) << LL_TIM_SHIFT_TAB_CCxP[ichannel])) >>
          LL_TIM_SHIFT_TAB_CCxP[ichannel]);
}

/**
  * @brief  Set the XOR gate position.
  * @rmtoll
  *  CR2          XORPS          LL_TIM_IC_SetXORGatePosition
  * @param  timx Timer instance
  * @param  xor_position This parameter can be one of the following values:
  *         @arg @ref LL_TIM_IC_XOR_GATE_POS_DIRECT
  *         @arg @ref LL_TIM_IC_XOR_GATE_POS_FILTERED
  * @note Macro IS_TIM_XOR_INSTANCE(TIMx) can be used to check whether or not
  *       a timer instance provides a XOR input.
  * @note Macro IS_TIM_CC3_INSTANCE(TIMx) can be used to check whether or not
  *       a timer instance has at least 3 channels.
  */
__STATIC_INLINE void LL_TIM_IC_SetXORGatePosition(TIM_TypeDef *timx, uint32_t xor_position)
{
  STM32_MODIFY_REG(timx->CR2, TIM_CR2_XORPS, xor_position);
}

/**
  * @brief  Get the XOR gate position.
  * @rmtoll
  *  CR2          XORPS          LL_TIM_IC_SetXORGatePosition
  * @param  timx Timer instance
  * @note Macro IS_TIM_XOR_INSTANCE(TIMx) can be used to check whether or not
  *       a timer instance provides a XOR input.
  * @note Macro IS_TIM_CC3_INSTANCE(TIMx) can be used to check whether or not
  *       a timer instance has at least 3 channels.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_TIM_IC_XOR_GATE_POS_DIRECT
  *         @arg @ref LL_TIM_IC_XOR_GATE_POS_FILTERED
  */
__STATIC_INLINE uint32_t LL_TIM_IC_GetXORGatePosition(TIM_TypeDef *timx)
{
  return (uint32_t)(STM32_READ_BIT(timx->CR2, TIM_CR2_XORPS));
}

/**
  * @brief  Enable the signal inversion of a XOR gate input channel.
  * @rmtoll
  *  CR2         TI1INV          LL_TIM_IC_EnableXORGateInputInversion \n
  *  CR2         TI2INV          LL_TIM_IC_EnableXORGateInputInversion \n
  *  CR2         TI3INV          LL_TIM_IC_EnableXORGateInputInversion
  * @param  timx Timer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_TIM_CHANNEL_CH1
  *         @arg @ref LL_TIM_CHANNEL_CH2
  *         @arg @ref LL_TIM_CHANNEL_CH3
  * @note Macro IS_TIM_XOR_INSTANCE(TIMx) can be used to check whether or not
  *       a timer instance provides a XOR input.
  */
__STATIC_INLINE void LL_TIM_IC_EnableXORGateInputInversion(TIM_TypeDef *timx, uint32_t channel)
{
  uint32_t ichannel_shift = ((uint32_t)(LL_TIM_GET_CHANNEL_INDEX(channel)) >> 1U) % 3U;
  STM32_SET_BIT(timx->CR2, (TIM_CR2_TI1INV << ichannel_shift));
}

/**
  * @brief  Disable the signal inversion of a XOR gate input channel.
  * @rmtoll
  *  CR2         TI1INV          LL_TIM_IC_DisableXORGateInputInversion \n
  *  CR2         TI2INV          LL_TIM_IC_DisableXORGateInputInversion \n
  *  CR2         TI3INV          LL_TIM_IC_DisableXORGateInputInversion
  * @param  timx Timer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_TIM_CHANNEL_CH1
  *         @arg @ref LL_TIM_CHANNEL_CH2
  *         @arg @ref LL_TIM_CHANNEL_CH3
  * @note Macro IS_TIM_XOR_INSTANCE(TIMx) can be used to check whether or not
  *       a timer instance provides a XOR input.
  */
__STATIC_INLINE void LL_TIM_IC_DisableXORGateInputInversion(TIM_TypeDef *timx, uint32_t channel)
{
  uint32_t ichannel_shift = ((uint32_t)(LL_TIM_GET_CHANNEL_INDEX(channel)) >> 1U) % 3U;
  STM32_CLEAR_BIT(timx->CR2, (TIM_CR2_TI1INV << ichannel_shift));
}

/**
  * @brief  Indicates whether the signal inversion of a XOR gate input channel is enabled.
  * @rmtoll
  *  CR2         TI1INV          LL_TIM_IC_IsEnabledXORGateInputInversion \n
  *  CR2         TI2INV          LL_TIM_IC_IsEnabledXORGateInputInversion \n
  *  CR2         TI3INV          LL_TIM_IC_IsEnabledXORGateInputInversion
  * @param  timx Timer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_TIM_CHANNEL_CH1
  *         @arg @ref LL_TIM_CHANNEL_CH2
  *         @arg @ref LL_TIM_CHANNEL_CH3
  * @note Macro IS_TIM_XOR_INSTANCE(TIMx) can be used to check whether or not
  *       a timer instance provides a XOR input.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IC_IsEnabledXORGateInputInversion(const TIM_TypeDef *timx, uint32_t channel)
{
  uint32_t ichannel_shift = ((uint32_t)(LL_TIM_GET_CHANNEL_INDEX(channel)) >> 1U) % 3U;
  uint32_t inv = TIM_CR2_TI1INV << ichannel_shift;
  return ((STM32_READ_BIT(timx->CR2, inv) == inv) ? 1UL : 0UL);
}

/**
  * @brief  Connect the TIMx_CH1, CH2 and CH3 pins to the TI1 input (XOR combination).
  * @rmtoll
  *  CR2          TI1S          LL_TIM_IC_EnableXORCombination
  * @param  timx Timer instance
  * @note Macro IS_TIM_XOR_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides an XOR input.
  */
__STATIC_INLINE void LL_TIM_IC_EnableXORCombination(TIM_TypeDef *timx)
{
  STM32_SET_BIT(timx->CR2, TIM_CR2_TI1S);
}

/**
  * @brief  Disconnect the TIMx_CH1, CH2 and CH3 pins from the TI1 input.
  * @rmtoll
  *  CR2          TI1S          LL_TIM_IC_DisableXORCombination
  * @param  timx Timer instance
  * @note Macro IS_TIM_XOR_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides an XOR input.
  */
__STATIC_INLINE void LL_TIM_IC_DisableXORCombination(TIM_TypeDef *timx)
{
  STM32_CLEAR_BIT(timx->CR2, TIM_CR2_TI1S);
}

/**
  * @brief  Indicates whether the TIMx_CH1, CH2 and CH3 pins are connectected to the TI1 input.
  * @rmtoll
  *  CR2          TI1S          LL_TIM_IC_IsEnabledXORCombination
  * @param  timx Timer instance
  * @note Macro IS_TIM_XOR_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides an XOR input.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IC_IsEnabledXORCombination(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->CR2, TIM_CR2_TI1S) == (TIM_CR2_TI1S)) ? 1UL : 0UL);
}

/**
  * @brief  Get captured value for input channel 1.
  * @rmtoll
  *  CCR1         CCR1          LL_TIM_IC_GetCaptureCH1
  * @param  timx Timer instance
  * @note In 32-bit timer implementations returned captured value can be between 0x00000000 and 0xFFFFFFFF.
  * @note Macro IS_TIM_32B_COUNTER_INSTANCE(timx) can be used to check
  *       whether or not a timer instance supports a 32-bit counter.
  * @note Macro IS_TIM_CC1_INSTANCE(timx) can be used to check whether or not
  *       input channel 1 is supported by a timer instance.
  * @note If dithering is activated, pay attention to the returned value interpretation.
  * @retval CapturedValue (between Min_Data=0 and Max_Data=65535)
  */
__STATIC_INLINE uint32_t LL_TIM_IC_GetCaptureCH1(const TIM_TypeDef *timx)
{
  return (uint32_t)(STM32_READ_REG(timx->CCR1));
}

/**
  * @brief  Get captured value for input channel 2.
  * @rmtoll
  *  CCR2         CCR2          LL_TIM_IC_GetCaptureCH2
  * @param  timx Timer instance
  * @note In 32-bit timer implementations returned captured value can be between 0x00000000 and 0xFFFFFFFF.
  * @note Macro IS_TIM_32B_COUNTER_INSTANCE(timx) can be used to check
  *       whether or not a timer instance supports a 32-bit counter.
  * @note Macro IS_TIM_CC2_INSTANCE(timx) can be used to check whether or not
  *       input channel 2 is supported by a timer instance.
  * @note If dithering is activated, pay attention to the returned value interpretation.
  * @retval CapturedValue (between Min_Data=0 and Max_Data=65535)
  */
__STATIC_INLINE uint32_t LL_TIM_IC_GetCaptureCH2(const TIM_TypeDef *timx)
{
  return (uint32_t)(STM32_READ_REG(timx->CCR2));
}

/**
  * @brief  Get captured value for input channel 3.
  * @rmtoll
  *  CCR3         CCR3          LL_TIM_IC_GetCaptureCH3
  * @param  timx Timer instance
  * @note In 32-bit timer implementations returned captured value can be between 0x00000000 and 0xFFFFFFFF.
  * @note Macro IS_TIM_32B_COUNTER_INSTANCE(timx) can be used to check
  *       whether or not a timer instance supports a 32-bit counter.
  * @note Macro IS_TIM_CC3_INSTANCE(timx) can be used to check whether or not
  *       input channel 3 is supported by a timer instance.
  * @note If dithering is activated, pay attention to the returned value interpretation.
  * @retval CapturedValue (between Min_Data=0 and Max_Data=65535)
  */
__STATIC_INLINE uint32_t LL_TIM_IC_GetCaptureCH3(const TIM_TypeDef *timx)
{
  return (uint32_t)(STM32_READ_REG(timx->CCR3));
}

/**
  * @brief  Get captured value for input channel 4.
  * @rmtoll
  *  CCR4         CCR4          LL_TIM_IC_GetCaptureCH4
  * @param  timx Timer instance
  * @note In 32-bit timer implementations returned captured value can be between 0x00000000 and 0xFFFFFFFF.
  * @note Macro IS_TIM_32B_COUNTER_INSTANCE(timx) can be used to check
  *       whether or not a timer instance supports a 32-bit counter.
  * @note Macro IS_TIM_CC4_INSTANCE(timx) can be used to check whether or not
  *       input channel 4 is supported by a timer instance.
  * @note If dithering is activated, pay attention to the returned value interpretation.
  * @retval CapturedValue (between Min_Data=0 and Max_Data=65535)
  */
__STATIC_INLINE uint32_t LL_TIM_IC_GetCaptureCH4(const TIM_TypeDef *timx)
{
  return (uint32_t)(STM32_READ_REG(timx->CCR4));
}

/**
  * @brief  Get captured value for the selected capture unit.
  * @rmtoll
  *  CCR1         CCR1          LL_TIM_IC_GetCapturedValue \n
  *  CCR2         CCR2          LL_TIM_IC_GetCapturedValue \n
  *  CCR3         CCR3          LL_TIM_IC_GetCapturedValue \n
  *  CCR4         CCR4          LL_TIM_IC_GetCapturedValue
  * @param  timx Timer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_TIM_CHANNEL_CH1
  *         @arg @ref LL_TIM_CHANNEL_CH2
  *         @arg @ref LL_TIM_CHANNEL_CH3
  *         @arg @ref LL_TIM_CHANNEL_CH4
  * @note In 32-bit timer implementations returned captured value can be between 0x00000000 and 0xFFFFFFFF.
  * @note Macro IS_TIM_32B_COUNTER_INSTANCE(timx) can be used to check
  *       whether or not a timer instance supports a 32-bit counter.
  * @note If dithering is activated, pay attention to the returned value interpretation.
  * @retval CapturedValue (between Min_Data=0 and Max_Data=65535)
  */
__STATIC_INLINE uint32_t LL_TIM_IC_GetCapturedValue(const TIM_TypeDef *timx, uint32_t channel)
{
  uint32_t ichannel = LL_TIM_GET_CHANNEL_INDEX(channel);
  ichannel >>= 1U; /* Divide by 2 to comply with LL_TIM_OFFSET_TAB_CCRx indexes */
  const __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&timx->CCR1) + \
                                                           LL_TIM_OFFSET_TAB_CCRx[ichannel]));
  return (uint32_t)(STM32_READ_REG(*pReg));
}

/**
  * @brief  Indicate the level of input signals (after the digital filtering stage), for polling purposes.
  * @rmtoll
  *  SR           TI1FS         LL_TIM_IC_GetInputStatus \n
  *  SR           TI2FS         LL_TIM_IC_GetInputStatus \n
  *  SR           TI3FS         LL_TIM_IC_GetInputStatus \n
  *  SR           TI4FS         LL_TIM_IC_GetInputStatus
  * @param  timx Timer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_TIM_CHANNEL_CH1
  *         @arg @ref LL_TIM_CHANNEL_CH2
  *         @arg @ref LL_TIM_CHANNEL_CH3
  *         @arg @ref LL_TIM_CHANNEL_CH4
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_TIM_IC_SIGNAL_LOW
  *         @arg @ref LL_TIM_IC_SIGNAL_HIGH
  */
__STATIC_INLINE uint32_t LL_TIM_IC_GetInputStatus(TIM_TypeDef *timx, uint32_t channel)
{
  uint32_t ichannel_shift = ((uint32_t)(LL_TIM_GET_CHANNEL_INDEX(channel)) >> 1U) & 0x3U;
  uint32_t status_shifted = TIM_SR_TI1FS << ichannel_shift;
  return ((STM32_READ_BIT(timx->SR, status_shifted) == status_shifted) ? LL_TIM_IC_SIGNAL_HIGH : LL_TIM_IC_SIGNAL_LOW);
}
/**
  * @}
  */

/** @defgroup TIM_LL_EF_Clock_Selection Counter clock selection
  * @{
  */
/**
  * @brief  Enable external clock mode 2.
  * @rmtoll
  *  SMCR         ECE           LL_TIM_EnableExternalClock
  * @param  timx Timer instance
  * @note When external clock mode 2 is enabled the counter is clocked by any active edge on the ETRF signal.
  * @note Macro IS_TIM_CLOCKSOURCE_ETRMODE2_INSTANCE(timx) can be used to check
  *       whether or not a timer instance supports external clock mode2.
  */
__STATIC_INLINE void LL_TIM_EnableExternalClock(TIM_TypeDef *timx)
{
  STM32_SET_BIT(timx->SMCR, TIM_SMCR_ECE);
}

/**
  * @brief  Disable external clock mode 2.
  * @rmtoll
  *  SMCR         ECE           LL_TIM_DisableExternalClock
  * @param  timx Timer instance
  * @note Macro IS_TIM_CLOCKSOURCE_ETRMODE2_INSTANCE(timx) can be used to check
  *       whether or not a timer instance supports external clock mode2.
  */
__STATIC_INLINE void LL_TIM_DisableExternalClock(TIM_TypeDef *timx)
{
  STM32_CLEAR_BIT(timx->SMCR, TIM_SMCR_ECE);
}

/**
  * @brief  Indicate whether external clock mode 2 is enabled.
  * @rmtoll
  *  SMCR         ECE           LL_TIM_IsEnabledExternalClock
  * @param  timx Timer instance
  * @note Macro IS_TIM_CLOCKSOURCE_ETRMODE2_INSTANCE(timx) can be used to check
  *       whether or not a timer instance supports external clock mode2.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsEnabledExternalClock(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->SMCR, TIM_SMCR_ECE) == (TIM_SMCR_ECE)) ? 1UL : 0UL);
}

/**
  * @brief  Set the clock source of the counter clock.
  * @rmtoll
  *  SMCR         SMS           LL_TIM_SetClockSource \n
  *  SMCR         ECE           LL_TIM_SetClockSource
  * @param  timx Timer instance
  * @param  clock_source This parameter can be one of the following values:
  *         @arg @ref LL_TIM_CLK_INTERNAL
  *         @arg @ref LL_TIM_CLK_EXTERNAL_MODE1
  *         @arg @ref LL_TIM_CLK_EXTERNAL_MODE2
  *         @arg @ref LL_TIM_CLK_ENCODER_X1_TI1
  *         @arg @ref LL_TIM_CLK_ENCODER_X1_TI2
  *         @arg @ref LL_TIM_CLK_ENCODER_X2_TI1
  *         @arg @ref LL_TIM_CLK_ENCODER_X2_TI2
  *         @arg @ref LL_TIM_CLK_ENCODER_X4_TI12
  *         @arg @ref LL_TIM_CLK_ENCODER_DEBOUNCER_X2_TI1
  *         @arg @ref LL_TIM_CLK_ENCODER_DEBOUNCER_X4_TI12
  *         @arg @ref LL_TIM_CLK_ENCODER_CLK_PLUS_X2
  *         @arg @ref LL_TIM_CLK_ENCODER_CLK_PLUS_X1
  *         @arg @ref LL_TIM_CLK_ENCODER_DIR_CLK_X2
  *         @arg @ref LL_TIM_CLK_ENCODER_DIR_CLK_X1_TI12
  * @note when selected clock source is external clock mode 1, the timer input
  *       the external clock is applied is selected by calling the @ref LL_TIM_SetTriggerInput()
  *       function. This timer input must be configured by calling
  *       the @ref LL_TIM_IC_Config() function.
  * @note Macro IS_TIM_SLAVE_INSTANCE(timx) can be used to check
  *       whether or not a timer instance supports external clock mode1.
  * @note Macro IS_TIM_ETR_INSTANCE(timx) can be used to check
  *       whether or not a timer instance supports external clock mode2.
  * @note Macro IS_TIM_ENCODER_INTERFACE_INSTANCE(timx) can be used to check
  *       whether or not a timer instance supports the encoder mode.
  */
__STATIC_INLINE void LL_TIM_SetClockSource(TIM_TypeDef *timx, uint32_t clock_source)
{
  STM32_MODIFY_REG(timx->SMCR, TIM_SMCR_SMS | TIM_SMCR_ECE, clock_source);
}

/**
  * @brief  Get the clock source of the counter clock.
  * @rmtoll
  *  SMCR         SMS           LL_TIM_GetClockSource \n
  *  SMCR         ECE           LL_TIM_GetClockSource
  * @param  timx Timer instance
  * @note If external clock mode 1 and external clock mode 2 are enabled
  *       at the same time, the external clock input is tim_etrf.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_TIM_CLK_INTERNAL
  *         @arg @ref LL_TIM_CLK_EXTERNAL_MODE1
  *         @arg @ref LL_TIM_CLK_EXTERNAL_MODE2
  *         @arg @ref LL_TIM_CLK_ENCODER_X1_TI1
  *         @arg @ref LL_TIM_CLK_ENCODER_X1_TI2
  *         @arg @ref LL_TIM_CLK_ENCODER_X2_TI1
  *         @arg @ref LL_TIM_CLK_ENCODER_X2_TI2
  *         @arg @ref LL_TIM_CLK_ENCODER_X4_TI12
  *         @arg @ref LL_TIM_CLK_ENCODER_DEBOUNCER_X2_TI1
  *         @arg @ref LL_TIM_CLK_ENCODER_DEBOUNCER_X4_TI12
  *         @arg @ref LL_TIM_CLK_ENCODER_CLK_PLUS_X2
  *         @arg @ref LL_TIM_CLK_ENCODER_CLK_PLUS_X1
  *         @arg @ref LL_TIM_CLK_ENCODER_DIR_CLK_X2
  *         @arg @ref LL_TIM_CLK_ENCODER_DIR_CLK_X1_TI12
  */
__STATIC_INLINE uint32_t LL_TIM_GetClockSource(const TIM_TypeDef *timx)
{
  uint32_t smcr = STM32_READ_REG(timx->SMCR);

  return (uint32_t)(((smcr & TIM_SMCR_ECE) == LL_TIM_CLK_EXTERNAL_MODE2) ? \
                    LL_TIM_CLK_EXTERNAL_MODE2 : (smcr & TIM_SMCR_SMS));
}
/**
  * @}
  */

