MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_tim.h
/** @defgroup TIM_LL_EF_Timer_Synchronization Timer synchronisation configuration
  * @{
  */
/**
  * @brief  Set the trigger output (TRGO) used for timer synchronization.
  * @rmtoll
  *  CR2          MMS           LL_TIM_SetTriggerOutput
  * @param  timx Timer instance
  * @param  timer_synchronization This parameter can be one of the following values:
  *         @arg @ref LL_TIM_TRGO_RESET
  *         @arg @ref LL_TIM_TRGO_ENABLE
  *         @arg @ref LL_TIM_TRGO_UPDATE
  *         @arg @ref LL_TIM_TRGO_CC1IF
  *         @arg @ref LL_TIM_TRGO_OC1
  *         @arg @ref LL_TIM_TRGO_OC2
  *         @arg @ref LL_TIM_TRGO_OC3
  *         @arg @ref LL_TIM_TRGO_OC4
  *         @arg @ref LL_TIM_TRGO_ENCODER_CLK
  * @note Macro IS_TIM_MASTER_INSTANCE(timx) can be used to check
  *       whether or not a timer instance can operate as a master timer.
  */
__STATIC_INLINE void LL_TIM_SetTriggerOutput(TIM_TypeDef *timx, uint32_t timer_synchronization)
{
  STM32_MODIFY_REG(timx->CR2, TIM_CR2_MMS, timer_synchronization);
}

/**
  * @brief  Get the source of the trigger output (TRGO).
  * @rmtoll
  *  CR2          MMS           LL_TIM_GetTriggerOutput
  * @param  timx Timer instance
  * @note Macro IS_TIM_MASTER_INSTANCE(timx) can be used to check
  *       whether or not a timer instance can operate as a master timer.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_TIM_TRGO_RESET
  *         @arg @ref LL_TIM_TRGO_ENABLE
  *         @arg @ref LL_TIM_TRGO_UPDATE
  *         @arg @ref LL_TIM_TRGO_CC1IF
  *         @arg @ref LL_TIM_TRGO_OC1
  *         @arg @ref LL_TIM_TRGO_OC2
  *         @arg @ref LL_TIM_TRGO_OC3
  *         @arg @ref LL_TIM_TRGO_OC4
  *         @arg @ref LL_TIM_TRGO_ENCODER_CLK
  */
__STATIC_INLINE uint32_t LL_TIM_GetTriggerOutput(const TIM_TypeDef *timx)
{
  return (uint32_t)(STM32_READ_REG(timx->CR2) & TIM_CR2_MMS);
}

/**
  * @brief  Set the trigger output 2 (TRGO2) used for ADC synchronization .
  * @rmtoll
  *  CR2          MMS2          LL_TIM_SetTriggerOutput2
  * @param  timx Timer Instance
  * @param  adc_synchronization This parameter can be one of the following values:
  *         @arg @ref LL_TIM_TRGO2_RESET
  *         @arg @ref LL_TIM_TRGO2_ENABLE
  *         @arg @ref LL_TIM_TRGO2_UPDATE
  *         @arg @ref LL_TIM_TRGO2_CC1F
  *         @arg @ref LL_TIM_TRGO2_OC1
  *         @arg @ref LL_TIM_TRGO2_OC2
  *         @arg @ref LL_TIM_TRGO2_OC3
  *         @arg @ref LL_TIM_TRGO2_OC4
  *         @arg @ref LL_TIM_TRGO2_OC5
  *         @arg @ref LL_TIM_TRGO2_OC6
  *         @arg @ref LL_TIM_TRGO2_OC7
  *         @arg @ref LL_TIM_TRGO2_OC4_RISING_FALLING
  *         @arg @ref LL_TIM_TRGO2_OC6_RISING_FALLING
  *         @arg @ref LL_TIM_TRGO2_OC7_RISING_FALLING
  *         @arg @ref LL_TIM_TRGO2_OC4_RISING_OC6_RISING
  *         @arg @ref LL_TIM_TRGO2_OC4_RISING_OC7_RISING
  *         @arg @ref LL_TIM_TRGO2_OC5_RISING_OC6_RISING
  *         @arg @ref LL_TIM_TRGO2_OC5_RISING_OC7_RISING
  *         @arg @ref LL_TIM_TRGO2_OC6_RISING_OC7_RISING
  *         @arg @ref LL_TIM_TRGO2_OC4_RISING_OC6_FALLING
  *         @arg @ref LL_TIM_TRGO2_OC4_RISING_OC7_FALLING
  *         @arg @ref LL_TIM_TRGO2_OC5_RISING_OC6_FALLING
  *         @arg @ref LL_TIM_TRGO2_OC5_RISING_OC7_FALLING
  *         @arg @ref LL_TIM_TRGO2_OC6_RISING_OC7_FALLING
  * @note Macro IS_TIM_TRGO2_INSTANCE(timx) can be used to check
  *       whether or not a timer instance can be used for ADC synchronization.
  */
__STATIC_INLINE void LL_TIM_SetTriggerOutput2(TIM_TypeDef *timx, uint32_t adc_synchronization)
{
  STM32_MODIFY_REG(timx->CR2, TIM_CR2_MMS2, adc_synchronization);
}

/**
  * @brief  Get the source of the trigger output 2 (TRGO2).
  * @rmtoll
  *  CR2          MMS2          LL_TIM_GetTriggerOutput2
  * @param  timx Timer Instance
  * @note Macro IS_TIM_TRGO2_INSTANCE(timx) can be used to check
  *       whether or not a timer instance can be used for ADC synchronization.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_TIM_TRGO2_RESET
  *         @arg @ref LL_TIM_TRGO2_ENABLE
  *         @arg @ref LL_TIM_TRGO2_UPDATE
  *         @arg @ref LL_TIM_TRGO2_CC1F
  *         @arg @ref LL_TIM_TRGO2_OC1
  *         @arg @ref LL_TIM_TRGO2_OC2
  *         @arg @ref LL_TIM_TRGO2_OC3
  *         @arg @ref LL_TIM_TRGO2_OC4
  *         @arg @ref LL_TIM_TRGO2_OC5
  *         @arg @ref LL_TIM_TRGO2_OC6
  *         @arg @ref LL_TIM_TRGO2_OC7
  *         @arg @ref LL_TIM_TRGO2_OC4_RISING_FALLING
  *         @arg @ref LL_TIM_TRGO2_OC6_RISING_FALLING
  *         @arg @ref LL_TIM_TRGO2_OC7_RISING_FALLING
  *         @arg @ref LL_TIM_TRGO2_OC4_RISING_OC6_RISING
  *         @arg @ref LL_TIM_TRGO2_OC4_RISING_OC7_RISING
  *         @arg @ref LL_TIM_TRGO2_OC5_RISING_OC6_RISING
  *         @arg @ref LL_TIM_TRGO2_OC5_RISING_OC7_RISING
  *         @arg @ref LL_TIM_TRGO2_OC6_RISING_OC7_RISING
  *         @arg @ref LL_TIM_TRGO2_OC4_RISING_OC6_FALLING
  *         @arg @ref LL_TIM_TRGO2_OC4_RISING_OC7_FALLING
  *         @arg @ref LL_TIM_TRGO2_OC5_RISING_OC6_FALLING
  *         @arg @ref LL_TIM_TRGO2_OC5_RISING_OC7_FALLING
  *         @arg @ref LL_TIM_TRGO2_OC6_RISING_OC7_FALLING
  */
__STATIC_INLINE uint32_t LL_TIM_GetTriggerOutput2(const TIM_TypeDef *timx)
{
  return (uint32_t)(STM32_READ_REG(timx->CR2) & TIM_CR2_MMS2);
}

/**
  * @brief  Set the trigger output 2 (TRGO2) post-scaler value.
  * @rmtoll
  *  CR1          TGO2PSC        LL_TIM_SetTriggerOutput2Postscaler
  * @param  timx Timer instance
  * @param  postscaler (between Min_Data=0 and Max_Data=31)
  * @note The TRGO2 clock frequency tgo2_cktim is equal to tim_ocxrefc / (TGO2PSC[4:0] + 1).
  * @note The post-scaler can be changed on the fly as this control register is buffered.
  *       The new post-scaler ratio is taken into account at the next update event.
  */
__STATIC_INLINE void LL_TIM_SetTriggerOutput2Postscaler(TIM_TypeDef *timx, uint32_t postscaler)
{
  STM32_MODIFY_REG(timx->CR1, TIM_CR1_TGO2PSC, postscaler << TIM_CR1_TGO2PSC_Pos);
}

/**
  * @brief  Get the trigger output 2 (TRGO2) post-scaler value.
  * @rmtoll
  *  CR1          TGO2PSC        LL_TIM_GetTriggerOutput2Postscaler
  * @param  timx Timer instance
  * @retval postscaler (between Min_Data=0 and Max_Data=31)
  */
__STATIC_INLINE uint32_t LL_TIM_GetTriggerOutput2Postscaler(const TIM_TypeDef *timx)
{
  return (uint32_t)((STM32_READ_REG(timx->CR1) & TIM_CR1_TGO2PSC) >> TIM_CR1_TGO2PSC_Pos);
}

/**
  * @brief  Set the synchronization mode of a slave timer.
  * @rmtoll
  *  SMCR         SMS           LL_TIM_SetSlaveMode
  * @param  timx Timer instance
  * @param  slave_mode This parameter can be one of the following values:
  *         @arg @ref LL_TIM_SLAVEMODE_DISABLED
  *         @arg @ref LL_TIM_SLAVEMODE_RESET
  *         @arg @ref LL_TIM_SLAVEMODE_GATED
  *         @arg @ref LL_TIM_SLAVEMODE_TRIGGER
  *         @arg @ref LL_TIM_SLAVEMODE_COMBINED_RESET_TRIGGER
  *         @arg @ref LL_TIM_SLAVEMODE_COMBINED_GATED_RESET
  * @note Macro IS_TIM_SLAVE_INSTANCE(timx) can be used to check whether or not
  *       a timer instance can operate as a slave timer.
  */
__STATIC_INLINE void LL_TIM_SetSlaveMode(TIM_TypeDef *timx, uint32_t slave_mode)
{
  STM32_MODIFY_REG(timx->SMCR, TIM_SMCR_SMS, slave_mode);
}

/**
  * @brief  Get the synchronization mode of a slave timer.
  * @rmtoll
  *  SMCR         SMS           LL_TIM_GetSlaveMode
  * @param  timx Timer instance
  * @note Macro IS_TIM_SLAVE_INSTANCE(timx) can be used to check whether or not
  *       a timer instance can operate as a slave timer.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_TIM_SLAVEMODE_DISABLED
  *         @arg @ref LL_TIM_SLAVEMODE_RESET
  *         @arg @ref LL_TIM_SLAVEMODE_GATED
  *         @arg @ref LL_TIM_SLAVEMODE_TRIGGER
  *         @arg @ref LL_TIM_SLAVEMODE_COMBINED_RESET_TRIGGER
  *         @arg @ref LL_TIM_SLAVEMODE_COMBINED_GATED_RESET
  */
__STATIC_INLINE uint32_t LL_TIM_GetSlaveMode(const TIM_TypeDef *timx)
{
  return (uint32_t)(STM32_READ_REG(timx->SMCR) & TIM_SMCR_SMS);
}

/**
  * @brief  Set the selects the trigger input to be used to synchronize the counter.
  * @rmtoll
  *  SMCR         TS            LL_TIM_SetTriggerInput
  * @param  timx Timer instance
  * @param  trigger_input This parameter can be one of the following values:
  *         LL_TIM_TS_ITR0
  *         LL_TIM_TS_ITR1
  *         LL_TIM_TS_ITR2
  * @if TIM3
  *         LL_TIM_TS_ITR3
  * @endif
  * @if TIM4
  *         LL_TIM_TS_ITR4
  * @endif
  * @if TIM5
  *         LL_TIM_TS_ITR5
  * @endif
  *         LL_TIM_TS_ITR6
  *         LL_TIM_TS_ITR7
  *         LL_TIM_TS_ITR8
  *         LL_TIM_TS_ITR9
  * @if TIM16
  *         LL_TIM_TS_ITR10
  * @endif
  * @if TIM17
  *         LL_TIM_TS_ITR11
  * @endif
  * #if TIM20
  *         LL_TIM_TS_ITR12
  *         LL_TIM_TS_ITR13
  * @endif
  *         LL_TIM_TS_TI1F_ED
  *         LL_TIM_TS_TI1FP1
  *         LL_TIM_TS_TI2FP2
  *         LL_TIM_TS_ETRF
  * @note Macro IS_TIM_SLAVE_INSTANCE(timx) can be used to check whether or not
  *       a timer instance can operate as a slave timer.
  */
__STATIC_INLINE void LL_TIM_SetTriggerInput(TIM_TypeDef *timx, uint32_t trigger_input)
{
  STM32_MODIFY_REG(timx->SMCR, TIM_SMCR_TS, trigger_input);
}

/**
  * @brief  Get the trigger input used to synchronize the counter.
  * @rmtoll
  *  SMCR         TS            LL_TIM_GetTriggerInput
  * @param  timx Timer instance
  * @note Macro IS_TIM_SLAVE_INSTANCE(timx) can be used to check whether or not
  *       a timer instance can operate as a slave timer.
  * @retval Returned value can be one of the following values:
  *         LL_TIM_TS_ITR0
  *         LL_TIM_TS_ITR1
  *         LL_TIM_TS_ITR2
  * @if TIM3
  *         LL_TIM_TS_ITR3
  * @endif
  * @if TIM4
  *         LL_TIM_TS_ITR4
  * @endif
  * @if TIM5
  *         LL_TIM_TS_ITR5
  * @endif
  *         LL_TIM_TS_ITR6
  *         LL_TIM_TS_ITR7
  *         LL_TIM_TS_ITR8
  *         LL_TIM_TS_ITR9
  * @if TIM16
  *         LL_TIM_TS_ITR10
  * @endif
  * @if TIM17
  *         LL_TIM_TS_ITR11
  * @endif
  * #if TIM20
  *         LL_TIM_TS_ITR12
  *         LL_TIM_TS_ITR13
  * @endif
  *         LL_TIM_TS_TI1F_ED
  *         LL_TIM_TS_TI1FP1
  *         LL_TIM_TS_TI2FP2
  *         LL_TIM_TS_ETRF
  */
__STATIC_INLINE uint32_t LL_TIM_GetTriggerInput(const TIM_TypeDef *timx)
{
  return (uint32_t)(STM32_READ_REG(timx->SMCR) & TIM_SMCR_TS);
}

/**
  * @brief  Enable the Master/Slave mode.
  * @rmtoll
  *  SMCR         MSM           LL_TIM_EnableMasterSlaveMode
  * @param  timx Timer instance
  * @note Macro IS_TIM_SLAVE_INSTANCE(timx) can be used to check whether or not
  *       a timer instance can operate as a slave timer.
  */
__STATIC_INLINE void LL_TIM_EnableMasterSlaveMode(TIM_TypeDef *timx)
{
  STM32_SET_BIT(timx->SMCR, TIM_SMCR_MSM);
}

/**
  * @brief  Disable the Master/Slave mode.
  * @rmtoll
  *  SMCR         MSM           LL_TIM_DisableMasterSlaveMode
  * @param  timx Timer instance
  * @note Macro IS_TIM_SLAVE_INSTANCE(timx) can be used to check whether or not
  *       a timer instance can operate as a slave timer.
  */
__STATIC_INLINE void LL_TIM_DisableMasterSlaveMode(TIM_TypeDef *timx)
{
  STM32_CLEAR_BIT(timx->SMCR, TIM_SMCR_MSM);
}

/**
  * @brief Indicates whether the Master/Slave mode is enabled.
  * @rmtoll
  *  SMCR         MSM           LL_TIM_IsEnabledMasterSlaveMode
  * @param  timx Timer instance
  * @note Macro IS_TIM_SLAVE_INSTANCE(timx) can be used to check whether or not
  *       a timer instance can operate as a slave timer.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsEnabledMasterSlaveMode(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->SMCR, TIM_SMCR_MSM) == (TIM_SMCR_MSM)) ? 1UL : 0UL);
}

/**
  * @brief  Configure the external trigger (ETR) input.
  * @rmtoll
  *  SMCR         ETP           LL_TIM_ConfigETR \n
  *  SMCR         ETPS          LL_TIM_ConfigETR \n
  *  SMCR         SETPS         LL_TIM_ConfigETR \n
  *  SMCR         ETF           LL_TIM_ConfigETR
  * @param  timx Timer instance
  * @param  etr_polarity This parameter can be one of the following values: \n
  *         @arg @ref LL_TIM_ETR_POLARITY_NONINVERTED
  *         @arg @ref LL_TIM_ETR_POLARITY_INVERTED
  * @param  etr_prescaler This parameter must be a combination of the following values: \n
  *         @arg @ref LL_TIM_ETR_PRESCALER_DIV1 or ... or @ref LL_TIM_ETR_PRESCALER_DIV8
  *         @arg @ref LL_TIM_ETR_SYNC_PRESCALER_DIV1 or ... or @ref LL_TIM_ETR_SYNC_PRESCALER_DIV16
  * @param  etr_filter This parameter can be one of the following values: \n
  *         @arg @ref LL_TIM_ETR_FILTER_FDIV1
  *         @arg @ref LL_TIM_ETR_FILTER_FDIV1_N2
  *         @arg @ref LL_TIM_ETR_FILTER_FDIV1_N4
  *         @arg @ref LL_TIM_ETR_FILTER_FDIV1_N8
  *         @arg @ref LL_TIM_ETR_FILTER_FDIV2_N6
  *         @arg @ref LL_TIM_ETR_FILTER_FDIV2_N8
  *         @arg @ref LL_TIM_ETR_FILTER_FDIV4_N6
  *         @arg @ref LL_TIM_ETR_FILTER_FDIV4_N8
  *         @arg @ref LL_TIM_ETR_FILTER_FDIV8_N6
  *         @arg @ref LL_TIM_ETR_FILTER_FDIV8_N8
  *         @arg @ref LL_TIM_ETR_FILTER_FDIV16_N5
  *         @arg @ref LL_TIM_ETR_FILTER_FDIV16_N6
  *         @arg @ref LL_TIM_ETR_FILTER_FDIV16_N8
  *         @arg @ref LL_TIM_ETR_FILTER_FDIV32_N5
  *         @arg @ref LL_TIM_ETR_FILTER_FDIV32_N6
  *         @arg @ref LL_TIM_ETR_FILTER_FDIV32_N8
  * @note Macro IS_TIM_ETR_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides an external trigger input.
  */
__STATIC_INLINE void LL_TIM_ConfigETR(TIM_TypeDef *timx, uint32_t etr_polarity, uint32_t etr_prescaler,
                                      uint32_t etr_filter)
{
  STM32_MODIFY_REG(timx->SMCR, TIM_SMCR_ETP | TIM_SMCR_ETPS | TIM_SMCR_SETPS | TIM_SMCR_ETF,
                   etr_polarity | etr_prescaler | etr_filter);
}

/**
  * @brief  Get the external trigger (ETR) input configuration.
  * @rmtoll
  *  SMCR         ETP           LL_TIM_GetConfigETR \n
  *  SMCR         ETPS          LL_TIM_GetConfigETR \n
  *  SMCR         SETPS         LL_TIM_GetConfigETR \n
  *  SMCR         ETF           LL_TIM_GetConfigETR
  * @param  timx Timer instance
  * @param  p_etr_polarity Pointer to a storage for ETR polarity. \n
  *         The value can be one of the following values: \n
  *         @arg @ref LL_TIM_ETR_POLARITY_NONINVERTED
  *         @arg @ref LL_TIM_ETR_POLARITY_INVERTED
  * @param  p_etr_prescaler Pointer to a storage for ETR prescalers (asynchronous & synchronous). \n
  *         The value can be a combination of the following values: \n
  *         @arg @ref LL_TIM_ETR_PRESCALER_DIV1 or ... or @ref LL_TIM_ETR_PRESCALER_DIV8
  *         @arg @ref LL_TIM_ETR_SYNC_PRESCALER_DIV1 or ... or @ref LL_TIM_ETR_SYNC_PRESCALER_DIV16
  * @param  p_etr_filter Pointer to a storage for ETR filter. \n
  *         The value can be one of the following values: \n
  *         @arg @ref LL_TIM_ETR_FILTER_FDIV1
  *         @arg @ref LL_TIM_ETR_FILTER_FDIV1_N2
  *         @arg @ref LL_TIM_ETR_FILTER_FDIV1_N4
  *         @arg @ref LL_TIM_ETR_FILTER_FDIV1_N8
  *         @arg @ref LL_TIM_ETR_FILTER_FDIV2_N6
  *         @arg @ref LL_TIM_ETR_FILTER_FDIV2_N8
  *         @arg @ref LL_TIM_ETR_FILTER_FDIV4_N6
  *         @arg @ref LL_TIM_ETR_FILTER_FDIV4_N8
  *         @arg @ref LL_TIM_ETR_FILTER_FDIV8_N6
  *         @arg @ref LL_TIM_ETR_FILTER_FDIV8_N8
  *         @arg @ref LL_TIM_ETR_FILTER_FDIV16_N5
  *         @arg @ref LL_TIM_ETR_FILTER_FDIV16_N6
  *         @arg @ref LL_TIM_ETR_FILTER_FDIV16_N8
  *         @arg @ref LL_TIM_ETR_FILTER_FDIV32_N5
  *         @arg @ref LL_TIM_ETR_FILTER_FDIV32_N6
  *         @arg @ref LL_TIM_ETR_FILTER_FDIV32_N8
  * @note Macro IS_TIM_ETR_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides an external trigger input.
  */
__STATIC_INLINE void LL_TIM_GetConfigETR(TIM_TypeDef *timx, uint32_t *p_etr_polarity, uint32_t *p_etr_prescaler,
                                         uint32_t *p_etr_filter)
{
  const __IO uint32_t smcr = STM32_READ_REG(timx->SMCR);

  *p_etr_polarity = smcr & TIM_SMCR_ETP;
  *p_etr_prescaler = smcr & (TIM_SMCR_ETPS | TIM_SMCR_SETPS);
  *p_etr_filter = smcr & TIM_SMCR_ETF;
}

