MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_tim.h
/**
  * @brief  Select the external trigger (ETR) input source.
  * @rmtoll
  *  AF1          ETRSEL        LL_TIM_SetETRSource
  * @param  timx Timer instance
  * @param  etr_source This parameter can be one of the following values:
  *
  *         TIM1: one of the following values:
  *            LL_TIM_TIM1_ETR_IN_GPIO:              tim1_etr_in is connected to TIM1_ETR
  *            LL_TIM_TIM1_ETR_IN_COMP1_OUT:         tim1_etr_in is connected to comp1_out
  *            LL_TIM_TIM1_ETR_IN_COMP2_OUT:         tim1_etr_in is connected to comp2_out (*)
  *            LL_TIM_TIM1_ETR_IN_ADC1_AWD1:         tim1_etr_in is connected to adc1_awd1
  *            LL_TIM_TIM1_ETR_IN_ADC1_AWD2:         tim1_etr_in is connected to adc1_awd2
  *            LL_TIM_TIM1_ETR_IN_ADC1_AWD3:         tim1_etr_in is connected to adc1_awd3
  *            LL_TIM_TIM1_ETR_IN_COMP3_OUT:         tim1_etr_in is connected to comp3_out (*)
  *            LL_TIM_TIM1_ETR_IN_COMP4_OUT:         tim1_etr_in is connected to comp4_out (*)
  *            LL_TIM_TIM1_ETR_IN_PLAY1_OUT6:        tim1_etr_in is connected to play1_out6 (*)
  *            LL_TIM_TIM1_ETR_IN_PLAY1_OUT8:        tim1_etr_in is connected to play1_out8 (*)
  *
  *         TIM2: one of the following values:
  *            LL_TIM_TIM2_ETR_IN_GPIO:              tim2_etr_in is connected to TIM2_ETR
  *            LL_TIM_TIM2_ETR_IN_COMP1_OUT:         tim2_etr_in is connected to comp1_out
  *            LL_TIM_TIM2_ETR_IN_COMP2_OUT:         tim2_etr_in is connected to comp2_out (*)
  *            LL_TIM_TIM2_ETR_IN_ADC1_AWD1:         tim2_etr_in is connected to adc1_awd1
  *            LL_TIM_TIM2_ETR_IN_ADC1_AWD2:         tim2_etr_in is connected to adc1_awd2
  *            LL_TIM_TIM2_ETR_IN_ADC1_AWD3:         tim2_etr_in is connected to adc1_awd3
  *            LL_TIM_TIM2_ETR_IN_LSE:               tim2_etr_in is connected to LSE
  *            LL_TIM_TIM2_ETR_IN_MCO1:              tim2_etr_in is connected to MCO1
  *            LL_TIM_TIM2_ETR_IN_TIM3_ETR:          tim2_etr_in is connected to TIM3_ETR (*)
  *            LL_TIM_TIM2_ETR_IN_TIM4_ETR:          tim2_etr_in is connected to TIM4_ETR (*)
  *            LL_TIM_TIM2_ETR_IN_TIM5_ETR:          tim2_etr_in is connected to TIM5_ETR (*)
  *            LL_TIM_TIM2_ETR_IN_ETH1_PTP_PPS_OUT:  tim2_etr_in is connected to eth1_ptp_pps_out (*)
  *            LL_TIM_TIM2_ETR_IN_COMP3_OUT:         tim2_etr_in is connected to comp3_out (*)
  *            LL_TIM_TIM2_ETR_IN_COMP4_OUT:         tim2_etr_in is connected to comp4_out (*)
  *            LL_TIM_TIM2_ETR_IN_PLAY1_OUT4:        tim2_etr_in is connected to play1_out4 (*)
  *            LL_TIM_TIM2_ETR_IN_PLAY1_OUT2:        tim2_etr_in is connected to play1_out2 (*)
  *
  *         TIM3: one of the following values: (**)
  *            LL_TIM_TIM3_ETR_IN_GPIO:              tim3_etr_in is connected to TIM3_ETR
  *            LL_TIM_TIM3_ETR_IN_COMP1_OUT:         tim3_etr_in is connected to comp1_out
  *            LL_TIM_TIM3_ETR_IN_ADC2_AWD1:         tim3_etr_in is connected to adc2_awd1 (*)
  *            LL_TIM_TIM3_ETR_IN_ADC2_AWD2:         tim3_etr_in is connected to adc2_awd2 (*)
  *            LL_TIM_TIM3_ETR_IN_ADC2_AWD3:         tim3_etr_in is connected to adc2_awd3 (*)
  *            LL_TIM_TIM3_ETR_IN_TIM2_ETR:          tim3_etr_in is connected to TIM2_ETR
  *            LL_TIM_TIM3_ETR_IN_TIM4_ETR:          tim3_etr_in is connected to TIM4_ETR
  *            LL_TIM_TIM3_ETR_IN_TIM5_ETR:          tim3_etr_in is connected to TIM5_ETR
  *            LL_TIM_TIM3_ETR_IN_ETH1_PTP_PPS_OUT:  tim3_etr_in is connected to eth1_ptp_pps_out (*)
  *            LL_TIM_TIM3_ETR_IN_COMP2_OUT:         tim3_etr_in is connected to comp2_out (*)
  *            LL_TIM_TIM3_ETR_IN_COMP3_OUT:         tim3_etr_in is connected to comp3_out (*)
  *            LL_TIM_TIM3_ETR_IN_COMP4_OUT:         tim3_etr_in is connected to comp4_out (*)
  *            LL_TIM_TIM3_ETR_IN_PLAY1_OUT4:        tim3_etr_in is connected to play1_out4 (*)
  *            LL_TIM_TIM3_ETR_IN_PLAY1_OUT13:       tim3_etr_in is connected to play1_out13 (*)
  *
  *         TIM4: one of the following values: (**)
  *            LL_TIM_TIM4_ETR_IN_GPIO:              tim4_etr_in is connected to TIM4_ETR
  *            LL_TIM_TIM4_ETR_IN_COMP1_OUT:         tim4_etr_in is connected to comp1_out
  *            LL_TIM_TIM4_ETR_IN_ADC3_AWD1:         tim4_etr_in is connected to adc3_awd1
  *            LL_TIM_TIM4_ETR_IN_ADC3_AWD2:         tim4_etr_in is connected to adc3_awd2
  *            LL_TIM_TIM4_ETR_IN_ADC3_AWD3:         tim4_etr_in is connected to adc3_awd3
  *            LL_TIM_TIM4_ETR_IN_TIM2_ETR:          tim4_etr_in is connected to TIM2_ETR
  *            LL_TIM_TIM4_ETR_IN_TIM3_ETR:          tim4_etr_in is connected to TIM3_ETR
  *            LL_TIM_TIM4_ETR_IN_TIM5_ETR:          tim4_etr_in is connected to TIM5_ETR
  *
  *         TIM5: one of the following values: (**)
  *            LL_TIM_TIM5_ETR_IN_GPIO:              tim5_etr_in is connected to TIM5_ETR
  *            LL_TIM_TIM5_ETR_IN_COMP1_OUT:         tim5_etr_in is connected to comp1_out
  *            LL_TIM_TIM5_ETR_IN_ADC3_AWD1:         tim5_etr_in is connected to adc3_awd1 (*)
  *            LL_TIM_TIM5_ETR_IN_ADC3_AWD2:         tim5_etr_in is connected to adc3_awd2 (*)
  *            LL_TIM_TIM5_ETR_IN_ADC3_AWD3:         tim5_etr_in is connected to adc3_awd3 (*)
  *            LL_TIM_TIM5_ETR_IN_TIM2_ETR:          tim5_etr_in is connected to TIM2_ETR
  *            LL_TIM_TIM5_ETR_IN_TIM3_ETR:          tim5_etr_in is connected to TIM3_ETR (*)
  *            LL_TIM_TIM5_ETR_IN_TIM4_ETR:          tim5_etr_in is connected to TIM4_ETR (*)
  *            LL_TIM_TIM5_ETR_IN_COMP2_OUT:         tim5_etr_in is connected to comp2_out (*)
  *            LL_TIM_TIM5_ETR_IN_COMP3_OUT:         tim5_etr_in is connected to comp3_out (*)
  *            LL_TIM_TIM5_ETR_IN_COMP4_OUT:         tim5_etr_in is connected to comp4_out (*)
  *
  *         TIM8: one of the following values:
  *            LL_TIM_TIM8_ETR_IN_GPIO:              tim8_etr_in is connected to TIM8_ETR
  *            LL_TIM_TIM8_ETR_IN_COMP1_OUT:         tim8_etr_in is connected to comp1_out
  *            LL_TIM_TIM8_ETR_IN_COMP2_OUT:         tim8_etr_in is connected to comp2_out (*)
  *            LL_TIM_TIM8_ETR_IN_ADC1_AWD1:         tim8_etr_in is connected to adc1_awd1 (*)
  *            LL_TIM_TIM8_ETR_IN_ADC1_AWD2:         tim8_etr_in is connected to adc1_awd2 (*)
  *            LL_TIM_TIM8_ETR_IN_ADC1_AWD3:         tim8_etr_in is connected to adc1_awd3 (*)
  *            LL_TIM_TIM8_ETR_IN_ADC2_AWD1:         tim8_etr_in is connected to adc2_awd1 (*)
  *            LL_TIM_TIM8_ETR_IN_ADC2_AWD2:         tim8_etr_in is connected to adc2_awd2 (*)
  *            LL_TIM_TIM8_ETR_IN_ADC2_AWD3:         tim8_etr_in is connected to adc2_awd3 (*)
  *            LL_TIM_TIM8_ETR_IN_ADC3_AWD1:         tim8_etr_in is connected to adc3_awd1 (*)
  *            LL_TIM_TIM8_ETR_IN_ADC3_AWD2:         tim8_etr_in is connected to adc3_awd2 (*)
  *            LL_TIM_TIM8_ETR_IN_ADC3_AWD3:         tim8_etr_in is connected to adc3_awd3 (*)
  *            LL_TIM_TIM8_ETR_IN_COMP3_OUT:         tim8_etr_in is connected to comp3_out (*)
  *            LL_TIM_TIM8_ETR_IN_COMP4_OUT:         tim8_etr_in is connected to comp4_out (*)
  *            LL_TIM_TIM8_ETR_IN_PLAY1_OUT6:        tim8_etr_in is connected to play1_out6 (*)
  *            LL_TIM_TIM8_ETR_IN_PLAY1_OUT10:       tim8_etr_in is connected to play1_out10 (*)
  *
  *         TIM20: one of the following values: (**)
  *            LL_TIM_TIM20_ETR_IN_GPIO:             tim20_etr_in is connected to TIM20_ETR
  *            LL_TIM_TIM20_ETR_IN_COMP1_OUT:        tim20_etr_in is connected to comp1_out
  *            LL_TIM_TIM20_ETR_IN_ADC3_AWD1:        tim20_etr_in is connected to adc3_awd1 (*)
  *            LL_TIM_TIM20_ETR_IN_ADC3_AWD2:        tim20_etr_in is connected to adc3_awd2 (*)
  *            LL_TIM_TIM20_ETR_IN_ADC3_AWD3:        tim20_etr_in is connected to adc3_awd3 (*)
  *            LL_TIM_TIM20_ETR_IN_COMP2_OUT:        tim20_etr_in is connected to comp2_out (*)
  *            LL_TIM_TIM20_ETR_IN_COMP3_OUT:        tim20_etr_in is connected to comp3_out (*)
  *            LL_TIM_TIM20_ETR_IN_COMP4_OUT:        tim20_etr_in is connected to comp4_out (*)
  *            LL_TIM_TIM20_ETR_IN_PLAY1_OUT6:       tim20_etr_in is connected to play1_out6 (*)
  *            LL_TIM_TIM20_ETR_IN_PLAY1_OUT14:      tim20_etr_in is connected to play1_out14 (*)
  *
  *         (*) Value not defined in all devices.
  *         (**) Timer instance not available on all devices.
  * @note Macro IS_TIM_ETRSEL_INSTANCE(timx) can be used to check whether or
  *       not a timer instance supports ETR source selection.
  */
__STATIC_INLINE void LL_TIM_SetETRSource(TIM_TypeDef *timx, uint32_t etr_source)
{
  STM32_MODIFY_REG(timx->AF1, TIM_AF1_ETRSEL, etr_source);
}

/**
  * @brief  Get the source of the external trigger input (ETR).
  * @rmtoll
  *  AF1          ETRSEL        LL_TIM_GetETRSource
  * @param  timx Timer instance
  * @note Macro IS_TIM_ETRSEL_INSTANCE(timx) can be used to check whether or
  *       not a timer instance supports ETR source selection.
  * @retval  ETR source that can be one of the following values:
  *
  *         TIM1: one of the following values:
  *            LL_TIM_TIM1_ETR_IN_GPIO:              tim1_etr_in is connected to TIM1_ETR
  *            LL_TIM_TIM1_ETR_IN_COMP1_OUT:         tim1_etr_in is connected to comp1_out
  *            LL_TIM_TIM1_ETR_IN_COMP2_OUT:         tim1_etr_in is connected to comp2_out (*)
  *            LL_TIM_TIM1_ETR_IN_ADC1_AWD1:         tim1_etr_in is connected to adc1_awd1
  *            LL_TIM_TIM1_ETR_IN_ADC1_AWD2:         tim1_etr_in is connected to adc1_awd2
  *            LL_TIM_TIM1_ETR_IN_ADC1_AWD3:         tim1_etr_in is connected to adc1_awd3
  *            LL_TIM_TIM1_ETR_IN_COMP3_OUT:         tim1_etr_in is connected to comp3_out (*)
  *            LL_TIM_TIM1_ETR_IN_COMP4_OUT:         tim1_etr_in is connected to comp4_out (*)
  *            LL_TIM_TIM1_ETR_IN_PLAY1_OUT6:        tim1_etr_in is connected to play1_out6 (*)
  *            LL_TIM_TIM1_ETR_IN_PLAY1_OUT8:        tim1_etr_in is connected to play1_out8 (*)
  *
  *         TIM2: one of the following values:
  *            LL_TIM_TIM2_ETR_IN_GPIO:              tim2_etr_in is connected to TIM2_ETR
  *            LL_TIM_TIM2_ETR_IN_COMP1_OUT:         tim2_etr_in is connected to comp1_out
  *            LL_TIM_TIM2_ETR_IN_COMP2_OUT:         tim2_etr_in is connected to comp2_out (*)
  *            LL_TIM_TIM2_ETR_IN_ADC1_AWD1:         tim2_etr_in is connected to adc1_awd1
  *            LL_TIM_TIM2_ETR_IN_ADC1_AWD2:         tim2_etr_in is connected to adc1_awd2
  *            LL_TIM_TIM2_ETR_IN_ADC1_AWD3:         tim2_etr_in is connected to adc1_awd3
  *            LL_TIM_TIM2_ETR_IN_LSE:               tim2_etr_in is connected to LSE
  *            LL_TIM_TIM2_ETR_IN_MCO1:              tim2_etr_in is connected to MCO1
  *            LL_TIM_TIM2_ETR_IN_TIM3_ETR:          tim2_etr_in is connected to TIM3_ETR (*)
  *            LL_TIM_TIM2_ETR_IN_TIM4_ETR:          tim2_etr_in is connected to TIM4_ETR (*)
  *            LL_TIM_TIM2_ETR_IN_TIM5_ETR:          tim2_etr_in is connected to TIM5_ETR (*)
  *            LL_TIM_TIM2_ETR_IN_ETH1_PTP_PPS_OUT:  tim2_etr_in is connected to eth1_ptp_pps_out (*)
  *            LL_TIM_TIM2_ETR_IN_COMP3_OUT:         tim2_etr_in is connected to comp3_out (*)
  *            LL_TIM_TIM2_ETR_IN_COMP4_OUT:         tim2_etr_in is connected to comp4_out (*)
  *            LL_TIM_TIM2_ETR_IN_PLAY1_OUT4:        tim2_etr_in is connected to play1_out4 (*)
  *            LL_TIM_TIM2_ETR_IN_PLAY1_OUT2:        tim2_etr_in is connected to play1_out2 (*)
  *
  *         TIM3: one of the following values: (**)
  *            LL_TIM_TIM3_ETR_IN_GPIO:              tim3_etr_in is connected to TIM3_ETR
  *            LL_TIM_TIM3_ETR_IN_COMP1_OUT:         tim3_etr_in is connected to comp1_out
  *            LL_TIM_TIM3_ETR_IN_ADC2_AWD1:         tim3_etr_in is connected to adc2_awd1 (*)
  *            LL_TIM_TIM3_ETR_IN_ADC2_AWD2:         tim3_etr_in is connected to adc2_awd2 (*)
  *            LL_TIM_TIM3_ETR_IN_ADC2_AWD3:         tim3_etr_in is connected to adc2_awd3 (*)
  *            LL_TIM_TIM3_ETR_IN_TIM2_ETR:          tim3_etr_in is connected to TIM2_ETR
  *            LL_TIM_TIM3_ETR_IN_TIM4_ETR:          tim3_etr_in is connected to TIM4_ETR
  *            LL_TIM_TIM3_ETR_IN_TIM5_ETR:          tim3_etr_in is connected to TIM5_ETR
  *            LL_TIM_TIM3_ETR_IN_ETH1_PTP_PPS_OUT:  tim3_etr_in is connected to eth1_ptp_pps_out (*)
  *            LL_TIM_TIM3_ETR_IN_COMP2_OUT:         tim3_etr_in is connected to comp2_out (*)
  *            LL_TIM_TIM3_ETR_IN_COMP3_OUT:         tim3_etr_in is connected to comp3_out (*)
  *            LL_TIM_TIM3_ETR_IN_COMP4_OUT:         tim3_etr_in is connected to comp4_out (*)
  *            LL_TIM_TIM3_ETR_IN_PLAY1_OUT4:        tim3_etr_in is connected to play1_out4 (*)
  *            LL_TIM_TIM3_ETR_IN_PLAY1_OUT13:       tim3_etr_in is connected to play1_out13 (*)
  *
  *         TIM4: one of the following values: (**)
  *            LL_TIM_TIM4_ETR_IN_GPIO:              tim4_etr_in is connected to TIM4_ETR
  *            LL_TIM_TIM4_ETR_IN_COMP1_OUT:         tim4_etr_in is connected to comp1_out
  *            LL_TIM_TIM4_ETR_IN_ADC3_AWD1:         tim4_etr_in is connected to adc3_awd1
  *            LL_TIM_TIM4_ETR_IN_ADC3_AWD2:         tim4_etr_in is connected to adc3_awd2
  *            LL_TIM_TIM4_ETR_IN_ADC3_AWD3:         tim4_etr_in is connected to adc3_awd3
  *            LL_TIM_TIM4_ETR_IN_TIM2_ETR:          tim4_etr_in is connected to TIM2_ETR
  *            LL_TIM_TIM4_ETR_IN_TIM3_ETR:          tim4_etr_in is connected to TIM3_ETR
  *            LL_TIM_TIM4_ETR_IN_TIM5_ETR:          tim4_etr_in is connected to TIM5_ETR
  *
  *         TIM5: one of the following values: (**)
  *            LL_TIM_TIM5_ETR_IN_GPIO:              tim5_etr_in is connected to TIM5_ETR
  *            LL_TIM_TIM5_ETR_IN_COMP1_OUT:         tim5_etr_in is connected to comp1_out
  *            LL_TIM_TIM5_ETR_IN_ADC3_AWD1:         tim5_etr_in is connected to adc3_awd1 (*)
  *            LL_TIM_TIM5_ETR_IN_ADC3_AWD2:         tim5_etr_in is connected to adc3_awd2 (*)
  *            LL_TIM_TIM5_ETR_IN_ADC3_AWD3:         tim5_etr_in is connected to adc3_awd3 (*)
  *            LL_TIM_TIM5_ETR_IN_TIM2_ETR:          tim5_etr_in is connected to TIM2_ETR
  *            LL_TIM_TIM5_ETR_IN_TIM3_ETR:          tim5_etr_in is connected to TIM3_ETR (*)
  *            LL_TIM_TIM5_ETR_IN_TIM4_ETR:          tim5_etr_in is connected to TIM4_ETR (*)
  *            LL_TIM_TIM5_ETR_IN_COMP2_OUT:         tim5_etr_in is connected to comp2_out (*)
  *            LL_TIM_TIM5_ETR_IN_COMP3_OUT:         tim5_etr_in is connected to comp3_out (*)
  *            LL_TIM_TIM5_ETR_IN_COMP4_OUT:         tim5_etr_in is connected to comp4_out (*)
  *
  *         TIM8: one of the following values:
  *            LL_TIM_TIM8_ETR_IN_GPIO:              tim8_etr_in is connected to TIM8_ETR
  *            LL_TIM_TIM8_ETR_IN_COMP1_OUT:         tim8_etr_in is connected to comp1_out
  *            LL_TIM_TIM8_ETR_IN_COMP2_OUT:         tim8_etr_in is connected to comp2_out (*)
  *            LL_TIM_TIM8_ETR_IN_ADC1_AWD1:         tim8_etr_in is connected to adc1_awd1 (*)
  *            LL_TIM_TIM8_ETR_IN_ADC1_AWD2:         tim8_etr_in is connected to adc1_awd2 (*)
  *            LL_TIM_TIM8_ETR_IN_ADC1_AWD3:         tim8_etr_in is connected to adc1_awd3 (*)
  *            LL_TIM_TIM8_ETR_IN_ADC2_AWD1:         tim8_etr_in is connected to adc2_awd1 (*)
  *            LL_TIM_TIM8_ETR_IN_ADC2_AWD2:         tim8_etr_in is connected to adc2_awd2 (*)
  *            LL_TIM_TIM8_ETR_IN_ADC2_AWD3:         tim8_etr_in is connected to adc2_awd3 (*)
  *            LL_TIM_TIM8_ETR_IN_ADC3_AWD1:         tim8_etr_in is connected to adc3_awd1 (*)
  *            LL_TIM_TIM8_ETR_IN_ADC3_AWD2:         tim8_etr_in is connected to adc3_awd2 (*)
  *            LL_TIM_TIM8_ETR_IN_ADC3_AWD3:         tim8_etr_in is connected to adc3_awd3 (*)
  *            LL_TIM_TIM8_ETR_IN_COMP3_OUT:         tim8_etr_in is connected to comp3_out (*)
  *            LL_TIM_TIM8_ETR_IN_COMP4_OUT:         tim8_etr_in is connected to comp4_out (*)
  *            LL_TIM_TIM8_ETR_IN_PLAY1_OUT6:        tim8_etr_in is connected to play1_out6 (*)
  *            LL_TIM_TIM8_ETR_IN_PLAY1_OUT10:       tim8_etr_in is connected to play1_out10 (*)
  *
  *         TIM20: one of the following values: (**)
  *            LL_TIM_TIM20_ETR_IN_GPIO:             tim20_etr_in is connected to TIM20_ETR
  *            LL_TIM_TIM20_ETR_IN_COMP1_OUT:        tim20_etr_in is connected to comp1_out
  *            LL_TIM_TIM20_ETR_IN_ADC3_AWD1:        tim20_etr_in is connected to adc3_awd1 (*)
  *            LL_TIM_TIM20_ETR_IN_ADC3_AWD2:        tim20_etr_in is connected to adc3_awd2 (*)
  *            LL_TIM_TIM20_ETR_IN_ADC3_AWD3:        tim20_etr_in is connected to adc3_awd3 (*)
  *            LL_TIM_TIM20_ETR_IN_COMP2_OUT:        tim20_etr_in is connected to comp2_out (*)
  *            LL_TIM_TIM20_ETR_IN_COMP3_OUT:        tim20_etr_in is connected to comp3_out (*)
  *            LL_TIM_TIM20_ETR_IN_COMP4_OUT:        tim20_etr_in is connected to comp4_out (*)
  *            LL_TIM_TIM20_ETR_IN_PLAY1_OUT6:       tim20_etr_in is connected to play1_out6 (*)
  *            LL_TIM_TIM20_ETR_IN_PLAY1_OUT14:      tim20_etr_in is connected to play1_out14 (*)
  *
  *         (*) Value not defined in all devices.
  *         (**) Timer instance not available on all devices.
  */
__STATIC_INLINE uint32_t LL_TIM_GetETRSource(const TIM_TypeDef *timx)
{
  return (uint32_t)(STM32_READ_REG(timx->AF1) & TIM_AF1_ETRSEL);
}

/**
  * @brief  Enable SMS preload.
  * @rmtoll
  *  SMCR         SMSPE           LL_TIM_EnableSMSPreload
  * @param  timx Timer instance
  * @note Macro IS_TIM_SMS_PRELOAD_INSTANCE(timx) can be used to check
  *       whether or not a timer instance supports the preload of SMS field in SMCR register.
  */
__STATIC_INLINE void LL_TIM_EnableSMSPreload(TIM_TypeDef *timx)
{
  STM32_SET_BIT(timx->SMCR, TIM_SMCR_SMSPE);
}

/**
  * @brief  Disable SMS preload.
  * @rmtoll
  *  SMCR         SMSPE           LL_TIM_DisableSMSPreload
  * @param  timx Timer instance
  * @note Macro IS_TIM_SMS_PRELOAD_INSTANCE(timx) can be used to check
  *       whether or not a timer instance supports the preload of SMS field in SMCR register.
  */
__STATIC_INLINE void LL_TIM_DisableSMSPreload(TIM_TypeDef *timx)
{
  STM32_CLEAR_BIT(timx->SMCR, TIM_SMCR_SMSPE);
}

/**
  * @brief  Indicate whether  SMS preload is enabled.
  * @rmtoll
  *  SMCR         SMSPE           LL_TIM_IsEnabledSMSPreload
  * @param  timx Timer instance
  * @note Macro IS_TIM_SMS_PRELOAD_INSTANCE(timx) can be used to check
  *       whether or not a timer instance supports the preload of SMS field in SMCR register.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsEnabledSMSPreload(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->SMCR, TIM_SMCR_SMSPE) == (TIM_SMCR_SMSPE)) ? 1UL : 0UL);
}

/**
  * @brief  Set the preload source of SMS.
  * @rmtoll
  *  SMCR         SMSPS        LL_TIM_SetSMSPreloadSource
  * @param  timx Timer instance
  * @param  preload_source This parameter can be one of the following values:
  *         @arg @ref LL_TIM_SLAVE_MODE_PRELOAD_UPDATE
  *         @arg @ref LL_TIM_SLAVE_MODE_PRELOAD_INDEX
  * @note Macro IS_TIM_SMS_PRELOAD_INSTANCE(timx) can be used to check
  *       whether or not a timer instance supports the preload of SMS field in SMCR register.
  */
__STATIC_INLINE void LL_TIM_SetSMSPreloadSource(TIM_TypeDef *timx, uint32_t preload_source)
{
  STM32_MODIFY_REG(timx->SMCR, TIM_SMCR_SMSPS, preload_source);
}

/**
  * @brief  Get the preload source of SMS.
  * @rmtoll
  *  SMCR         SMSPS        LL_TIM_GetSMSPreloadSource
  * @param  timx Timer instance
  * @note Macro IS_TIM_SMS_PRELOAD_INSTANCE(timx) can be used to check
  *       whether or not a timer instance supports the preload of SMS field in SMCR register.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_TIM_SLAVE_MODE_PRELOAD_UPDATE
  *         @arg @ref LL_TIM_SLAVE_MODE_PRELOAD_INDEX
  */
__STATIC_INLINE uint32_t LL_TIM_GetSMSPreloadSource(const TIM_TypeDef *timx)
{
  return (uint32_t)(STM32_READ_BIT(timx->SMCR, TIM_SMCR_SMSPS));
}


/**
  * @brief  Enable ADC synchronization.
  * @rmtoll
  *  CR2         ADSYNC           LL_TIM_EnableADCSynchronization
  * @param  timx Timer instance
  * @note Macro IS_TIM_MASTER_INSTANCE(timx) can be used to check
  *       whether or not a timer instance supports ADC synchronization.
  */
__STATIC_INLINE void LL_TIM_EnableADCSynchronization(TIM_TypeDef *timx)
{
  STM32_SET_BIT(timx->CR2, TIM_CR2_ADSYNC);
}

/**
  * @brief  Enable ADC synchronization.
  * @rmtoll
  *  CR2         ADSYNC           LL_TIM_DisableADCSynchronization
  * @param  timx Timer instance
  * @note Macro IS_TIM_MASTER_INSTANCE(timx) can be used to check
  *       whether or not a timer instance supports ADC synchronization.
  */
__STATIC_INLINE void LL_TIM_DisableADCSynchronization(TIM_TypeDef *timx)
{
  STM32_CLEAR_BIT(timx->CR2, TIM_CR2_ADSYNC);
}

/**
  * @brief  Indicate whether ADC sycnhronization is enabled.
  * @rmtoll
  *  CR2         ADSYNC           LL_TIM_IsEnabledADCSynchronization
  * @param  timx Timer instance
  * @note Macro IS_TIM_MASTER_INSTANCE(timx) can be used to check
  *       whether or not a timer instance supports ADC synchronization.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsEnabledADCSynchronization(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->CR2, TIM_CR2_ADSYNC) == (TIM_CR2_ADSYNC)) ? 1UL : 0UL);
}

/**
  * @}
  */

/** @defgroup TIM_LL_EF_Break_Function Break function configuration
  * @{
  */
/**
  * @brief  Enable the break function.
  * @rmtoll
  *  BDTR         BKE           LL_TIM_EnableBRK
  * @param  timx Timer instance
  * @note Macro IS_TIM_BREAK_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides a break input.
  */
__STATIC_INLINE void LL_TIM_EnableBRK(TIM_TypeDef *timx)
{
  __IO uint32_t tmpreg;
  STM32_SET_BIT(timx->BDTR, TIM_BDTR_BKE);
  /* Note: Any write operation to this bit takes a delay of 1 APB clock cycle to become effective. */
  tmpreg = STM32_READ_REG(timx->BDTR);
  (void)(tmpreg);
}

/**
  * @brief  Disable the break function.
  * @rmtoll
  *  BDTR         BKE           LL_TIM_DisableBRK
  * @param  timx Timer instance
  * @note Macro IS_TIM_BREAK_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides a break input.
  */
__STATIC_INLINE void LL_TIM_DisableBRK(TIM_TypeDef *timx)
{
  __IO uint32_t tmpreg;
  STM32_CLEAR_BIT(timx->BDTR, TIM_BDTR_BKE);
  /* Note: Any write operation to this bit takes a delay of 1 APB clock cycle to become effective. */
  tmpreg = STM32_READ_REG(timx->BDTR);
  (void)(tmpreg);
}

