MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_tim.h
/**
  * @brief  Configure the break input.
  * @rmtoll
  *  BDTR         BKP           LL_TIM_ConfigBRK \n
  *  BDTR         BKF           LL_TIM_ConfigBRK \n
  *  BDTR         BKBID         LL_TIM_ConfigBRK
  * @param  timx Timer instance
  * @param  break_polarity This parameter can be one of the following values:
  *         @arg @ref LL_TIM_BREAK_POLARITY_LOW
  *         @arg @ref LL_TIM_BREAK_POLARITY_HIGH
  * @param  break_filter This parameter can be one of the following values:
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV1
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV1_N2
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV1_N4
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV1_N8
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV2_N6
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV2_N8
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV4_N6
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV4_N8
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV8_N6
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV8_N8
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV16_N5
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV16_N6
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV16_N8
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV32_N5
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV32_N6
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV32_N8
  * @param  break_afmode This parameter can be one of the following values:
  *         @arg @ref LL_TIM_BREAK_AFMODE_INPUT
  *         @arg @ref LL_TIM_BREAK_AFMODE_BIDIRECTIONAL
  * @note Macro IS_TIM_BREAK_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides a break input.
  * @note Bidirectional mode is only supported by advanced timer instances.
  * @note In bidirectional mode (BKBID bit set), the Break input is configured both
  *        in input mode and in open drain output mode. Any active Break event will
  *        assert a low logic level on the Break input to indicate an internal break
  *        event to external devices.
  * @note When bidirectional mode isn't supported, break_afmode must be set to
  *       LL_TIM_BREAK_AFMODE_INPUT.
  */
__STATIC_INLINE void LL_TIM_ConfigBRK(TIM_TypeDef *timx, uint32_t break_polarity, uint32_t break_filter,
                                      uint32_t break_afmode)
{
  __IO uint32_t tmpreg;
  STM32_MODIFY_REG(timx->BDTR, TIM_BDTR_BKP | TIM_BDTR_BKF | TIM_BDTR_BKBID, \
                   break_polarity | break_filter | break_afmode);
  /* Note: Any write operation to BKP bit takes a delay of 1 APB clock cycle to become effective. */
  tmpreg = STM32_READ_REG(timx->BDTR);
  (void)(tmpreg);
}

/**
  * @brief  Get the break input configuration.
  * @rmtoll
  *  BDTR         BKP           LL_TIM_GetConfigBRK \n
  *  BDTR         BKF           LL_TIM_GetConfigBRK \n
  *  BDTR         BKBID         LL_TIM_GetConfigBRK
  * @param  timx Timer instance
  * @param  p_break_polarity Pointer to a storage for break polarity. \n
  *         The value can be one of the following values: \n
  *         @arg @ref LL_TIM_BREAK_POLARITY_LOW
  *         @arg @ref LL_TIM_BREAK_POLARITY_HIGH
  * @param  p_break_filter  Pointer to a storage for break filter. \n
  *         The value can be one of the following values: \n
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV1
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV1_N2
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV1_N4
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV1_N8
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV2_N6
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV2_N8
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV4_N6
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV4_N8
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV8_N6
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV8_N8
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV16_N5
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV16_N6
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV16_N8
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV32_N5
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV32_N6
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV32_N8
  * @param  p_break_afmode Pointer to a storage for break afmode. \n
  *         The value can be one of the following values: \n
  *         @arg @ref LL_TIM_BREAK_AFMODE_INPUT
  *         @arg @ref LL_TIM_BREAK_AFMODE_BIDIRECTIONAL
  * @note Macro IS_TIM_BREAK_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides a break input.
  */
__STATIC_INLINE void LL_TIM_GetConfigBRK(TIM_TypeDef *timx, uint32_t *p_break_polarity, uint32_t *p_break_filter,
                                         uint32_t *p_break_afmode)
{
  const __IO uint32_t bdtr = STM32_READ_REG(timx->BDTR);

  *p_break_polarity = bdtr & TIM_BDTR_BKP;
  *p_break_filter = bdtr & TIM_BDTR_BKF;
  *p_break_afmode = bdtr & TIM_BDTR_BKBID;
}

/**
  * @brief  Disarm the break input (when it operates in bidirectional mode).
  * @rmtoll
  *  BDTR         BKDSRM        LL_TIM_DisarmBRK
  * @param  timx Timer instance
  * @note  The break input can be disarmed only when it is configured in
  *        bidirectional mode and when when MOE is reset.
  * @note  Purpose is to be able to have the input voltage back to high-state,
  *        whatever the time constant on the output .
  */
__STATIC_INLINE void LL_TIM_DisarmBRK(TIM_TypeDef *timx)
{
  STM32_SET_BIT(timx->BDTR, TIM_BDTR_BKDSRM);
}

/**
  * @brief  Indicates whether the break input is disarmed.
  * @rmtoll
  *  BDTR         BKDSRM        LL_TIM_IsDisarmedBRK
  * @param  timx Timer instance
  * @retval Status of the break input (0: armed, 1: disarmed)
  */
__STATIC_INLINE uint32_t LL_TIM_IsDisarmedBRK(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->BDTR, TIM_BDTR_BKDSRM) == (TIM_BDTR_BKDSRM)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the break 2 function.
  * @rmtoll
  *  BDTR         BK2E          LL_TIM_EnableBRK2
  * @param  timx Timer instance
  * @note Macro IS_TIM_BKIN2_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides a second break input.
  */
__STATIC_INLINE void LL_TIM_EnableBRK2(TIM_TypeDef *timx)
{
  __IO uint32_t tmpreg;
  STM32_SET_BIT(timx->BDTR, TIM_BDTR_BK2E);
  /* Note: Any write operation to this bit takes a delay of 1 APB clock cycle to become effective. */
  tmpreg = STM32_READ_REG(timx->BDTR);
  (void)(tmpreg);
}

/**
  * @brief  Disable the break  2 function.
  * @rmtoll
  *  BDTR         BK2E          LL_TIM_DisableBRK2
  * @param  timx Timer instance
  * @note Macro IS_TIM_BKIN2_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides a second break input.
  */
__STATIC_INLINE void LL_TIM_DisableBRK2(TIM_TypeDef *timx)
{
  __IO uint32_t tmpreg;
  STM32_CLEAR_BIT(timx->BDTR, TIM_BDTR_BK2E);
  /* Note: Any write operation to this bit takes a delay of 1 APB clock cycle to become effective. */
  tmpreg = STM32_READ_REG(timx->BDTR);
  (void)(tmpreg);
}

/**
  * @brief  Configure the break 2 input.
  * @rmtoll
  *  BDTR         BK2P          LL_TIM_ConfigBRK2 \n
  *  BDTR         BK2F          LL_TIM_ConfigBRK2 \n
  *  BDTR         BK2BID        LL_TIM_ConfigBRK2
  * @param  timx Timer instance
  * @param  break2_polarity This parameter can be one of the following values:
  *         @arg @ref LL_TIM_BREAK2_POLARITY_LOW
  *         @arg @ref LL_TIM_BREAK2_POLARITY_HIGH
  * @param  break2_filter This parameter can be one of the following values:
  *         @arg @ref LL_TIM_BREAK2_FILTER_FDIV1
  *         @arg @ref LL_TIM_BREAK2_FILTER_FDIV1_N2
  *         @arg @ref LL_TIM_BREAK2_FILTER_FDIV1_N4
  *         @arg @ref LL_TIM_BREAK2_FILTER_FDIV1_N8
  *         @arg @ref LL_TIM_BREAK2_FILTER_FDIV2_N6
  *         @arg @ref LL_TIM_BREAK2_FILTER_FDIV2_N8
  *         @arg @ref LL_TIM_BREAK2_FILTER_FDIV4_N6
  *         @arg @ref LL_TIM_BREAK2_FILTER_FDIV4_N8
  *         @arg @ref LL_TIM_BREAK2_FILTER_FDIV8_N6
  *         @arg @ref LL_TIM_BREAK2_FILTER_FDIV8_N8
  *         @arg @ref LL_TIM_BREAK2_FILTER_FDIV16_N5
  *         @arg @ref LL_TIM_BREAK2_FILTER_FDIV16_N6
  *         @arg @ref LL_TIM_BREAK2_FILTER_FDIV16_N8
  *         @arg @ref LL_TIM_BREAK2_FILTER_FDIV32_N5
  *         @arg @ref LL_TIM_BREAK2_FILTER_FDIV32_N6
  *         @arg @ref LL_TIM_BREAK2_FILTER_FDIV32_N8
  * @param  break2_afmode This parameter can be one of the following values:
  *         @arg @ref LL_TIM_BREAK2_AFMODE_INPUT
  *         @arg @ref LL_TIM_BREAK2_AFMODE_BIDIRECTIONAL
  * @note Macro IS_TIM_BKIN2_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides a second break input.
  * @note Bidirectional mode is only supported by advanced timer instances.
  * @note In bidirectional mode (BK2BID bit set), the Break 2 input is configured both
  *        in input mode and in open drain output mode. Any active Break event will
  *        assert a low logic level on the Break 2 input to indicate an internal break
  *        event to external devices.
  * @note When bidirectional mode isn't supported, break2_afmode must be set to
  *       LL_TIM_BREAK2_AFMODE_INPUT.
  */
__STATIC_INLINE void LL_TIM_ConfigBRK2(TIM_TypeDef *timx, uint32_t break2_polarity, uint32_t break2_filter,
                                       uint32_t break2_afmode)
{
  __IO uint32_t tmpreg;
  STM32_MODIFY_REG(timx->BDTR, TIM_BDTR_BK2P | TIM_BDTR_BK2F | TIM_BDTR_BK2BID,
                   break2_polarity | break2_filter | break2_afmode);
  /* Note: Any write operation to BK2P bit takes a delay of 1 APB clock cycle to become effective. */
  tmpreg = STM32_READ_REG(timx->BDTR);
  (void)(tmpreg);
}

/**
  * @brief  Get the break 2 input configuration.
  * @rmtoll
  *  BDTR         BK2P           LL_TIM_GetConfigBRK2 \n
  *  BDTR         BK2F           LL_TIM_GetConfigBRK2 \n
  *  BDTR         BK2BID         LL_TIM_GetConfigBRK2
  * @param  timx Timer instance
  * @param  p_break2_polarity Pointer to a storage for break 2 polarity. \n
  *         The value can be one of the following values: \n
  *         @arg @ref LL_TIM_BREAK2_POLARITY_LOW
  *         @arg @ref LL_TIM_BREAK2_POLARITY_HIGH
  * @param  p_break2_filter  Pointer to a storage for break 2 filter. \n
  *         The value can be one of the following values: \n
  *         @arg @ref LL_TIM_BREAK2_FILTER_FDIV1
  *         @arg @ref LL_TIM_BREAK2_FILTER_FDIV1_N2
  *         @arg @ref LL_TIM_BREAK2_FILTER_FDIV1_N4
  *         @arg @ref LL_TIM_BREAK2_FILTER_FDIV1_N8
  *         @arg @ref LL_TIM_BREAK2_FILTER_FDIV2_N6
  *         @arg @ref LL_TIM_BREAK2_FILTER_FDIV2_N8
  *         @arg @ref LL_TIM_BREAK2_FILTER_FDIV4_N6
  *         @arg @ref LL_TIM_BREAK2_FILTER_FDIV4_N8
  *         @arg @ref LL_TIM_BREAK2_FILTER_FDIV8_N6
  *         @arg @ref LL_TIM_BREAK2_FILTER_FDIV8_N8
  *         @arg @ref LL_TIM_BREAK2_FILTER_FDIV16_N5
  *         @arg @ref LL_TIM_BREAK2_FILTER_FDIV16_N6
  *         @arg @ref LL_TIM_BREAK2_FILTER_FDIV16_N8
  *         @arg @ref LL_TIM_BREAK2_FILTER_FDIV32_N5
  *         @arg @ref LL_TIM_BREAK2_FILTER_FDIV32_N6
  *         @arg @ref LL_TIM_BREAK2_FILTER_FDIV32_N8
  * @param  p_break2_afmode Pointer to a storage for break 2 afmode. \n
  *         The value can be one of the following values: \n
  *         @arg @ref LL_TIM_BREAK2_AFMODE_INPUT
  *         @arg @ref LL_TIM_BREAK2_AFMODE_BIDIRECTIONAL
  * @note Macro IS_TIM_BKIN2_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides a second break input.
  */
__STATIC_INLINE void LL_TIM_GetConfigBRK2(TIM_TypeDef *timx, uint32_t *p_break2_polarity, uint32_t *p_break2_filter,
                                          uint32_t *p_break2_afmode)
{
  const __IO uint32_t bdtr = STM32_READ_REG(timx->BDTR);

