MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_tim.h
  *p_break2_polarity = bdtr & TIM_BDTR_BK2P;
  *p_break2_filter = bdtr & TIM_BDTR_BK2F;
  *p_break2_afmode = bdtr & TIM_BDTR_BK2BID;
}

/**
  * @brief  Disarm the break 2 input (when it operates in bidirectional mode).
  * @rmtoll
  *  BDTR         BK2DSRM       LL_TIM_DisarmBRK2
  * @param  timx Timer instance
  * @note  The break 2 input can be disarmed only when it is configured in
  *        bidirectional mode and when when MOE is reset.
  * @note  Purpose is to be able to have the input voltage back to high-state,
  *        whatever the time constant on the output.
  */
__STATIC_INLINE void LL_TIM_DisarmBRK2(TIM_TypeDef *timx)
{
  STM32_SET_BIT(timx->BDTR, TIM_BDTR_BK2DSRM);
}

/**
  * @brief  Indicates whether the break input 2 is disarmed.
  * @rmtoll
  *  BDTR         BK2DSRM       LL_TIM_IsDisarmedBRK2
  * @param  timx Timer instance
  * @retval Status of the break input 2 (0: armed, 1: disarmed)
  */
__STATIC_INLINE uint32_t LL_TIM_IsDisarmedBRK2(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->BDTR, TIM_BDTR_BK2DSRM) == (TIM_BDTR_BK2DSRM)) ? 1UL : 0UL);
}

/**
  * @brief  Disarm the break input.
  * @rmtoll
  *  BDTR         BKDSRM        LL_TIM_DisarmBreakInput \n
  *  BDTR         BK2DSRM       LL_TIM_DisarmBreakInput
  * @param  timx Timer instance
  * @param  break_input This parameter can be one of the following values:
  *         @arg @ref LL_TIM_BREAK_INPUT_1
  *         @arg @ref LL_TIM_BREAK_INPUT_2
  * @note  The break input can be disarmed only when it is configured in
  *        bidirectional mode and when when MOE is reset.
  */
__STATIC_INLINE void LL_TIM_DisarmBreakInput(TIM_TypeDef *timx, uint32_t break_input)
{
  STM32_SET_BIT(timx->BDTR, (TIM_BDTR_BKDSRM << break_input));
}

/**
  * @brief  Indicates whether the break input 2 is disarmed.
  * @rmtoll
  *  BDTR         BKDSRM        LL_TIM_IsDisarmedBreakInput \n
  *  BDTR         BK2DSRM       LL_TIM_IsDisarmedBreakInput
  * @param  timx Timer instance
  * @param  break_input This parameter can be one of the following values:
  *         @arg @ref LL_TIM_BREAK_INPUT_1
  *         @arg @ref LL_TIM_BREAK_INPUT_2
  * @retval Status of the break input 2 (0: armed, 1: disarmed)
  */
__STATIC_INLINE uint32_t LL_TIM_IsDisarmedBreakInput(const TIM_TypeDef *timx, uint32_t break_input)
{
  uint32_t disarm_bit = (TIM_BDTR_BKDSRM << break_input);
  return ((STM32_READ_BIT(timx->BDTR, disarm_bit) == (disarm_bit)) ? 1UL : 0UL);
}

/**
  * @brief  Select the outputs off state (enabled v.s. disabled) in Idle and Run modes.
  * @rmtoll
  *  BDTR         OSSI          LL_TIM_SetOffStates \n
  *  BDTR         OSSR          LL_TIM_SetOffStates
  * @param  timx Timer instance
  * @param  offstate_idle This parameter can be one of the following values:
  *         @arg @ref LL_TIM_OSSI_DISABLE
  *         @arg @ref LL_TIM_OSSI_ENABLE
  * @param  offstate_run This parameter can be one of the following values:
  *         @arg @ref LL_TIM_OSSR_DISABLE
  *         @arg @ref LL_TIM_OSSR_ENABLE
  * @note Macro IS_TIM_BREAK_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides a break input.
  */
__STATIC_INLINE void LL_TIM_SetOffStates(TIM_TypeDef *timx, uint32_t offstate_idle, uint32_t offstate_run)
{
  STM32_MODIFY_REG(timx->BDTR, TIM_BDTR_OSSI | TIM_BDTR_OSSR, offstate_idle | offstate_run);
}

/**
  * @brief  Get actual outputs off state (enabled v.s. disabled) in Idle and Run modes.
  * @rmtoll
  *  BDTR         OSSI          LL_TIM_GetOffStates \n
  *  BDTR         OSSR          LL_TIM_GetOffStates
  * @param  timx Timer instance
  * @param  offstate_idle This parameter can store one of the following values:
  *         @arg @ref LL_TIM_OSSI_DISABLE
  *         @arg @ref LL_TIM_OSSI_ENABLE
  * @param  offstate_run This parameter can store of the following values:
  *         @arg @ref LL_TIM_OSSR_DISABLE
  *         @arg @ref LL_TIM_OSSR_ENABLE
  * @note Macro IS_TIM_BREAK_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides a break input.
  */
__STATIC_INLINE void LL_TIM_GetOffStates(const TIM_TypeDef *timx, uint32_t *offstate_idle, uint32_t *offstate_run)
{
  const __IO uint32_t reg = STM32_READ_REG(timx->BDTR);
  *offstate_idle = reg & TIM_BDTR_OSSI;
  *offstate_run = reg & TIM_BDTR_OSSR;
}

/**
  * @brief  Indicate the global output state when a break or break2 event occurred, to discriminate the source.
  * @rmtoll
  *  SR           ODS            LL_TIM_GetOutputDisableStatus
  * @param  timx Timer instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_TIM_OUTPUT_IDLE_STATE
  *         @arg @ref LL_TIM_OUTPUT_DISABLED_STATE
  */
__STATIC_INLINE uint32_t LL_TIM_GetOutputDisableStatus(const TIM_TypeDef *timx)
{
  return (uint32_t)(STM32_READ_BIT(timx->SR, TIM_SR_ODS));
}

/**
  * @brief  Enable automatic output (MOE can be set by software or automatically when a break input is active).
  * @rmtoll
  *  BDTR         AOE           LL_TIM_EnableAutomaticOutput
  * @param  timx Timer instance
  * @note Macro IS_TIM_BREAK_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides a break input.
  */
__STATIC_INLINE void LL_TIM_EnableAutomaticOutput(TIM_TypeDef *timx)
{
  STM32_SET_BIT(timx->BDTR, TIM_BDTR_AOE);
}

/**
  * @brief  Disable automatic output (MOE can be set only by software).
  * @rmtoll
  *  BDTR         AOE           LL_TIM_DisableAutomaticOutput
  * @param  timx Timer instance
  * @note Macro IS_TIM_BREAK_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides a break input.
  */
__STATIC_INLINE void LL_TIM_DisableAutomaticOutput(TIM_TypeDef *timx)
{
  STM32_CLEAR_BIT(timx->BDTR, TIM_BDTR_AOE);
}

/**
  * @brief  Indicate whether automatic output is enabled.
  * @rmtoll
  *  BDTR         AOE           LL_TIM_IsEnabledAutomaticOutput
  * @param  timx Timer instance
  * @note Macro IS_TIM_BREAK_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides a break input.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsEnabledAutomaticOutput(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->BDTR, TIM_BDTR_AOE) == (TIM_BDTR_AOE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the outputs (set the MOE bit in TIMx_BDTR register).
  * @rmtoll
  *  BDTR         MOE           LL_TIM_EnableAllOutputs
  * @param  timx Timer instance
  * @note The MOE bit in TIMx_BDTR register allows to enable /disable the outputs by
  *       software and is reset in case of break or break2 event
  * @note Macro IS_TIM_BREAK_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides a break input.
  */
__STATIC_INLINE void LL_TIM_EnableAllOutputs(TIM_TypeDef *timx)
{
  STM32_SET_BIT(timx->BDTR, TIM_BDTR_MOE);
}

/**
  * @brief  Disable the outputs (reset the MOE bit in TIMx_BDTR register).
  * @rmtoll
  *  BDTR         MOE           LL_TIM_DisableAllOutputs
  * @param  timx Timer instance
  * @note The MOE bit in TIMx_BDTR register allows to enable /disable the outputs by
  *       software and is reset in case of break or break2 event.
  * @note Macro IS_TIM_BREAK_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides a break input.
  */
__STATIC_INLINE void LL_TIM_DisableAllOutputs(TIM_TypeDef *timx)
{
  STM32_CLEAR_BIT(timx->BDTR, TIM_BDTR_MOE);
}

/**
  * @brief  Indicates whether outputs are enabled.
  * @rmtoll
  *  BDTR         MOE           LL_TIM_IsEnabledAllOutputs
  * @param  timx Timer instance
  * @note Macro IS_TIM_BREAK_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides a break input.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsEnabledAllOutputs(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->BDTR, TIM_BDTR_MOE) == (TIM_BDTR_MOE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable a break input.
  * @rmtoll
  *  BDTR         BKE     LL_TIM_EnableBreakInput \n
  *  BDTR         BK2E    LL_TIM_EnableBreakInput
  * @param  timx Timer instance
  * @param  break_input This parameter can be one of the following values:
  *         @arg @ref LL_TIM_BREAK_INPUT_1
  *         @arg @ref LL_TIM_BREAK_INPUT_2
  * @note Macro IS_TIM_BREAK_INSTANCE(timx) (IS_TIM_BKIN2_INSTANCE(timx))
  *       can be used to check whether or not a timer instance provides
  *       a break input (resp. a break2 input).
  */
__STATIC_INLINE void LL_TIM_EnableBreakInput(TIM_TypeDef *timx, uint32_t break_input)
{
  STM32_SET_BIT(timx->BDTR, LL_TIM_MASK_TAB_BKxE[break_input]);
}

/**
  * @brief  Disable a break input.
  * @rmtoll
  *  BDTR         BKE     LL_TIM_DisableBreakInput \n
  *  BDTR         BK2E    LL_TIM_DisableBreakInput
  * @param  timx Timer instance
  * @param  break_input This parameter can be one of the following values:
  *         @arg @ref LL_TIM_BREAK_INPUT_1
  *         @arg @ref LL_TIM_BREAK_INPUT_2
  * @note Macro IS_TIM_BREAK_INSTANCE(timx) (IS_TIM_BKIN2_INSTANCE(timx))
  *       can be used to check whether or not a timer instance provides
  *       a break input (resp. a break2 input).
  */
__STATIC_INLINE void LL_TIM_DisableBreakInput(TIM_TypeDef *timx, uint32_t break_input)
{
  STM32_CLEAR_BIT(timx->BDTR, LL_TIM_MASK_TAB_BKxE[break_input]);
}

/**
  * @brief  Indicates whether the input is enabled or not.
  * @rmtoll
  *  BDTR         BKE     LL_TIM_IsEnabledBreakInput \n
  *  BDTR         BK2E    LL_TIM_IsEnabledBreakInput
  * @param  timx Timer instance
  * @param  break_input This parameter can be one of the following values:
  *         @arg @ref LL_TIM_BREAK_INPUT_1
  *         @arg @ref LL_TIM_BREAK_INPUT_2
  * @note Macro IS_TIM_BREAK_INSTANCE(timx) (IS_TIM_BKIN2_INSTANCE(timx))
  *       can be used to check whether or not a timer instance provides
  *       a break input (resp. a break2 input).
  */
__STATIC_INLINE uint32_t LL_TIM_IsEnabledBreakInput(const TIM_TypeDef *timx, uint32_t break_input)
{
  uint32_t bitfield = LL_TIM_MASK_TAB_BKxE[break_input];
  return ((STM32_READ_BIT(timx->BDTR, bitfield) == bitfield) ? 1UL : 0UL);
}

/**
  * @brief  Set the polarity of a break input.
  * @rmtoll
  *  BDTR         BKP     LL_TIM_SetBreakInputPolarity \n
  *  BDTR         BK2P    LL_TIM_SetBreakInputPolarity
  * @param  timx Timer instance
  * @param  break_input This parameter can be one of the following values:
  *         @arg @ref LL_TIM_BREAK_INPUT_1
  *         @arg @ref LL_TIM_BREAK_INPUT_2
  * @param  break_polarity This parameter can be one of the following values:
  *         @arg @ref LL_TIM_BREAK_POLARITY_LOW  or LL_TIM_BREAK2_POLARITY_LOW
  *         @arg @ref LL_TIM_BREAK_POLARITY_HIGH or LL_TIM_BREAK2_POLARITY_HIGH
  */
__STATIC_INLINE void LL_TIM_SetBreakInputPolarity(TIM_TypeDef *timx, uint32_t break_input, uint32_t break_polarity)
{
  STM32_MODIFY_REG(timx->BDTR, LL_TIM_MASK_TAB_BKxP[break_input], break_polarity);
}

/**
  * @brief  Get the polarity of a break input.
  * @rmtoll
  *  BDTR         BKP     LL_TIM_GetBreakInputPolarity \n
  *  BDTR         BK2P    LL_TIM_GetBreakInputPolarity
  * @param  timx Timer instance
  * @param  break_input This parameter can be one of the following values:
  *         @arg @ref LL_TIM_BREAK_INPUT_1
  *         @arg @ref LL_TIM_BREAK_INPUT_2
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_TIM_BREAK_POLARITY_LOW  or @arg @ref LL_TIM_BREAK2_POLARITY_LOW
  *         @arg @ref LL_TIM_BREAK_POLARITY_HIGH or @arg @ref LL_TIM_BREAK2_POLARITY_HIGH
  */
__STATIC_INLINE uint32_t LL_TIM_GetBreakInputPolarity(const TIM_TypeDef *timx, uint32_t break_input)
{
  return (uint32_t)(STM32_READ_BIT(timx->BDTR, LL_TIM_MASK_TAB_BKxP[break_input]));
}

/**
  * @brief  Set the digital filter of a break input.
  * @rmtoll
  *  BDTR         BKF     LL_TIM_SetBreakInputFilter \n
  *  BDTR         BK2F    LL_TIM_SetBreakInputFilter
  * @param  timx Timer instance
  * @param  break_input This parameter can be one of the following values:
  *         @arg @ref LL_TIM_BREAK_INPUT_1
  *         @arg @ref LL_TIM_BREAK_INPUT_2
  * @param  break_filter This parameter can be one of the following values:
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV1     or @arg @ref LL_TIM_BREAK2_FILTER_FDIV1
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV1_N2  or @arg @ref LL_TIM_BREAK2_FILTER_FDIV1_N2
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV1_N4  or @arg @ref LL_TIM_BREAK2_FILTER_FDIV1_N4
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV1_N8  or @arg @ref LL_TIM_BREAK2_FILTER_FDIV1_N8
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV2_N6  or @arg @ref LL_TIM_BREAK2_FILTER_FDIV2_N6
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV2_N8  or @arg @ref LL_TIM_BREAK2_FILTER_FDIV2_N8
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV4_N6  or @arg @ref LL_TIM_BREAK2_FILTER_FDIV4_N6
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV4_N8  or @arg @ref LL_TIM_BREAK2_FILTER_FDIV4_N8
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV8_N6  or @arg @ref LL_TIM_BREAK2_FILTER_FDIV8_N6
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV8_N8  or @arg @ref LL_TIM_BREAK2_FILTER_FDIV8_N8
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV16_N5 or @arg @ref LL_TIM_BREAK2_FILTER_FDIV16_N5
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV16_N6 or @arg @ref LL_TIM_BREAK2_FILTER_FDIV16_N6
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV16_N8 or @arg @ref LL_TIM_BREAK2_FILTER_FDIV16_N8
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV32_N5 or @arg @ref LL_TIM_BREAK2_FILTER_FDIV32_N5
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV32_N6 or @arg @ref LL_TIM_BREAK2_FILTER_FDIV32_N6
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV32_N8 or @arg @ref LL_TIM_BREAK2_FILTER_FDIV32_N8
  */
__STATIC_INLINE void LL_TIM_SetBreakInputFilter(TIM_TypeDef *timx, uint32_t break_input, uint32_t break_filter)
{
  STM32_MODIFY_REG(timx->BDTR, LL_TIM_MASK_TAB_BKxF[break_input], break_filter);
}

/**
  * @brief  Get the digital filter of a break input.
  * @rmtoll
  *  BDTR         BKF     LL_TIM_GetBreakInputFilter \n
  *  BDTR         BK2F    LL_TIM_GetBreakInputFilter
  * @param  timx Timer instance
  * @param  break_input This parameter can be one of the following values:
  *         @arg @ref LL_TIM_BREAK_INPUT_1
  *         @arg @ref LL_TIM_BREAK_INPUT_2
  * @retval  Returned value can be one of the following values:
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV1     or @arg @ref LL_TIM_BREAK2_FILTER_FDIV1
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV1_N2  or @arg @ref LL_TIM_BREAK2_FILTER_FDIV1_N2
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV1_N4  or @arg @ref LL_TIM_BREAK2_FILTER_FDIV1_N4
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV1_N8  or @arg @ref LL_TIM_BREAK2_FILTER_FDIV1_N8
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV2_N6  or @arg @ref LL_TIM_BREAK2_FILTER_FDIV2_N6
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV2_N8  or @arg @ref LL_TIM_BREAK2_FILTER_FDIV2_N8
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV4_N6  or @arg @ref LL_TIM_BREAK2_FILTER_FDIV4_N6
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV4_N8  or @arg @ref LL_TIM_BREAK2_FILTER_FDIV4_N8
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV8_N6  or @arg @ref LL_TIM_BREAK2_FILTER_FDIV8_N6
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV8_N8  or @arg @ref LL_TIM_BREAK2_FILTER_FDIV8_N8
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV16_N5 or @arg @ref LL_TIM_BREAK2_FILTER_FDIV16_N5
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV16_N6 or @arg @ref LL_TIM_BREAK2_FILTER_FDIV16_N6
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV16_N8 or @arg @ref LL_TIM_BREAK2_FILTER_FDIV16_N8
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV32_N5 or @arg @ref LL_TIM_BREAK2_FILTER_FDIV32_N5
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV32_N6 or @arg @ref LL_TIM_BREAK2_FILTER_FDIV32_N6
  *         @arg @ref LL_TIM_BREAK_FILTER_FDIV32_N8 or @arg @ref LL_TIM_BREAK2_FILTER_FDIV32_N8
  */
__STATIC_INLINE uint32_t LL_TIM_GetBreakInputFilter(const TIM_TypeDef *timx, uint32_t break_input)
{
  return (uint32_t)(STM32_READ_BIT(timx->BDTR, LL_TIM_MASK_TAB_BKxF[break_input]));
}

/**
  * @brief  Set the mode of a break input.
  * @rmtoll
  *  BDTR         BKBID     LL_TIM_SetBreakInputAFMode \n
  *  BDTR         BK2BID    LL_TIM_SetBreakInputAFMode
  * @param  timx Timer instance
  * @param  break_input This parameter can be one of the following values:
  *         @arg @ref LL_TIM_BREAK_INPUT_1
  *         @arg @ref LL_TIM_BREAK_INPUT_2
  * @param  break_afmode This parameter can be one of the following values:
  *         @arg @ref LL_TIM_BREAK_AFMODE_INPUT         or @arg @ref LL_TIM_BREAK2_AFMODE_INPUT
  *         @arg @ref LL_TIM_BREAK_AFMODE_BIDIRECTIONAL or @arg @ref LL_TIM_BREAK2_AFMODE_BIDIRECTIONAL
  */
__STATIC_INLINE void LL_TIM_SetBreakInputAFMode(TIM_TypeDef *timx, uint32_t break_input, uint32_t break_afmode)
{
  STM32_MODIFY_REG(timx->BDTR, LL_TIM_MASK_TAB_BKxBID[break_input], break_afmode);
}

/**
  * @brief  Get the mode of a break input.
  * @rmtoll
  *  BDTR         BKBID     LL_TIM_SetBreakInputAFMode \n
  *  BDTR         BK2BID    LL_TIM_SetBreakInputAFMode
  * @param  timx Timer instance
  * @param  break_input This parameter can be one of the following values:
  *         @arg @ref LL_TIM_BREAK_INPUT_1
  *         @arg @ref LL_TIM_BREAK_INPUT_2
  * @retval  Returned value can be one of the following values:
  *         @arg @ref LL_TIM_BREAK_AFMODE_INPUT         or @arg @ref LL_TIM_BREAK2_AFMODE_INPUT
  *         @arg @ref LL_TIM_BREAK_AFMODE_BIDIRECTIONAL or @arg @ref LL_TIM_BREAK2_AFMODE_BIDIRECTIONAL
  */
__STATIC_INLINE uint32_t LL_TIM_GetBreakInputAFMode(const TIM_TypeDef *timx, uint32_t break_input)
{
  return (uint32_t)(STM32_READ_BIT(timx->BDTR, LL_TIM_MASK_TAB_BKxBID[break_input]));
}

