MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_tim.h
/**
  * @brief  Enable the signals connected to the designated timer break input.
  * @rmtoll
  *  AF1          BKINE         LL_TIM_EnableBreakInputSource \n
  *  AF1          BKCMP1E       LL_TIM_EnableBreakInputSource \n
  *  AF1          BKCMP2E       LL_TIM_EnableBreakInputSource \n
  *  AF1          BKCMP3E       LL_TIM_EnableBreakInputSource \n
  *  AF1          BKCMP4E       LL_TIM_EnableBreakInputSource \n
  *  AF1          BKCMP5E       LL_TIM_EnableBreakInputSource \n
  *  AF1          BKCMP6E       LL_TIM_EnableBreakInputSource \n
  *  AF1          BKCMP8E       LL_TIM_EnableBreakInputSource \n
  *  AF1          BKCMP9E       LL_TIM_EnableBreakInputSource \n
  *  AF1          BKCMP10E      LL_TIM_EnableBreakInputSource \n
  *  AF1          BKCMP11E      LL_TIM_EnableBreakInputSource \n
  *  AF1          BKCMP13E      LL_TIM_EnableBreakInputSource \n
  *  AF1          BKCMP14E      LL_TIM_EnableBreakInputSource \n
  *  AF2          BK2INE        LL_TIM_EnableBreakInputSource \n
  *  AF2          BK2CMP1E      LL_TIM_EnableBreakInputSource \n
  *  AF2          BK2CMP2E      LL_TIM_EnableBreakInputSource \n
  *  AF2          BK2CMP3E      LL_TIM_EnableBreakInputSource \n
  *  AF2          BK2CMP4E      LL_TIM_EnableBreakInputSource \n
  *  AF2          BK2CMP5E      LL_TIM_EnableBreakInputSource \n
  *  AF2          BK2CMP6E      LL_TIM_EnableBreakInputSource \n
  *  AF2          BK2CMP7E      LL_TIM_EnableBreakInputSource \n
  *  AF2          BK2CMP13E     LL_TIM_EnableBreakInputSource \n
  *  AF2          BK2CMP14E     LL_TIM_EnableBreakInputSource
  * @param  timx Timer instance
  * @param  break_input This parameter can be one of the following values:
  *         @arg @ref LL_TIM_BREAK_INPUT_1
  *         @arg @ref LL_TIM_BREAK_INPUT_2
  * @param  source The break and break2 input source parameter depends on timx. Description is available only
  *         in the CHM version of the User Manual (not in the PDF).
  *
  *         The description below summarizes specific "Timer Instance" and "BREAK(2) input source"
  *         parameter possibilities:
  *
  *         TIM1: combination of the following values:
  *
  *            . . BREAK can be a combination of the following values
  *            LL_TIM_TIM1_BRK_GPIO
  *            LL_TIM_TIM1_BRK_COMP1_OUT
  * @if COMP2
  *            LL_TIM_TIM1_BRK_COMP2_OUT (*)
  * @endif
  * @if COMP3
  *            LL_TIM_TIM1_BRK_COMP3_OUT (*)
  *            LL_TIM_TIM1_BRK_COMP4_OUT (*)
  * @endif
  *            LL_TIM_TIM1_BRK_TIM8_BKIN
  *            LL_TIM_TIM1_BRK_TIM15_BKIN
  * @if TIM16
  *            LL_TIM_TIM1_BRK_TIM16_BKIN (*)
  *            LL_TIM_TIM1_BRK_TIM17_BKIN (*)
  * @endif
  * @if TIM20
  *            LL_TIM_TIM1_BRK_TIM20_BKIN (*)
  * @endif
  * @if PLAY1
  *            LL_TIM_TIM1_BRK_PLAY1_OUT0 (*)
  *            LL_TIM_TIM1_BRK_PLAY1_OUT1 (*)
  * @endif
  *
  * @if TIM20
  *            . . BREAK2 can be a combination of the following values
  *            LL_TIM_TIM1_BRK2_GPIO
  *            LL_TIM_TIM1_BRK2_COMP1_OUT
  * @if COMP2
  *            LL_TIM_TIM1_BRK2_COMP2_OUT (*)
  * @endif
  * @if COMP3
  *            LL_TIM_TIM1_BRK2_COMP3_OUT (*)
  *            LL_TIM_TIM1_BRK2_COMP4_OUT (*)
  * @endif
  *            LL_TIM_TIM1_BRK2_TIM8_BKIN2
  *            LL_TIM_TIM1_BRK2_TIM20_BKIN2 (*)
  * @if PLAY1
  *            LL_TIM_TIM1_BRK2_PLAY1_OUT2 (*)
  *            LL_TIM_TIM1_BRK2_PLAY1_OUT3 (*)
  * @endif
  * @endif
  *
  *         TIM8: combination of the following values:
  *
  *            . . BREAK can be a combination of the following values
  *            LL_TIM_TIM8_BRK_GPIO
  *            LL_TIM_TIM8_BRK_COMP1_OUT
  * @if COMP2
  *            LL_TIM_TIM8_BRK_COMP2_OUT (*)
  * @endif
  * @if COMP3
  *            LL_TIM_TIM8_BRK_COMP3_OUT (*)
  *            LL_TIM_TIM8_BRK_COMP4_OUT (*)
  * @endif
  *            LL_TIM_TIM8_BRK_TIM1_BKIN
  *            LL_TIM_TIM8_BRK_TIM15_BKIN
  * @if TIM16
  *            LL_TIM_TIM8_BRK_TIM16_BKIN (*)
  *            LL_TIM_TIM8_BRK_TIM17_BKIN (*)
  * @endif
  * @if TIM20
  *            LL_TIM_TIM8_BRK_TIM20_BKIN (*)
  * @endif
  * @if PLAY1
  *            LL_TIM_TIM8_BRK_PLAY1_OUT0 (*)
  *            LL_TIM_TIM8_BRK_PLAY1_OUT13 (*)
  * @endif
  *
  * @if TIM20
  *            . . BREAK2 can be a combination of the following values
  *            LL_TIM_TIM8_BRK2_GPIO
  *            LL_TIM_TIM8_BRK2_COMP1_OUT
  * @if COMP2
  *            LL_TIM_TIM8_BRK2_COMP2_OUT (*)
  * @endif
  * @if COMP3
  *            LL_TIM_TIM8_BRK2_COMP3_OUT (*)
  *            LL_TIM_TIM8_BRK2_COMP4_OUT (*)
  * @endif
  *            LL_TIM_TIM8_BRK2_TIM1_BKIN2
  *            LL_TIM_TIM8_BRK2_TIM20_BKIN2 (*)
  * @if PLAY1
  *            LL_TIM_TIM8_BRK2_PLAY1_OUT2 (*)
  *            LL_TIM_TIM8_BRK2_PLAY1_OUT15 (*)
  * @endif
  * @endif
  *
  *         TIM15: combination of the following values:
  *
  *            . . BREAK can be a combination of the following values
  *            LL_TIM_TIM15_BRK_GPIO
  *            LL_TIM_TIM15_BRK_COMP1_OUT
  * @if COMP2
  *            LL_TIM_TIM15_BRK_COMP2_OUT (*)
  * @endif
  * @if COMP3
  *            LL_TIM_TIM15_BRK_COMP3_OUT (*)
  *            LL_TIM_TIM15_BRK_COMP4_OUT (*)
  * @endif
  *            LL_TIM_TIM15_BRK_TIM1_BKIN
  *            LL_TIM_TIM15_BRK_TIM8_BKIN
  * @if TIM16
  *            LL_TIM_TIM15_BRK_TIM16_BKIN (*)
  *            LL_TIM_TIM15_BRK_TIM17_BKIN (*)
  * @endif
  * @if TIM20
  *            LL_TIM_TIM15_BRK_TIM20_BKIN (*)
  * @endif
  * @if PLAY1
  *            LL_TIM_TIM15_BRK_PLAY1_OUT4 (*)
  *            LL_TIM_TIM15_BRK_PLAY1_OUT5 (*)
  * @endif
  *
  * @if TIM16
  *         TIM16: combination of the following values: (**)
  *
  *            . . BREAK can be a combination of the following values
  *            LL_TIM_TIM16_BRK_GPIO
  *            LL_TIM_TIM16_BRK_COMP1_OUT
  * @if COMP3
  *            LL_TIM_TIM16_BRK_COMP2_OUT (*)
  *            LL_TIM_TIM16_BRK_COMP3_OUT (*)
  *            LL_TIM_TIM16_BRK_COMP4_OUT (*)
  * @endif
  *            LL_TIM_TIM16_BRK_TIM1_BKIN
  *            LL_TIM_TIM16_BRK_TIM8_BKIN
  *            LL_TIM_TIM16_BRK_TIM15_BKIN
  *            LL_TIM_TIM16_BRK_TIM17_BKIN
  * @if TIM20
  *            LL_TIM_TIM16_BRK_TIM20_BKIN (*)
  * @endif
  * @if PLAY1
  *            LL_TIM_TIM16_BRK_PLAY1_OUT4 (*)
  *            LL_TIM_TIM16_BRK_PLAY1_OUT7 (*)
  * @endif
  * @endif
  *
  * @if TIM17
  *         TIM17: combination of the following values: (**)
  *
  *            . . BREAK can be a combination of the following values
  *            LL_TIM_TIM17_BRK_GPIO
  *            LL_TIM_TIM17_BRK_COMP1_OUT
  * @if COMP3
  *            LL_TIM_TIM17_BRK_COMP2_OUT (*)
  *            LL_TIM_TIM17_BRK_COMP3_OUT (*)
  *            LL_TIM_TIM17_BRK_COMP4_OUT (*)
  * @endif
  *            LL_TIM_TIM17_BRK_TIM1_BKIN
  *            LL_TIM_TIM17_BRK_TIM8_BKIN
  *            LL_TIM_TIM17_BRK_TIM15_BKIN
  *            LL_TIM_TIM17_BRK_TIM16_BKIN
  * @if TIM20
  *            LL_TIM_TIM17_BRK_TIM20_BKIN (*)
  * @endif
  * @if PLAY1
  *            LL_TIM_TIM17_BRK_PLAY1_OUT4 (*)
  *            LL_TIM_TIM17_BRK_PLAY1_OUT12 (*)
  * @endif
  * @endif
  *
  * @if TIM20
  *         TIM20: combination of the following values: (**)
  *
  *            . . BREAK can be a combination of the following values
  *            LL_TIM_TIM20_BRK_GPIO
  *            LL_TIM_TIM20_BRK_COMP1_OUT
  * @if COMP3
  *            LL_TIM_TIM20_BRK_COMP2_OUT (*)
  *            LL_TIM_TIM20_BRK_COMP3_OUT (*)
  *            LL_TIM_TIM20_BRK_COMP4_OUT (*)
  * @endif
  *            LL_TIM_TIM20_BRK_TIM1_BKIN
  *            LL_TIM_TIM20_BRK_TIM8_BKIN
  *            LL_TIM_TIM20_BRK_TIM15_BKIN
  *            LL_TIM_TIM20_BRK_TIM16_BKIN
  *            LL_TIM_TIM20_BRK_TIM17_BKIN
  * @if PLAY1
  *            LL_TIM_TIM20_BRK_PLAY1_OUT0 (*)
  *            LL_TIM_TIM20_BRK_PLAY1_OUT9 (*)
  * @endif
  *
  *            . . BREAK2 can be a combination of the following values
  *            LL_TIM_TIM20_BRK2_GPIO
  *            LL_TIM_TIM20_BRK2_COMP1_OUT
  * @if COMP3
  *            LL_TIM_TIM20_BRK2_COMP2_OUT (*)
  *            LL_TIM_TIM20_BRK2_COMP3_OUT (*)
  *            LL_TIM_TIM20_BRK2_COMP4_OUT (*)
  * @endif
  *            LL_TIM_TIM20_BRK2_TIM1_BKIN2
  *            LL_TIM_TIM20_BRK2_TIM8_BKIN2
  * @if PLAY1
  *            LL_TIM_TIM20_BRK2_PLAY1_OUT2 (*)
  *            LL_TIM_TIM20_BRK2_PLAY1_OUT11 (*)
  * @endif
  * @endif
  *
  *         (*)  Value not defined in all devices.
  *         (**) Timer instance not available on all devices.


  */
__STATIC_INLINE void LL_TIM_EnableBreakInputSource(TIM_TypeDef *timx, uint32_t break_input, uint32_t source)
{
  __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&timx->AF1) + (break_input << 2)));
  STM32_SET_BIT(*pReg, source);
}

/**
  * @brief  Disable the signals connected to the designated timer break input.
  * @rmtoll
  *  AF1          BKINE         LL_TIM_DisableBreakInputSource \n
  *  AF1          BKCMP1E       LL_TIM_DisableBreakInputSource \n
  *  AF1          BKCMP2E       LL_TIM_DisableBreakInputSource \n
  *  AF1          BKCMP3E       LL_TIM_DisableBreakInputSource \n
  *  AF1          BKCMP4E       LL_TIM_DisableBreakInputSource \n
  *  AF1          BKCMP5E       LL_TIM_DisableBreakInputSource \n
  *  AF1          BKCMP6E       LL_TIM_DisableBreakInputSource \n
  *  AF1          BKCMP8E       LL_TIM_DisableBreakInputSource \n
  *  AF1          BKCMP9E       LL_TIM_DisableBreakInputSource \n
  *  AF1          BKCMP10E      LL_TIM_DisableBreakInputSource \n
  *  AF1          BKCMP11E      LL_TIM_DisableBreakInputSource \n
  *  AF1          BKCMP13E      LL_TIM_DisableBreakInputSource \n
  *  AF1          BKCMP14E      LL_TIM_DisableBreakInputSource \n
  *  AF2          BK2INE        LL_TIM_DisableBreakInputSource \n
  *  AF2          BK2CMP1E      LL_TIM_DisableBreakInputSource \n
  *  AF2          BK2CMP2E      LL_TIM_DisableBreakInputSource \n
  *  AF2          BK2CMP3E      LL_TIM_DisableBreakInputSource \n
  *  AF2          BK2CMP4E      LL_TIM_DisableBreakInputSource \n
  *  AF2          BK2CMP5E      LL_TIM_DisableBreakInputSource \n
  *  AF2          BK2CMP6E      LL_TIM_DisableBreakInputSource \n
  *  AF2          BK2CMP7E      LL_TIM_DisableBreakInputSource \n
  *  AF2          BK2CMP13E     LL_TIM_DisableBreakInputSource \n
  *  AF2          BK2CMP14E     LL_TIM_DisableBreakInputSource
  * @param  timx Timer instance
  * @param  break_input This parameter can be one of the following values:
  *         @arg @ref LL_TIM_BREAK_INPUT_1
  *         @arg @ref LL_TIM_BREAK_INPUT_2
  * @param  source The break and break2 input source parameter depends on timx. Description is available only
  *         in the CHM version of the User Manual (not in the PDF).
  *
  *         The description below summarizes specific "Timer Instance" and "BREAK(2) input source"
  *         parameter possibilities:
  *
  *         TIM1: combination of the following values:
  *
  *            . . BREAK can be a combination of the following values
  *            LL_TIM_TIM1_BRK_GPIO
  *            LL_TIM_TIM1_BRK_COMP1_OUT
  * @if COMP2
  *            LL_TIM_TIM1_BRK_COMP2_OUT (*)
  * @endif
  * @if COMP3
  *            LL_TIM_TIM1_BRK_COMP3_OUT (*)
  *            LL_TIM_TIM1_BRK_COMP4_OUT (*)
  * @endif
  *            LL_TIM_TIM1_BRK_TIM8_BKIN
  *            LL_TIM_TIM1_BRK_TIM15_BKIN
  * @if TIM16
  *            LL_TIM_TIM1_BRK_TIM16_BKIN (*)
  *            LL_TIM_TIM1_BRK_TIM17_BKIN (*)
  * @endif
  * @if TIM20
  *            LL_TIM_TIM1_BRK_TIM20_BKIN (*)
  * @endif
  * @if PLAY1
  *            LL_TIM_TIM1_BRK_PLAY1_OUT0 (*)
  *            LL_TIM_TIM1_BRK_PLAY1_OUT1 (*)
  * @endif
  *
  * @if TIM20
  *            . . BREAK2 can be a combination of the following values
  *            LL_TIM_TIM1_BRK2_GPIO
  *            LL_TIM_TIM1_BRK2_COMP1_OUT
  * @if COMP2
  *            LL_TIM_TIM1_BRK2_COMP2_OUT (*)
  * @endif
  * @if COMP3
  *            LL_TIM_TIM1_BRK2_COMP3_OUT (*)
  *            LL_TIM_TIM1_BRK2_COMP4_OUT (*)
  * @endif
  *            LL_TIM_TIM1_BRK2_TIM8_BKIN2
  *            LL_TIM_TIM1_BRK2_TIM20_BKIN2 (*)
  * @if PLAY1
  *            LL_TIM_TIM1_BRK2_PLAY1_OUT2 (*)
  *            LL_TIM_TIM1_BRK2_PLAY1_OUT3 (*)
  * @endif
  * @endif
  *
  *         TIM8: combination of the following values:
  *
  *            . . BREAK can be a combination of the following values
  *            LL_TIM_TIM8_BRK_GPIO
  *            LL_TIM_TIM8_BRK_COMP1_OUT
  * @if COMP2
  *            LL_TIM_TIM8_BRK_COMP2_OUT (*)
  * @endif
  * @if COMP3
  *            LL_TIM_TIM8_BRK_COMP3_OUT (*)
  *            LL_TIM_TIM8_BRK_COMP4_OUT (*)
  * @endif
  *            LL_TIM_TIM8_BRK_TIM1_BKIN
  *            LL_TIM_TIM8_BRK_TIM15_BKIN
  * @if TIM16
  *            LL_TIM_TIM8_BRK_TIM16_BKIN (*)
  *            LL_TIM_TIM8_BRK_TIM17_BKIN (*)
  * @endif
  * @if TIM20
  *            LL_TIM_TIM8_BRK_TIM20_BKIN (*)
  * @endif
  * @if PLAY1
  *            LL_TIM_TIM8_BRK_PLAY1_OUT0 (*)
  *            LL_TIM_TIM8_BRK_PLAY1_OUT13 (*)
  * @endif
  *
  * @if TIM20
  *            . . BREAK2 can be a combination of the following values
  *            LL_TIM_TIM8_BRK2_GPIO
  *            LL_TIM_TIM8_BRK2_COMP1_OUT
  * @if COMP2
  *            LL_TIM_TIM8_BRK2_COMP2_OUT (*)
  * @endif
  * @if COMP3
  *            LL_TIM_TIM8_BRK2_COMP3_OUT (*)
  *            LL_TIM_TIM8_BRK2_COMP4_OUT (*)
  * @endif
  *            LL_TIM_TIM8_BRK2_TIM1_BKIN2
  *            LL_TIM_TIM8_BRK2_TIM20_BKIN2 (*)
  * @if PLAY1
  *            LL_TIM_TIM8_BRK2_PLAY1_OUT2 (*)
  *            LL_TIM_TIM8_BRK2_PLAY1_OUT15 (*)
  * @endif
  * @endif
  *
  *         TIM15: combination of the following values:
  *
  *            . . BREAK can be a combination of the following values
  *            LL_TIM_TIM15_BRK_GPIO
  *            LL_TIM_TIM15_BRK_COMP1_OUT
  * @if COMP2
  *            LL_TIM_TIM15_BRK_COMP2_OUT (*)
  * @endif
  * @if COMP3
  *            LL_TIM_TIM15_BRK_COMP3_OUT (*)
  *            LL_TIM_TIM15_BRK_COMP4_OUT (*)
  * @endif
  *            LL_TIM_TIM15_BRK_TIM1_BKIN
  *            LL_TIM_TIM15_BRK_TIM8_BKIN
  * @if TIM16
  *            LL_TIM_TIM15_BRK_TIM16_BKIN (*)
  *            LL_TIM_TIM15_BRK_TIM17_BKIN (*)
  * @endif
  * @if TIM20
  *            LL_TIM_TIM15_BRK_TIM20_BKIN (*)
  * @endif
  * @if PLAY1
  *            LL_TIM_TIM15_BRK_PLAY1_OUT4 (*)
  *            LL_TIM_TIM15_BRK_PLAY1_OUT5 (*)
  * @endif
  *
  * @if TIM16
  *         TIM16: combination of the following values: (**)
  *
  *            . . BREAK can be a combination of the following values
  *            LL_TIM_TIM16_BRK_GPIO
  *            LL_TIM_TIM16_BRK_COMP1_OUT
  * @if COMP3
  *            LL_TIM_TIM16_BRK_COMP2_OUT (*)
  *            LL_TIM_TIM16_BRK_COMP3_OUT (*)
  *            LL_TIM_TIM16_BRK_COMP4_OUT (*)
  * @endif
  *            LL_TIM_TIM16_BRK_TIM1_BKIN
  *            LL_TIM_TIM16_BRK_TIM8_BKIN
  *            LL_TIM_TIM16_BRK_TIM15_BKIN
  *            LL_TIM_TIM16_BRK_TIM17_BKIN
  * @if TIM20
  *            LL_TIM_TIM16_BRK_TIM20_BKIN (*)
  * @endif
  * @if PLAY1
  *            LL_TIM_TIM16_BRK_PLAY1_OUT4 (*)
  *            LL_TIM_TIM16_BRK_PLAY1_OUT7 (*)
  * @endif
  * @endif
  *
  * @if TIM17
  *         TIM17: combination of the following values: (**)
  *
  *            . . BREAK can be a combination of the following values
  *            LL_TIM_TIM17_BRK_GPIO
  *            LL_TIM_TIM17_BRK_COMP1_OUT
  * @if COMP3
  *            LL_TIM_TIM17_BRK_COMP2_OUT (*)
  *            LL_TIM_TIM17_BRK_COMP3_OUT (*)
  *            LL_TIM_TIM17_BRK_COMP4_OUT (*)
  * @endif
  *            LL_TIM_TIM17_BRK_TIM1_BKIN
  *            LL_TIM_TIM17_BRK_TIM8_BKIN
  *            LL_TIM_TIM17_BRK_TIM15_BKIN
  *            LL_TIM_TIM17_BRK_TIM16_BKIN
  * @if TIM20
  *            LL_TIM_TIM17_BRK_TIM20_BKIN (*)
  * @endif
  * @if PLAY1
  *            LL_TIM_TIM17_BRK_PLAY1_OUT4 (*)
  *            LL_TIM_TIM17_BRK_PLAY1_OUT12 (*)
  * @endif
  * @endif
  *
  * @if TIM20
  *         TIM20: combination of the following values: (**)
  *
  *            . . BREAK can be a combination of the following values
  *            LL_TIM_TIM20_BRK_GPIO
  *            LL_TIM_TIM20_BRK_COMP1_OUT
  * @if COMP3
  *            LL_TIM_TIM20_BRK_COMP2_OUT (*)
  *            LL_TIM_TIM20_BRK_COMP3_OUT (*)
  *            LL_TIM_TIM20_BRK_COMP4_OUT (*)
  * @endif
  *            LL_TIM_TIM20_BRK_TIM1_BKIN
  *            LL_TIM_TIM20_BRK_TIM8_BKIN
  *            LL_TIM_TIM20_BRK_TIM15_BKIN
  *            LL_TIM_TIM20_BRK_TIM16_BKIN
  *            LL_TIM_TIM20_BRK_TIM17_BKIN
  * @if PLAY1
  *            LL_TIM_TIM20_BRK_PLAY1_OUT0 (*)
  *            LL_TIM_TIM20_BRK_PLAY1_OUT9 (*)
  * @endif
  *
  *            . . BREAK2 can be a combination of the following values
  *            LL_TIM_TIM20_BRK2_GPIO
  *            LL_TIM_TIM20_BRK2_COMP1_OUT
  * @if COMP3
  *            LL_TIM_TIM20_BRK2_COMP2_OUT (*)
  *            LL_TIM_TIM20_BRK2_COMP3_OUT (*)
  *            LL_TIM_TIM20_BRK2_COMP4_OUT (*)
  * @endif
  *            LL_TIM_TIM20_BRK2_TIM1_BKIN2
  *            LL_TIM_TIM20_BRK2_TIM8_BKIN2
  * @if PLAY1
  *            LL_TIM_TIM20_BRK2_PLAY1_OUT2 (*)
  *            LL_TIM_TIM20_BRK2_PLAY1_OUT11 (*)
  * @endif
  * @endif
  *
  *         (*)  Value not defined in all devices.
  *         (**) Timer instance not available on all devices.


  */
__STATIC_INLINE void LL_TIM_DisableBreakInputSource(TIM_TypeDef *timx, uint32_t break_input, uint32_t source)
{
  __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&timx->AF1) + (break_input << 2)));
  STM32_CLEAR_BIT(*pReg, source);
}

