MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_tim.h
/**
  * @brief  Indicates whether a break input source is enabled or not.
  * @rmtoll
  *  AF1          BKINE         LL_TIM_IsEnabledBreakInputSource \n
  *  AF1          BKCMP1E       LL_TIM_IsEnabledBreakInputSource \n
  *  AF1          BKCMP2E       LL_TIM_IsEnabledBreakInputSource \n
  *  AF1          BKCMP3E       LL_TIM_IsEnabledBreakInputSource \n
  *  AF1          BKCMP4E       LL_TIM_IsEnabledBreakInputSource \n
  *  AF1          BKCMP5E       LL_TIM_IsEnabledBreakInputSource \n
  *  AF1          BKCMP6E       LL_TIM_IsEnabledBreakInputSource \n
  *  AF1          BKCMP8E       LL_TIM_IsEnabledBreakInputSource \n
  *  AF1          BKCMP9E       LL_TIM_IsEnabledBreakInputSource \n
  *  AF1          BKCMP10E      LL_TIM_IsEnabledBreakInputSource \n
  *  AF1          BKCMP11E      LL_TIM_IsEnabledBreakInputSource \n
  *  AF1          BKCMP13E      LL_TIM_IsEnabledBreakInputSource \n
  *  AF1          BKCMP14E      LL_TIM_IsEnabledBreakInputSource \n
  *  AF2          BK2INE        LL_TIM_IsEnabledBreakInputSource \n
  *  AF2          BK2CMP1E      LL_TIM_IsEnabledBreakInputSource \n
  *  AF2          BK2CMP2E      LL_TIM_IsEnabledBreakInputSource \n
  *  AF2          BK2CMP3E      LL_TIM_IsEnabledBreakInputSource \n
  *  AF2          BK2CMP4E      LL_TIM_IsEnabledBreakInputSource \n
  *  AF2          BK2CMP5E      LL_TIM_IsEnabledBreakInputSource \n
  *  AF2          BK2CMP6E      LL_TIM_IsEnabledBreakInputSource \n
  *  AF2          BK2CMP7E      LL_TIM_IsEnabledBreakInputSource \n
  *  AF2          BK2CMP13E     LL_TIM_IsEnabledBreakInputSource \n
  *  AF2          BK2CMP14E     LL_TIM_IsEnabledBreakInputSource
  * @param  timx Timer instance
  * @param  break_input This parameter can be one of the following values:
  *         @arg @ref LL_TIM_BREAK_INPUT_1
  *         @arg @ref LL_TIM_BREAK_INPUT_2
  * @param  source The break and break2 input source parameter depends on timx. Description is available only
  *         in the CHM version of the User Manual (not in the PDF).
  *
  *         The description below summarizes specific "Timer Instance" and "BREAK(2) input source"
  *         parameter possibilities:
  *
  *         TIM1: combination of the following values:
  *
  *            . . BREAK can be a combination of the following values
  *            LL_TIM_TIM1_BRK_GPIO
  *            LL_TIM_TIM1_BRK_COMP1_OUT
  * @if COMP2
  *            LL_TIM_TIM1_BRK_COMP2_OUT (*)
  * @endif
  * @if COMP3
  *            LL_TIM_TIM1_BRK_COMP3_OUT (*)
  *            LL_TIM_TIM1_BRK_COMP4_OUT (*)
  * @endif
  *            LL_TIM_TIM1_BRK_TIM8_BKIN
  *            LL_TIM_TIM1_BRK_TIM15_BKIN
  * @if TIM16
  *            LL_TIM_TIM1_BRK_TIM16_BKIN (*)
  *            LL_TIM_TIM1_BRK_TIM17_BKIN (*)
  * @endif
  * @if TIM20
  *            LL_TIM_TIM1_BRK_TIM20_BKIN (*)
  * @endif
  * @if PLAY1
  *            LL_TIM_TIM1_BRK_PLAY1_OUT0 (*)
  *            LL_TIM_TIM1_BRK_PLAY1_OUT1 (*)
  * @endif
  *
  * @if TIM20
  *            . . BREAK2 can be a combination of the following values
  *            LL_TIM_TIM1_BRK2_GPIO
  *            LL_TIM_TIM1_BRK2_COMP1_OUT
  * @if COMP2
  *            LL_TIM_TIM1_BRK2_COMP2_OUT (*)
  * @endif
  * @if COMP3
  *            LL_TIM_TIM1_BRK2_COMP3_OUT (*)
  *            LL_TIM_TIM1_BRK2_COMP4_OUT (*)
  * @endif
  *            LL_TIM_TIM1_BRK2_TIM8_BKIN2
  *            LL_TIM_TIM1_BRK2_TIM20_BKIN2 (*)
  * @if PLAY1
  *            LL_TIM_TIM1_BRK2_PLAY1_OUT2 (*)
  *            LL_TIM_TIM1_BRK2_PLAY1_OUT3 (*)
  * @endif
  * @endif
  *
  *         TIM8: combination of the following values:
  *
  *            . . BREAK can be a combination of the following values
  *            LL_TIM_TIM8_BRK_GPIO
  *            LL_TIM_TIM8_BRK_COMP1_OUT
  * @if COMP2
  *            LL_TIM_TIM8_BRK_COMP2_OUT (*)
  * @endif
  * @if COMP3
  *            LL_TIM_TIM8_BRK_COMP3_OUT (*)
  *            LL_TIM_TIM8_BRK_COMP4_OUT (*)
  * @endif
  *            LL_TIM_TIM8_BRK_TIM1_BKIN
  *            LL_TIM_TIM8_BRK_TIM15_BKIN
  * @if TIM16
  *            LL_TIM_TIM8_BRK_TIM16_BKIN (*)
  *            LL_TIM_TIM8_BRK_TIM17_BKIN (*)
  * @endif
  * @if TIM20
  *            LL_TIM_TIM8_BRK_TIM20_BKIN (*)
  * @endif
  * @if PLAY1
  *            LL_TIM_TIM8_BRK_PLAY1_OUT0 (*)
  *            LL_TIM_TIM8_BRK_PLAY1_OUT13 (*)
  * @endif
  *
  * @if TIM20
  *            . . BREAK2 can be a combination of the following values
  *            LL_TIM_TIM8_BRK2_GPIO
  *            LL_TIM_TIM8_BRK2_COMP1_OUT
  * @if COMP2
  *            LL_TIM_TIM8_BRK2_COMP2_OUT (*)
  * @endif
  * @if COMP3
  *            LL_TIM_TIM8_BRK2_COMP3_OUT (*)
  *            LL_TIM_TIM8_BRK2_COMP4_OUT (*)
  * @endif
  *            LL_TIM_TIM8_BRK2_TIM1_BKIN2
  *            LL_TIM_TIM8_BRK2_TIM20_BKIN2 (*)
  * @if PLAY1
  *            LL_TIM_TIM8_BRK2_PLAY1_OUT2 (*)
  *            LL_TIM_TIM8_BRK2_PLAY1_OUT15 (*)
  * @endif
  * @endif
  *
  *         TIM15: combination of the following values:
  *
  *            . . BREAK can be a combination of the following values
  *            LL_TIM_TIM15_BRK_GPIO
  *            LL_TIM_TIM15_BRK_COMP1_OUT
  * @if COMP2
  *            LL_TIM_TIM15_BRK_COMP2_OUT (*)
  * @endif
  * @if COMP3
  *            LL_TIM_TIM15_BRK_COMP3_OUT (*)
  *            LL_TIM_TIM15_BRK_COMP4_OUT (*)
  * @endif
  *            LL_TIM_TIM15_BRK_TIM1_BKIN
  *            LL_TIM_TIM15_BRK_TIM8_BKIN
  * @if TIM16
  *            LL_TIM_TIM15_BRK_TIM16_BKIN (*)
  *            LL_TIM_TIM15_BRK_TIM17_BKIN (*)
  * @endif
  * @if TIM20
  *            LL_TIM_TIM15_BRK_TIM20_BKIN (*)
  * @endif
  * @if PLAY1
  *            LL_TIM_TIM15_BRK_PLAY1_OUT4 (*)
  *            LL_TIM_TIM15_BRK_PLAY1_OUT5 (*)
  * @endif
  *
  * @if TIM16
  *         TIM16: combination of the following values: (**)
  *
  *            . . BREAK can be a combination of the following values
  *            LL_TIM_TIM16_BRK_GPIO
  *            LL_TIM_TIM16_BRK_COMP1_OUT
  * @if COMP3
  *            LL_TIM_TIM16_BRK_COMP2_OUT (*)
  *            LL_TIM_TIM16_BRK_COMP3_OUT (*)
  *            LL_TIM_TIM16_BRK_COMP4_OUT (*)
  * @endif
  *            LL_TIM_TIM16_BRK_TIM1_BKIN
  *            LL_TIM_TIM16_BRK_TIM8_BKIN
  *            LL_TIM_TIM16_BRK_TIM15_BKIN
  *            LL_TIM_TIM16_BRK_TIM17_BKIN
  * @if TIM20
  *            LL_TIM_TIM16_BRK_TIM20_BKIN (*)
  * @endif
  * @if PLAY1
  *            LL_TIM_TIM16_BRK_PLAY1_OUT4 (*)
  *            LL_TIM_TIM16_BRK_PLAY1_OUT7 (*)
  * @endif
  * @endif
  *
  * @if TIM17
  *         TIM17: combination of the following values: (**)
  *
  *            . . BREAK can be a combination of the following values
  *            LL_TIM_TIM17_BRK_GPIO
  *            LL_TIM_TIM17_BRK_COMP1_OUT
  * @if COMP3
  *            LL_TIM_TIM17_BRK_COMP2_OUT (*)
  *            LL_TIM_TIM17_BRK_COMP3_OUT (*)
  *            LL_TIM_TIM17_BRK_COMP4_OUT (*)
  * @endif
  *            LL_TIM_TIM17_BRK_TIM1_BKIN
  *            LL_TIM_TIM17_BRK_TIM8_BKIN
  *            LL_TIM_TIM17_BRK_TIM15_BKIN
  *            LL_TIM_TIM17_BRK_TIM16_BKIN
  * @if TIM20
  *            LL_TIM_TIM17_BRK_TIM20_BKIN (*)
  * @endif
  * @if PLAY1
  *            LL_TIM_TIM17_BRK_PLAY1_OUT4 (*)
  *            LL_TIM_TIM17_BRK_PLAY1_OUT12 (*)
  * @endif
  * @endif
  *
  * @if TIM20
  *         TIM20: combination of the following values: (**)
  *
  *            . . BREAK can be a combination of the following values
  *            LL_TIM_TIM20_BRK_GPIO
  *            LL_TIM_TIM20_BRK_COMP1_OUT
  * @if COMP3
  *            LL_TIM_TIM20_BRK_COMP2_OUT (*)
  *            LL_TIM_TIM20_BRK_COMP3_OUT (*)
  *            LL_TIM_TIM20_BRK_COMP4_OUT (*)
  * @endif
  *            LL_TIM_TIM20_BRK_TIM1_BKIN
  *            LL_TIM_TIM20_BRK_TIM8_BKIN
  *            LL_TIM_TIM20_BRK_TIM15_BKIN
  *            LL_TIM_TIM20_BRK_TIM16_BKIN
  *            LL_TIM_TIM20_BRK_TIM17_BKIN
  * @if PLAY1
  *            LL_TIM_TIM20_BRK_PLAY1_OUT0 (*)
  *            LL_TIM_TIM20_BRK_PLAY1_OUT9 (*)
  * @endif
  *
  *            . . BREAK2 can be a combination of the following values
  *            LL_TIM_TIM20_BRK2_GPIO
  *            LL_TIM_TIM20_BRK2_COMP1_OUT
  * @if COMP3
  *            LL_TIM_TIM20_BRK2_COMP2_OUT (*)
  *            LL_TIM_TIM20_BRK2_COMP3_OUT (*)
  *            LL_TIM_TIM20_BRK2_COMP4_OUT (*)
  * @endif
  *            LL_TIM_TIM20_BRK2_TIM1_BKIN2
  *            LL_TIM_TIM20_BRK2_TIM8_BKIN2
  * @if PLAY1
  *            LL_TIM_TIM20_BRK2_PLAY1_OUT2 (*)
  *            LL_TIM_TIM20_BRK2_PLAY1_OUT11 (*)
  * @endif
  * @endif
  *
  *         (*)  Value not defined in all devices.
  *         (**) Timer instance not available on all devices.


  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsEnabledBreakInputSource(const TIM_TypeDef *timx, uint32_t break_input,
                                                          uint32_t source)
{
  const __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&timx->AF1) + (break_input << 2)));
  return ((STM32_READ_BIT(*pReg, source) == (source)) ? 1UL : 0UL);
}

/**
  * @brief  Set the polarity of the break signal for the timer break input.
  * @rmtoll
  *  AF1          BKINP         LL_TIM_SetBreakInputSourcePolarity \n
  *  AF1          BKCMP1P       LL_TIM_SetBreakInputSourcePolarity \n
  *  AF1          BKCMP2P       LL_TIM_SetBreakInputSourcePolarity \n
  *  AF1          BKCMP3P       LL_TIM_SetBreakInputSourcePolarity \n
  *  AF1          BKCMP4P       LL_TIM_SetBreakInputSourcePolarity \n
  *  AF2          BK2INP        LL_TIM_SetBreakInputSourcePolarity \n
  *  AF2          BK2CMP1P      LL_TIM_SetBreakInputSourcePolarity \n
  *  AF2          BK2CMP2P      LL_TIM_SetBreakInputSourcePolarity \n
  *  AF2          BK2CMP3P      LL_TIM_SetBreakInputSourcePolarity \n
  *  AF2          BK2CMP4P      LL_TIM_SetBreakInputSourcePolarity
  * @param  timx Timer instance
  * @param  break_input This parameter can be one of the following values:
  *         @arg @ref LL_TIM_BREAK_INPUT_1
  *         @arg @ref LL_TIM_BREAK_INPUT_2
  * @param  source The break and break2 input source parameter depends on timx. Description is available only
  *         in the CHM version of the User Manual (not in the PDF).
  *
  *         The description below summarizes specific "Timer Instance" and "BREAK(2) input source"
  *         parameter possibilities:
  *
  *         TIM1: one of the following values:
  *
  *            . . BREAK can be one of the following values
  *            LL_TIM_TIM1_BRK_GPIO
  *            LL_TIM_TIM1_BRK_COMP1_OUT
  * @if COMP2
  *            LL_TIM_TIM1_BRK_COMP2_OUT (*)
  * @endif
  * @if COMP3
  *            LL_TIM_TIM1_BRK_COMP3_OUT (*)
  *            LL_TIM_TIM1_BRK_COMP4_OUT (*)
  * @endif
  *
  * @if TIM20
  *            . . BREAK2 can be one of the following values
  *            LL_TIM_TIM1_BRK2_GPIO
  *            LL_TIM_TIM1_BRK2_COMP1_OUT
  * @if COMP2
  *            LL_TIM_TIM1_BRK2_COMP2_OUT (*)
  * @endif
  * @if COMP3
  *            LL_TIM_TIM1_BRK2_COMP3_OUT (*)
  *            LL_TIM_TIM1_BRK2_COMP4_OUT (*)
  * @endif
  * @endif
  *
  *         TIM8: one of the following values:
  *
  *            . . BREAK can be one of the following values
  *            LL_TIM_TIM8_BRK_GPIO
  *            LL_TIM_TIM8_BRK_COMP1_OUT
  * @if COMP2
  *            LL_TIM_TIM8_BRK_COMP2_OUT (*)
  * @endif
  * @if COMP3
  *            LL_TIM_TIM8_BRK_COMP3_OUT (*)
  *            LL_TIM_TIM8_BRK_COMP4_OUT (*)
  * @endif
  *
  * @if TIM20
  *            . . BREAK2 can be one of the following values
  *            LL_TIM_TIM8_BRK2_GPIO
  *            LL_TIM_TIM8_BRK2_COMP1_OUT
  * @if COMP2
  *            LL_TIM_TIM8_BRK2_COMP2_OUT (*)
  * @endif
  * @if COMP3
  *            LL_TIM_TIM8_BRK2_COMP3_OUT (*)
  *            LL_TIM_TIM8_BRK2_COMP4_OUT (*)
  * @endif
  * @endif
  *
  *         TIM15: one of the following values:
  *
  *            . . BREAK can be one of the following values
  *            LL_TIM_TIM15_BRK_GPIO
  *            LL_TIM_TIM15_BRK_COMP1_OUT
  * @if COMP2
  *            LL_TIM_TIM15_BRK_COMP2_OUT (*)
  * @endif
  * @if COMP3
  *            LL_TIM_TIM15_BRK_COMP3_OUT (*)
  *            LL_TIM_TIM15_BRK_COMP4_OUT (*)
  * @endif
  *
  * @if TIM16
  *         TIM16: one of the following values: (**)
  *
  *            . . BREAK can be one of the following values
  *            LL_TIM_TIM16_BRK_GPIO
  *            LL_TIM_TIM16_BRK_COMP1_OUT
  * @if COMP3
  *            LL_TIM_TIM16_BRK_COMP2_OUT (*)
  *            LL_TIM_TIM16_BRK_COMP3_OUT (*)
  *            LL_TIM_TIM16_BRK_COMP4_OUT (*)
  * @endif
  * @endif
  *
  * @if TIM17
  *         TIM17: one of the following values: (**)
  *
  *            . . BREAK can be one of the following values
  *            LL_TIM_TIM17_BRK_GPIO
  *            LL_TIM_TIM17_BRK_COMP1_OUT
  * @if COMP3
  *            LL_TIM_TIM17_BRK_COMP2_OUT (*)
  *            LL_TIM_TIM17_BRK_COMP3_OUT (*)
  *            LL_TIM_TIM17_BRK_COMP4_OUT (*)
  * @endif
  * @endif
  *
  * @if TIM20
  *         TIM20: one of the following values: (**)
  *
  *            . . BREAK can be one of the following values
  *            LL_TIM_TIM20_BRK_GPIO
  *            LL_TIM_TIM20_BRK_COMP1_OUT
  * @if COMP3
  *            LL_TIM_TIM20_BRK_COMP2_OUT (*)
  *            LL_TIM_TIM20_BRK_COMP3_OUT (*)
  *            LL_TIM_TIM20_BRK_COMP4_OUT (*)
  * @endif
  *
  *            . . BREAK2 can be one of the following values
  *            LL_TIM_TIM20_BRK2_GPIO
  *            LL_TIM_TIM20_BRK2_COMP1_OUT
  * @if COMP3
  *            LL_TIM_TIM20_BRK2_COMP2_OUT (*)
  *            LL_TIM_TIM20_BRK2_COMP3_OUT (*)
  *            LL_TIM_TIM20_BRK2_COMP4_OUT (*)
  * @endif
  * @endif
  *
  *         (*)  Value not defined in all devices.
  *         (**) Timer instance not available on all devices.
  * @param  polarity This parameter can be one of the following values:
  *         LL_TIM_BREAK_INPUT_SRC_NONINVERTED
  *         LL_TIM_BREAK_INPUT_SRC_INVERTED
  *


  */
__STATIC_INLINE void LL_TIM_SetBreakInputSourcePolarity(TIM_TypeDef *timx, uint32_t break_input, uint32_t source,
                                                        uint32_t polarity)
{
  __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&timx->AF1) + (break_input << 2)));
  STM32_MODIFY_REG(*pReg, (TIM_AF1_BKINP << LL_TIM_POSITION_BRK_SOURCE(source)), \
                   (polarity << LL_TIM_POSITION_BRK_SOURCE(source)));
}

/**
  * @brief  Get the polarity of the break signal for the timer break input.
  * @rmtoll
  *  AF1          BKINP         LL_TIM_GetBreakInputSourcePolarity \n
  *  AF1          BKCMP1P       LL_TIM_GetBreakInputSourcePolarity \n
  *  AF1          BKCMP2P       LL_TIM_GetBreakInputSourcePolarity \n
  *  AF1          BKCMP3P       LL_TIM_GetBreakInputSourcePolarity \n
  *  AF1          BKCMP4P       LL_TIM_GetBreakInputSourcePolarity \n
  *  AF2          BK2INP        LL_TIM_GetBreakInputSourcePolarity \n
  *  AF2          BK2CMP1P      LL_TIM_GetBreakInputSourcePolarity \n
  *  AF2          BK2CMP2P      LL_TIM_GetBreakInputSourcePolarity \n
  *  AF2          BK2CMP3P      LL_TIM_GetBreakInputSourcePolarity \n
  *  AF2          BK2CMP4P      LL_TIM_GetBreakInputSourcePolarity
  * @param  timx Timer instance
  * @param  break_input This parameter can be one of the following values:
  *         @arg @ref LL_TIM_BREAK_INPUT_1
  *         @arg @ref LL_TIM_BREAK_INPUT_2
  * @param  source The break and break2 input source parameter depends on timx. Description is available only
  *         in the CHM version of the User Manual (not in the PDF).
  *
  *         The description below summarizes specific "Timer Instance" and "BREAK(2) input source"
  *         parameter possibilities:
  *
  *         TIM1: one of the following values:
  *
  *            . . BREAK can be one of the following values
  *            LL_TIM_TIM1_BRK_GPIO
  *            LL_TIM_TIM1_BRK_COMP1_OUT
  * @if COMP2
  *            LL_TIM_TIM1_BRK_COMP2_OUT (*)
  * @endif
  * @if COMP3
  *            LL_TIM_TIM1_BRK_COMP3_OUT (*)
  *            LL_TIM_TIM1_BRK_COMP4_OUT (*)
  * @endif
  *
  * @if TIM20
  *            . . BREAK2 can be one of the following values
  *            LL_TIM_TIM1_BRK2_GPIO
  *            LL_TIM_TIM1_BRK2_COMP1_OUT
  * @if COMP2
  *            LL_TIM_TIM1_BRK2_COMP2_OUT (*)
  * @endif
  * @if COMP3
  *            LL_TIM_TIM1_BRK2_COMP3_OUT (*)
  *            LL_TIM_TIM1_BRK2_COMP4_OUT (*)
  * @endif
  * @endif
  *
  *         TIM8: one of the following values:
  *
  *            . . BREAK can be one of the following values
  *            LL_TIM_TIM8_BRK_GPIO
  *            LL_TIM_TIM8_BRK_COMP1_OUT
  * @if COMP2
  *            LL_TIM_TIM8_BRK_COMP2_OUT (*)
  * @endif
  * @if COMP3
  *            LL_TIM_TIM8_BRK_COMP3_OUT (*)
  *            LL_TIM_TIM8_BRK_COMP4_OUT (*)
  * @endif
  *
  * @if TIM20
  *            . . BREAK2 can be one of the following values
  *            LL_TIM_TIM8_BRK2_GPIO
  *            LL_TIM_TIM8_BRK2_COMP1_OUT
  * @if COMP2
  *            LL_TIM_TIM8_BRK2_COMP2_OUT (*)
  * @endif
  * @if COMP3
  *            LL_TIM_TIM8_BRK2_COMP3_OUT (*)
  *            LL_TIM_TIM8_BRK2_COMP4_OUT (*)
  * @endif
  * @endif
  *
  *         TIM15: one of the following values:
  *
  *            . . BREAK can be one of the following values
  *            LL_TIM_TIM15_BRK_GPIO
  *            LL_TIM_TIM15_BRK_COMP1_OUT
  * @if COMP2
  *            LL_TIM_TIM15_BRK_COMP2_OUT (*)
  * @endif
  * @if COMP3
  *            LL_TIM_TIM15_BRK_COMP3_OUT (*)
  *            LL_TIM_TIM15_BRK_COMP4_OUT (*)
  * @endif
  *
  * @if TIM16
  *         TIM16: one of the following values: (**)
  *
  *            . . BREAK can be one of the following values
  *            LL_TIM_TIM16_BRK_GPIO
  *            LL_TIM_TIM16_BRK_COMP1_OUT
  * @if COMP3
  *            LL_TIM_TIM16_BRK_COMP2_OUT (*)
  *            LL_TIM_TIM16_BRK_COMP3_OUT (*)
  *            LL_TIM_TIM16_BRK_COMP4_OUT (*)
  * @endif
  * @endif
  *
  * @if TIM17
  *         TIM17: one of the following values: (**)
  *
  *            . . BREAK can be one of the following values
  *            LL_TIM_TIM17_BRK_GPIO
  *            LL_TIM_TIM17_BRK_COMP1_OUT
  * @if COMP3
  *            LL_TIM_TIM17_BRK_COMP2_OUT (*)
  *            LL_TIM_TIM17_BRK_COMP3_OUT (*)
  *            LL_TIM_TIM17_BRK_COMP4_OUT (*)
  * @endif
  * @endif
  *
  * @if TIM20
  *         TIM20: one of the following values: (**)
  *
  *            . . BREAK can be one of the following values
  *            LL_TIM_TIM20_BRK_GPIO
  *            LL_TIM_TIM20_BRK_COMP1_OUT
  * @if COMP3
  *            LL_TIM_TIM20_BRK_COMP2_OUT (*)
  *            LL_TIM_TIM20_BRK_COMP3_OUT (*)
  *            LL_TIM_TIM20_BRK_COMP4_OUT (*)
  * @endif
  *
  *            . . BREAK2 can be one of the following values
  *            LL_TIM_TIM20_BRK2_GPIO
  *            LL_TIM_TIM20_BRK2_COMP1_OUT
  * @if COMP3
  *            LL_TIM_TIM20_BRK2_COMP2_OUT (*)
  *            LL_TIM_TIM20_BRK2_COMP3_OUT (*)
  *            LL_TIM_TIM20_BRK2_COMP4_OUT (*)
  * @endif
  * @endif
  *
  *         (*)  Value not defined in all devices.
  *         (**) Timer instance not available on all devices.


  * @retval  Returned value can be one of the following values: \n
  *         @arg @ref LL_TIM_BREAK_INPUT_SRC_NONINVERTED
  *         @arg @ref LL_TIM_BREAK_INPUT_SRC_INVERTED
  */
__STATIC_INLINE uint32_t LL_TIM_GetBreakInputSourcePolarity(const TIM_TypeDef *timx,
                                                            uint32_t break_input,
                                                            uint32_t source)
{
  const __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&timx->AF1) + (break_input << 2)));
  uint32_t bitfield = TIM_AF1_BKINP << LL_TIM_POSITION_BRK_SOURCE(source);
  return ((STM32_READ_BIT(*pReg, bitfield) == bitfield) ? \
          LL_TIM_BREAK_INPUT_SRC_INVERTED : LL_TIM_BREAK_INPUT_SRC_NONINVERTED);
}

/**
  * @brief  Set the delay duration for a specific break delay.
  * @rmtoll
  *  MPR2          DBK1          LL_TIM_SetBreakDelay \n
  *  MPR2          DBK2          LL_TIM_SetBreakDelay
  * @param  timx Timer instance
  * @param  break_delay This parameter can be one of the following values: \n
  *         @arg @ref LL_TIM_BREAK_DELAY1
  *         @arg @ref LL_TIM_BREAK_DELAY2
  * @param  delay       Delay duration (between Min_Data=0 and Max_Data=255)
  * @note The delay duration can be changed on the fly as this control register is buffered. The new
  *       value is taken into account at the next update event.
  */
__STATIC_INLINE void LL_TIM_SetBreakDelay(TIM_TypeDef *timx, uint32_t break_delay, uint32_t delay)
{
  uint32_t dbk_shift = break_delay << 4U;
  STM32_MODIFY_REG(timx->MPR2, (TIM_MPR2_DBK1 << dbk_shift), (delay << dbk_shift));
}

/**
  * @brief  Get the delay duration for a specific break delay.
  * @rmtoll
  *  MPR2          DBK1          LL_TIM_GetBreakDelay \n
  *  MPR2          DBK2          LL_TIM_GetBreakDelay
  * @param  timx Timer instance
  * @param  break_delay This parameter can be one of the following values: \n
  *         @arg @ref LL_TIM_BREAK_DELAY1
  *         @arg @ref LL_TIM_BREAK_DELAY2
  * @retval Delay duration (between Min_Data=0 and Max_Data=255)
  */
__STATIC_INLINE uint32_t LL_TIM_GetBreakDelay(const TIM_TypeDef *timx, uint32_t break_delay)
{
  uint32_t dbk_shift = break_delay << 4U;
  return (uint32_t)((STM32_READ_BIT(timx->MPR2, (TIM_MPR2_DBK1 << dbk_shift))) >> dbk_shift);
}

/**
  * @brief  Enable asymmetrical deadtime.
  * @rmtoll
  *  DTR2          DTAE          LL_TIM_EnableAsymmetricalDeadTime
  * @param  timx Timer instance
  * @note Macro IS_TIM_DEADTIME_ASYMMETRICAL_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides asymmetrical deadtime.
  */
__STATIC_INLINE void LL_TIM_EnableAsymmetricalDeadTime(TIM_TypeDef *timx)
{
  STM32_SET_BIT(timx->DTR2, TIM_DTR2_DTAE);
}

/**
  * @brief  Disable asymmetrical dead-time.
  * @rmtoll
  *  DTR2          DTAE          LL_TIM_DisableAsymmetricalDeadTime
  * @param  timx Timer instance
  * @note Macro IS_TIM_DEADTIME_ASYMMETRICAL_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides asymmetrical deadtime.
  */
__STATIC_INLINE void LL_TIM_DisableAsymmetricalDeadTime(TIM_TypeDef *timx)
{
  STM32_CLEAR_BIT(timx->DTR2, TIM_DTR2_DTAE);
}

/**
  * @brief  Indicates whether asymmetrical deadtime is activated.
  * @rmtoll
  *  DTR2          DTAE          LL_TIM_IsEnabledAsymmetricalDeadTime
  * @param  timx Timer instance
  * @note Macro IS_TIM_DEADTIME_ASYMMETRICAL_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides asymmetrical deadtime.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsEnabledAsymmetricalDeadTime(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->DTR2, TIM_DTR2_DTAE) == (TIM_DTR2_DTAE)) ? 1UL : 0UL);
}

/**
  * @brief  Set the falling edge dead-time delay (delay inserted between the falling edge of the OCxREF signal and the
  *         rising edge of OCxN signals).
  * @rmtoll
  *  DTR2         DTGF           LL_TIM_SetFallingDeadTime
  * @param  timx Timer instance
  * @param  deadtime between Min_Data=0 and Max_Data=255
  * @note Macro IS_TIM_DEADTIME_ASYMMETRICAL_INSTANCE(timx) can be used to check whether or not
  *       asymmetrical dead-time insertion feature is supported by a timer instance.
  * @note Helper macro @ref LL_TIM_CALC_DEADTIME can be used to calculate the deadtime parameter
  * @note This bit-field can not be modified as long as LOCK level 1, 2 or 3 has been programmed
  *       (LOCK bits in TIMx_BDTR register).
  */
__STATIC_INLINE void LL_TIM_SetFallingDeadTime(TIM_TypeDef *timx, uint32_t deadtime)
{
  STM32_MODIFY_REG(timx->DTR2, TIM_DTR2_DTGF, deadtime);
}

