MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_tim.h
/**
  * @brief  Get the falling edge dead-time delay (delay inserted between the falling edge of the OCxREF signal and
  *         the rising edge of OCxN signals).
  * @rmtoll
  *  DTR2          DTGF           LL_TIM_GetFallingDeadTime
  * @param  timx Timer instance
  * @note Macro IS_TIM_DEADTIME_ASYMMETRICAL_INSTANCE(timx) can be used to check whether or not
  *       asymmetrical dead-time insertion feature is supported by a timer instance.
  * @note This bit-field can not be modified as long as LOCK level 1, 2 or 3 has been programmed
  *       (LOCK bits in TIMx_BDTR register).
  * @retval Returned value can be between Min_Data=0 and Max_Data=255.
  */
__STATIC_INLINE uint32_t LL_TIM_GetFallingDeadTime(const TIM_TypeDef *timx)
{
  return (uint32_t)(STM32_READ_BIT(timx->DTR2, TIM_DTR2_DTGF));
}

/**
  * @brief  Enable deadtime preload.
  * @rmtoll
  *  DTR2          DTPE          LL_TIM_EnableDeadTimePreload
  * @param  timx Timer instance
  * @note Macro IS_TIM_BREAK_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides deadtime preload.
  */
__STATIC_INLINE void LL_TIM_EnableDeadTimePreload(TIM_TypeDef *timx)
{
  STM32_SET_BIT(timx->DTR2, TIM_DTR2_DTPE);
}

/**
  * @brief  Disable dead-time preload.
  * @rmtoll
  *  DTR2          DTPE          LL_TIM_DisableDeadTimePreload
  * @param  timx Timer instance
  * @note Macro IS_TIM_BREAK_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides deadtime preload.
  */
__STATIC_INLINE void LL_TIM_DisableDeadTimePreload(TIM_TypeDef *timx)
{
  STM32_CLEAR_BIT(timx->DTR2, TIM_DTR2_DTPE);
}

/**
  * @brief  Indicates whether deadtime preload is activated.
  * @rmtoll
  *  DTR2          DTPE          LL_TIM_IsEnabledDeadTimePreload
  * @param  timx Timer instance
  * @note Macro IS_TIM_BREAK_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides deadtime preload.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsEnabledDeadTimePreload(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->DTR2, TIM_DTR2_DTPE) == (TIM_DTR2_DTPE)) ? 1UL : 0UL);
}
/**
  * @}
  */

/** @defgroup TIM_LL_EF_DMA_Burst_Mode DMA burst mode configuration
  * @{
  */
/**
  * @brief  Configures the timer DMA burst feature.
  * @rmtoll
  *  DCR          DBSS          LL_TIM_ConfigDMABurst \n
  *  DCR          DBL           LL_TIM_ConfigDMABurst \n
  *  DCR          DBA           LL_TIM_ConfigDMABurst
  * @param  timx Timer instance
  * @param  dmaburst_base_address This parameter can be one of the following values:
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_CR1
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_CR2
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_SMCR
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_DIER
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_SR
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_EGR
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_CCMR1
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_CCMR2
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_CCER
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_CNT
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_PSC
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_ARR
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_RCR
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_CCR1
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_CCR2
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_CCR3
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_CCR4
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_BDTR
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_CCR5
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_CCR6
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_CCMR3
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_DTR2
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_ECR
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_TISEL
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_AF1
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_AF2
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_CCR7
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_CCMR4
  * @param  dmaburst_length This parameter can be one of the following values:
  *         @arg @ref LL_TIM_DMABURST_LENGTH_1TRANSFER
  *         @arg @ref LL_TIM_DMABURST_LENGTH_2TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_3TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_4TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_5TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_6TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_7TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_8TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_9TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_10TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_11TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_12TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_13TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_14TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_15TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_16TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_17TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_18TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_19TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_20TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_21TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_22TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_23TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_24TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_25TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_26TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_27TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_28TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_29TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_30TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_31TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_32TRANSFERS
  * @param  dmaburst_source This parameter can be one of the following values:
  *         @arg @ref LL_TIM_DMABURST_UPD
  *         @arg @ref LL_TIM_DMABURST_CC1
  *         @arg @ref LL_TIM_DMABURST_CC2  (*)
  *         @arg @ref LL_TIM_DMABURST_CC3  (*)
  *         @arg @ref LL_TIM_DMABURST_CC4  (*)
  *         @arg @ref LL_TIM_DMABURST_COM  (*)
  *         @arg @ref LL_TIM_DMABURST_TRGI (*)
  *
  *         (*)  Value not defined for all timer instances.
  * @note Macro IS_TIM_DMABURST_INSTANCE(timx) can be used to check whether or
  *       not a timer instance supports the DMA burst mode.
  */
__STATIC_INLINE void LL_TIM_ConfigDMABurst(TIM_TypeDef *timx, uint32_t dmaburst_base_address, uint32_t dmaburst_length,
                                           uint32_t dmaburst_source)
{
  STM32_MODIFY_REG(timx->DCR, (TIM_DCR_DBL | TIM_DCR_DBA | TIM_DCR_DBSS),
                   (dmaburst_base_address | dmaburst_length | dmaburst_source));
}

/**
  * @brief  Get the timer DMA burst configuration.
  * @rmtoll
  *  DCR          DBSS          LL_TIM_GetConfigDMABurst \n
  *  DCR          DBL           LL_TIM_GetConfigDMABurst \n
  *  DCR          DBA           LL_TIM_GetConfigDMABurst
  * @param  timx Timer instance
  * @param  p_dmaburst_base_address Pointer to a storage for DMA burst base address. \n
  *         The value can be one of the following values: \n
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_CR1
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_CR2
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_SMCR
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_DIER
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_SR
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_EGR
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_CCMR1
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_CCMR2
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_CCER
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_CNT
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_PSC
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_ARR
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_RCR
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_CCR1
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_CCR2
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_CCR3
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_CCR4
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_BDTR
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_CCR5
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_CCR6
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_CCMR3
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_DTR2
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_ECR
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_TISEL
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_AF1
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_AF2
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_CCR7
  *         @arg @ref LL_TIM_DMABURST_BASEADDR_CCMR4
  * @param  p_dmaburst_length Pointer to a storage for DMA burst length. \n
  *         The value can be one of the following values: \n
  *         @arg @ref LL_TIM_DMABURST_LENGTH_1TRANSFER
  *         @arg @ref LL_TIM_DMABURST_LENGTH_2TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_3TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_4TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_5TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_6TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_7TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_8TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_9TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_10TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_11TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_12TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_13TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_14TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_15TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_16TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_17TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_18TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_19TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_20TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_21TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_22TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_23TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_24TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_25TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_26TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_27TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_28TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_29TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_30TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_31TRANSFERS
  *         @arg @ref LL_TIM_DMABURST_LENGTH_32TRANSFERS
  * @param  p_dmaburst_source Pointer to a storage for DMA burst source. \n
  *         The value can be one of the following values: \n
  *         @arg @ref LL_TIM_DMABURST_UPD
  *         @arg @ref LL_TIM_DMABURST_CC1
  *         @arg @ref LL_TIM_DMABURST_CC2  (*)
  *         @arg @ref LL_TIM_DMABURST_CC3  (*)
  *         @arg @ref LL_TIM_DMABURST_CC4  (*)
  *         @arg @ref LL_TIM_DMABURST_COM  (*)
  *         @arg @ref LL_TIM_DMABURST_TRGI (*)
  *
  *         (*)  Value not defined for all timer instances.
  * @note Macro IS_TIM_DMABURST_INSTANCE(timx) can be used to check whether or
  *       not a timer instance supports the DMA burst mode.
  */
__STATIC_INLINE void LL_TIM_GetConfigDMABurst(TIM_TypeDef *timx, uint32_t *p_dmaburst_base_address,
                                              uint32_t *p_dmaburst_length, uint32_t *p_dmaburst_source)
{
  const __IO uint32_t dcr = STM32_READ_REG(timx->DCR);

