MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_tim.h
  *p_dmaburst_base_address = (dcr & TIM_DCR_DBA);
  *p_dmaburst_length = (dcr & TIM_DCR_DBL);
  *p_dmaburst_source = (dcr & TIM_DCR_DBSS);
}

/**
  * @brief  Get the DMA burst source.
  * @rmtoll
  *  DCR          DBSS           LL_TIM_GetDMABurstSource
  * @param  timx Timer instance
  * @note Macro IS_TIM_DMABURST_INSTANCE(timx) can be used to check whether or
  *       not a timer instance supports the DMA burst mode.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_TIM_DMABURST_UPD
  *         @arg @ref LL_TIM_DMABURST_CC1
  *         @arg @ref LL_TIM_DMABURST_CC2  (*)
  *         @arg @ref LL_TIM_DMABURST_CC3  (*)
  *         @arg @ref LL_TIM_DMABURST_CC4  (*)
  *         @arg @ref LL_TIM_DMABURST_COM  (*)
  *         @arg @ref LL_TIM_DMABURST_TRGI (*)
  *
  *         (*)  Value not defined for all timer instances.
  */
__STATIC_INLINE uint32_t LL_TIM_GetDMABurstSource(const TIM_TypeDef *timx)
{
  return (uint32_t)(STM32_READ_BIT(timx->DCR, TIM_DCR_DBSS));
}
/**
  * @}
  */

/** @defgroup TIM_LL_EF_Encoder Encoder configuration
  * @{
  */

/**
  * @brief  Enable encoder index.
  * @rmtoll
  *  ECR         IE           LL_TIM_EnableEncoderIndex
  * @param  timx Timer instance
  * @note Macro IS_TIM_INDEX_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides an index input.
  */
__STATIC_INLINE void LL_TIM_EnableEncoderIndex(TIM_TypeDef *timx)
{
  STM32_SET_BIT(timx->ECR, TIM_ECR_IE);
}

/**
  * @brief  Disable encoder index.
  * @rmtoll
  *  ECR         IE           LL_TIM_DisableEncoderIndex
  * @param  timx Timer instance
  * @note Macro IS_TIM_INDEX_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides an index input.
  */
__STATIC_INLINE void LL_TIM_DisableEncoderIndex(TIM_TypeDef *timx)
{
  STM32_CLEAR_BIT(timx->ECR, TIM_ECR_IE);
}

/**
  * @brief  Indicate whether encoder index is enabled.
  * @rmtoll
  *  ECR         IE           LL_TIM_IsEnabledEncoderIndex
  * @param  timx Timer instance
  * @note Macro IS_TIM_INDEX_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides an index input.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsEnabledEncoderIndex(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->ECR, TIM_ECR_IE) == (TIM_ECR_IE)) ? 1UL : 0UL);
}

/**
  * @brief  Set index direction.
  * @rmtoll
  *  ECR          IDIR           LL_TIM_SetIndexDirection
  * @param  timx Timer instance
  * @param  index_direction This parameter can be one of the following values:
  *         @arg @ref LL_TIM_INDEX_UP_DOWN
  *         @arg @ref LL_TIM_INDEX_UP
  *         @arg @ref LL_TIM_INDEX_DOWN
  * @note Macro IS_TIM_INDEX_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides an index input.
  */
__STATIC_INLINE void LL_TIM_SetIndexDirection(TIM_TypeDef *timx, uint32_t index_direction)
{
  STM32_MODIFY_REG(timx->ECR, TIM_ECR_IDIR, index_direction);
}

/**
  * @brief  Get actual index direction.
  * @rmtoll
  *  ECR          IDIR           LL_TIM_GetIndexDirection
  * @param  timx Timer instance
  * @note Macro IS_TIM_INDEX_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides an index input.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_TIM_INDEX_UP_DOWN
  *         @arg @ref LL_TIM_INDEX_UP
  *         @arg @ref LL_TIM_INDEX_DOWN
  */
__STATIC_INLINE uint32_t LL_TIM_GetIndexDirection(const TIM_TypeDef *timx)
{
  return (uint32_t)(STM32_READ_BIT(timx->ECR, TIM_ECR_IDIR));
}

/**
  * @brief  Set index blanking.
  * @rmtoll
  *  ECR          IBLK           LL_TIM_SetIndexBlanking
  * @param  timx Timer instance
  * @param  index_blanking This parameter can be one of the following values:
  *         @arg @ref LL_TIM_INDEX_BLANK_ALWAYS
  *         @arg @ref LL_TIM_INDEX_BLANK_TI3
  *         @arg @ref LL_TIM_INDEX_BLANK_TI4
  * @note Macro IS_TIM_INDEX_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides an index input.
  */
__STATIC_INLINE void LL_TIM_SetIndexBlanking(TIM_TypeDef *timx, uint32_t index_blanking)
{
  STM32_MODIFY_REG(timx->ECR, TIM_ECR_IBLK, index_blanking);
}

/**
  * @brief  Get actual index blanking.
  * @rmtoll
  *  ECR          IBLK           LL_TIM_GetIndexBlanking
  * @param  timx Timer instance
  * @note Macro IS_TIM_INDEX_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides an index input.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_TIM_INDEX_BLANK_ALWAYS
  *         @arg @ref LL_TIM_INDEX_BLANK_TI3
  *         @arg @ref LL_TIM_INDEX_BLANK_TI4
  */
__STATIC_INLINE uint32_t LL_TIM_GetIndexBlanking(const TIM_TypeDef *timx)
{
  return (uint32_t)(STM32_READ_BIT(timx->ECR, TIM_ECR_IBLK));
}


/**
  * @brief  Enable first index.
  * @rmtoll
  *  ECR          FIDX          LL_TIM_EnableFirstIndex
  * @param  timx Timer instance
  * @note Macro IS_TIM_INDEX_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides an index input.
  */
__STATIC_INLINE void LL_TIM_EnableFirstIndex(TIM_TypeDef *timx)
{
  STM32_SET_BIT(timx->ECR, TIM_ECR_FIDX);
}

/**
  * @brief  Disable first index.
  * @rmtoll
  *  ECR          FIDX          LL_TIM_DisableFirstIndex
  * @param  timx Timer instance
  * @note Macro IS_TIM_INDEX_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides an index input.
  */
__STATIC_INLINE void LL_TIM_DisableFirstIndex(TIM_TypeDef *timx)
{
  STM32_CLEAR_BIT(timx->ECR, TIM_ECR_FIDX);
}

/**
  * @brief  Indicates whether first index is enabled.
  * @rmtoll
  *  ECR          FIDX          LL_TIM_IsEnabledFirstIndex
  * @param  timx Timer instance
  * @note Macro IS_TIM_INDEX_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides an index input.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsEnabledFirstIndex(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->ECR, TIM_ECR_FIDX) == (TIM_ECR_FIDX)) ? 1UL : 0UL);
}

/**
  * @brief  Set index positioning.
  * @rmtoll
  *  ECR          IPOS           LL_TIM_SetIndexPositionning
  * @param  timx Timer instance
  * @param  index_positioning This parameter can be one of the following values:
  *         @arg @ref LL_TIM_INDEX_POSITION_DOWN_DOWN
  *         @arg @ref LL_TIM_INDEX_POSITION_DOWN_UP
  *         @arg @ref LL_TIM_INDEX_POSITION_UP_DOWN
  *         @arg @ref LL_TIM_INDEX_POSITION_UP_UP
  *         @arg @ref LL_TIM_INDEX_POSITION_DOWN
  *         @arg @ref LL_TIM_INDEX_POSITION_UP
  * @note Macro IS_TIM_INDEX_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides an index input.
  */
__STATIC_INLINE void LL_TIM_SetIndexPositionning(TIM_TypeDef *timx, uint32_t index_positioning)
{
  STM32_MODIFY_REG(timx->ECR, TIM_ECR_IPOS, index_positioning);
}

/**
  * @brief  Get actual index positioning.
  * @rmtoll
  *  ECR          IPOS           LL_TIM_GetIndexPositionning
  * @param  timx Timer instance
  * @note Macro IS_TIM_INDEX_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides an index input.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_TIM_INDEX_POSITION_DOWN_DOWN
  *         @arg @ref LL_TIM_INDEX_POSITION_DOWN_UP
  *         @arg @ref LL_TIM_INDEX_POSITION_UP_DOWN
  *         @arg @ref LL_TIM_INDEX_POSITION_UP_UP
  *         @arg @ref LL_TIM_INDEX_POSITION_DOWN
  *         @arg @ref LL_TIM_INDEX_POSITION_UP
  */
__STATIC_INLINE uint32_t LL_TIM_GetIndexPositionning(const TIM_TypeDef *timx)
{
  return (uint32_t)(STM32_READ_BIT(timx->ECR, TIM_ECR_IPOS));
}

/**
  * @brief  Configure encoder index.
  * @rmtoll
  *  ECR          IDIR          LL_TIM_ConfigEncoderIndex \n
  *  ECR          IBLK          LL_TIM_ConfigEncoderIndex \n
  *  ECR          FIDX          LL_TIM_ConfigEncoderIndex \n
  *  ECR          IPOS          LL_TIM_ConfigEncoderIndex
  * @param  timx Timer instance
  * @param  configuration This parameter must be a combination of all the following values:
  *         @arg @ref LL_TIM_INDEX_UP or @ref LL_TIM_INDEX_DOWN or @ref LL_TIM_INDEX_UP_DOWN
  *         @arg @ref LL_TIM_INDEX_BLANK_ALWAYS or @ref LL_TIM_INDEX_BLANK_TI3 or @ref LL_TIM_INDEX_BLANK_TI4
  *         @arg @ref LL_TIM_INDEX_ALL or @ref LL_TIM_INDEX_FIRST_ONLY
  *         @arg @ref LL_TIM_INDEX_POSITION_DOWN_DOWN or ... or @ref LL_TIM_INDEX_POSITION_UP
  * @note Macro IS_TIM_INDEX_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides an index input.
  */
__STATIC_INLINE void LL_TIM_ConfigEncoderIndex(TIM_TypeDef *timx, uint32_t configuration)
{
  STM32_MODIFY_REG(timx->ECR, TIM_ECR_IDIR | TIM_ECR_IBLK | TIM_ECR_FIDX | TIM_ECR_IPOS, configuration);
}

/**
  * @}
  */


/** @defgroup TIM_LL_EF_OCREF_Clear OCREF_Clear_Management
  * @{
  */
/**
  * @brief  Set the OCREF clear input source.
  * @rmtoll
  *  AF2           OCRSEL              LL_TIM_SetOCRefClearInputSource \n
  *  SMCR          OCCS                LL_TIM_SetOCRefClearInputSource
  * @param  timx Timer instance
  * @param  ocrefclear_input_source This parameter can be one of the following values:
  *         The description below summarizes specific "Timer Instance" and "OCRef clear input source"
  *         parameter possibilities:
  *
  *         TIM1: one of the following values:
  *            LL_TIM_TIM1_OCREF_CLR_INT_ETR
  *            LL_TIM_TIM1_OCREF_CLR_INT_COMP1_OUT
  * @if COMP2
  *            LL_TIM_TIM1_OCREF_CLR_INT_COMP2_OUT (*)
  * @endif
  * @if COMP3
  *            LL_TIM_TIM1_OCREF_CLR_INT_COMP3_OUT (*)
  *            LL_TIM_TIM1_OCREF_CLR_INT_COMP4_OUT (*)
  * @endif
  * @if PLAY1
  *            LL_TIM_TIM1_OCREF_CLR_INT_PLAY1_OUT0 (*)
  *            LL_TIM_TIM1_OCREF_CLR_INT_PLAY1_OUT6 (*)
  * @endif
  *
  *         TIM2: one of the following values:
  *            LL_TIM_TIM2_OCREF_CLR_INT_ETR
  *            LL_TIM_TIM2_OCREF_CLR_INT_COMP1_OUT
  * @if COMP2
  *            LL_TIM_TIM2_OCREF_CLR_INT_COMP2_OUT (*)
  * @endif
  * @if COMP3
  *            LL_TIM_TIM2_OCREF_CLR_INT_COMP3_OUT (*)
  *            LL_TIM_TIM2_OCREF_CLR_INT_COMP4_OUT (*)
  * @endif
  * @if PLAY1
  *            LL_TIM_TIM2_OCREF_CLR_INT_PLAY1_OUT15 (*)
  *            LL_TIM_TIM2_OCREF_CLR_INT_PLAY1_OUT7 (*)
  * @endif
  *
  *         TIM3: one of the following values: (**)
  *            LL_TIM_TIM3_OCREF_CLR_INT_ETR
  *            LL_TIM_TIM3_OCREF_CLR_INT_COMP1_OUT
  * @if COMP3
  *            LL_TIM_TIM3_OCREF_CLR_INT_COMP2_OUT (*)
  *            LL_TIM_TIM3_OCREF_CLR_INT_COMP3_OUT (*)
  *            LL_TIM_TIM3_OCREF_CLR_INT_COMP4_OUT (*)
  * @endif
  * @if PLAY1
  *            LL_TIM_TIM3_OCREF_CLR_INT_PLAY1_OUT3 (*)
  *            LL_TIM_TIM3_OCREF_CLR_INT_PLAY1_OUT2 (*)
  * @endif
  *
  *         TIM4: one of the following values: (**)
  *            LL_TIM_TIM4_OCREF_CLR_INT_ETR
  *            LL_TIM_TIM4_OCREF_CLR_INT_COMP1_OUT
  *
  *         TIM5: one of the following values: (**)
  *            LL_TIM_TIM5_OCREF_CLR_INT_ETR
  *            LL_TIM_TIM5_OCREF_CLR_INT_COMP1_OUT
  * @if COMP3
  *            LL_TIM_TIM5_OCREF_CLR_INT_COMP2_OUT (*)
  *            LL_TIM_TIM5_OCREF_CLR_INT_COMP3_OUT (*)
  *            LL_TIM_TIM5_OCREF_CLR_INT_COMP4_OUT (*)
  * @endif
  *
  *         TIM8: one of the following values:
  *            LL_TIM_TIM8_OCREF_CLR_INT_ETR
  *            LL_TIM_TIM8_OCREF_CLR_INT_COMP1_OUT
  * @if COMP2
  *            LL_TIM_TIM8_OCREF_CLR_INT_COMP2_OUT (*)
  * @endif
  * @if COMP3
  *            LL_TIM_TIM8_OCREF_CLR_INT_COMP3_OUT (*)
  *            LL_TIM_TIM8_OCREF_CLR_INT_COMP4_OUT (*)
  * @endif
  * @if PLAY1
  *            LL_TIM_TIM8_OCREF_CLR_INT_PLAY1_OUT5 (*)
  *            LL_TIM_TIM8_OCREF_CLR_INT_PLAY1_OUT14 (*)
  * @endif
  *
  *         TIM15: one of the following values:
  *            LL_TIM_TIM15_OCREF_CLR_INT_COMP1_OUT
  * @if COMP2
  *            LL_TIM_TIM15_OCREF_CLR_INT_COMP2_OUT (*)
  * @endif
  * @if COMP3
  *            LL_TIM_TIM15_OCREF_CLR_INT_COMP3_OUT (*)
  *            LL_TIM_TIM15_OCREF_CLR_INT_COMP4_OUT (*)
  * @endif
  * @if PLAY1
  *            LL_TIM_TIM15_OCREF_CLR_INT_PLAY1_OUT7 (*)
  *            LL_TIM_TIM15_OCREF_CLR_INT_PLAY1_OUT8 (*)
  * @endif
  *
  * @if TIM16
  *         TIM16: one of the following values: (**)
  *            LL_TIM_TIM16_OCREF_CLR_INT_COMP1_OUT
  * @if COMP3
  *            LL_TIM_TIM16_OCREF_CLR_INT_COMP2_OUT (*)
  *            LL_TIM_TIM16_OCREF_CLR_INT_COMP3_OUT (*)
  *            LL_TIM_TIM16_OCREF_CLR_INT_COMP4_OUT (*)
  * @endif
  * @if PLAY1
  *            LL_TIM_TIM16_OCREF_CLR_INT_PLAY1_OUT9 (*)
  *            LL_TIM_TIM16_OCREF_CLR_INT_PLAY1_OUT10 (*)
  * @endif
  *
  *         TIM17: one of the following values: (**)
  *            LL_TIM_TIM17_OCREF_CLR_INT_COMP1_OUT
  * @if COMP3
  *            LL_TIM_TIM17_OCREF_CLR_INT_COMP2_OUT (*)
  *            LL_TIM_TIM17_OCREF_CLR_INT_COMP3_OUT (*)
  *            LL_TIM_TIM17_OCREF_CLR_INT_COMP4_OUT (*)
  * @endif
  * @if PLAY1
  *            LL_TIM_TIM17_OCREF_CLR_INT_PLAY1_OUT11 (*)
  *            LL_TIM_TIM17_OCREF_CLR_INT_PLAY1_OUT13 (*)
  * @endif
  * @endif
  *
  * @if TIM20
  *         TIM20: one of the following values: (**)
  *            LL_TIM_TIM20_OCREF_CLR_INT_COMP1_OUT
  * @if COMP3
  *            LL_TIM_TIM20_OCREF_CLR_INT_COMP2_OUT (*)
  *            LL_TIM_TIM20_OCREF_CLR_INT_COMP3_OUT (*)
  *            LL_TIM_TIM20_OCREF_CLR_INT_COMP4_OUT (*)
  * @endif
  * @if PLAY1
  *            LL_TIM_TIM20_OCREF_CLR_INT_PLAY1_OUT12 (*)
  *            LL_TIM_TIM20_OCREF_CLR_INT_PLAY1_OUT1 (*)
  * @endif
  * @endif
  *
  *         (*)  Value not defined in all devices.
  *         (**) Timer instance not available on all devices.

  * @note The OCxREF signal of a given channel can be cleared when a high level is applied on the OCREF_CLR_INPUT
  * @note This function can only be used in Output compare and PWM modes.
  */
__STATIC_INLINE void LL_TIM_SetOCRefClearInputSource(TIM_TypeDef *timx, uint32_t ocrefclear_input_source)
{
  STM32_MODIFY_REG(timx->SMCR, TIM_SMCR_OCCS, (ocrefclear_input_source & TIM_SMCR_OCCS));
  STM32_MODIFY_REG(timx->AF2, TIM_AF2_OCRSEL, (ocrefclear_input_source & TIM_AF2_OCRSEL));
}

/**
  * @brief  Get the OCREF clear input source.
  * @rmtoll
  *  AF2           OCRSEL              LL_TIM_GetOCRefClearInputSource \n
  *  SMCR          OCCS                LL_TIM_GetOCRefClearInputSource
  * @param  timx Timer instance
  * @retval Returned value can be one of the following values:
  *         The description below summarizes specific "Timer Instance" and "OCRef clear input source"
  *         parameter possibilities:
  *
  *         TIM1: one of the following values:
  *            LL_TIM_TIM1_OCREF_CLR_INT_ETR
  *            LL_TIM_TIM1_OCREF_CLR_INT_COMP1_OUT
  * @if COMP2
  *            LL_TIM_TIM1_OCREF_CLR_INT_COMP2_OUT (*)
  * @endif
  * @if COMP3
  *            LL_TIM_TIM1_OCREF_CLR_INT_COMP3_OUT (*)
  *            LL_TIM_TIM1_OCREF_CLR_INT_COMP4_OUT (*)
  * @endif
  * @if PLAY1
  *            LL_TIM_TIM1_OCREF_CLR_INT_PLAY1_OUT0 (*)
  *            LL_TIM_TIM1_OCREF_CLR_INT_PLAY1_OUT6 (*)
  * @endif
  *
  *         TIM2: one of the following values:
  *            LL_TIM_TIM2_OCREF_CLR_INT_ETR
  *            LL_TIM_TIM2_OCREF_CLR_INT_COMP1_OUT
  * @if COMP2
  *            LL_TIM_TIM2_OCREF_CLR_INT_COMP2_OUT (*)
  * @endif
  * @if COMP3
  *            LL_TIM_TIM2_OCREF_CLR_INT_COMP3_OUT (*)
  *            LL_TIM_TIM2_OCREF_CLR_INT_COMP4_OUT (*)
  * @endif
  * @if PLAY1
  *            LL_TIM_TIM2_OCREF_CLR_INT_PLAY1_OUT15 (*)
  *            LL_TIM_TIM2_OCREF_CLR_INT_PLAY1_OUT7 (*)
  * @endif
  *
  *         TIM3: one of the following values: (**)
  *            LL_TIM_TIM3_OCREF_CLR_INT_ETR
  *            LL_TIM_TIM3_OCREF_CLR_INT_COMP1_OUT
  * @if COMP3
  *            LL_TIM_TIM3_OCREF_CLR_INT_COMP2_OUT (*)
  *            LL_TIM_TIM3_OCREF_CLR_INT_COMP3_OUT (*)
  *            LL_TIM_TIM3_OCREF_CLR_INT_COMP4_OUT (*)
  * @endif
  * @if PLAY1
  *            LL_TIM_TIM3_OCREF_CLR_INT_PLAY1_OUT3 (*)
  *            LL_TIM_TIM3_OCREF_CLR_INT_PLAY1_OUT2 (*)
  * @endif
  *
  *         TIM4: one of the following values: (**)
  *            LL_TIM_TIM4_OCREF_CLR_INT_ETR
  *            LL_TIM_TIM4_OCREF_CLR_INT_COMP1_OUT
  *
  *         TIM5: one of the following values: (**)
  *            LL_TIM_TIM5_OCREF_CLR_INT_ETR
  *            LL_TIM_TIM5_OCREF_CLR_INT_COMP1_OUT
  * @if COMP3
  *            LL_TIM_TIM5_OCREF_CLR_INT_COMP2_OUT (*)
  *            LL_TIM_TIM5_OCREF_CLR_INT_COMP3_OUT (*)
  *            LL_TIM_TIM5_OCREF_CLR_INT_COMP4_OUT (*)
  * @endif
  *
  *         TIM8: one of the following values:
  *            LL_TIM_TIM8_OCREF_CLR_INT_ETR
  *            LL_TIM_TIM8_OCREF_CLR_INT_COMP1_OUT
  * @if COMP2
  *            LL_TIM_TIM8_OCREF_CLR_INT_COMP2_OUT (*)
  * @endif
  * @if COMP3
  *            LL_TIM_TIM8_OCREF_CLR_INT_COMP3_OUT (*)
  *            LL_TIM_TIM8_OCREF_CLR_INT_COMP4_OUT (*)
  * @endif
  * @if PLAY1
  *            LL_TIM_TIM8_OCREF_CLR_INT_PLAY1_OUT5 (*)
  *            LL_TIM_TIM8_OCREF_CLR_INT_PLAY1_OUT14 (*)
  * @endif
  *
  *         TIM15: one of the following values:
  *            LL_TIM_TIM15_OCREF_CLR_INT_COMP1_OUT
  * @if COMP2
  *            LL_TIM_TIM15_OCREF_CLR_INT_COMP2_OUT (*)
  * @endif
  * @if COMP3
  *            LL_TIM_TIM15_OCREF_CLR_INT_COMP3_OUT (*)
  *            LL_TIM_TIM15_OCREF_CLR_INT_COMP4_OUT (*)
  * @endif
  * @if PLAY1
  *            LL_TIM_TIM15_OCREF_CLR_INT_PLAY1_OUT7 (*)
  *            LL_TIM_TIM15_OCREF_CLR_INT_PLAY1_OUT8 (*)
  * @endif
  *
  * @if TIM16
  *         TIM16: one of the following values: (**)
  *            LL_TIM_TIM16_OCREF_CLR_INT_COMP1_OUT
  * @if COMP3
  *            LL_TIM_TIM16_OCREF_CLR_INT_COMP2_OUT (*)
  *            LL_TIM_TIM16_OCREF_CLR_INT_COMP3_OUT (*)
  *            LL_TIM_TIM16_OCREF_CLR_INT_COMP4_OUT (*)
  * @endif
  * @if PLAY1
  *            LL_TIM_TIM16_OCREF_CLR_INT_PLAY1_OUT9 (*)
  *            LL_TIM_TIM16_OCREF_CLR_INT_PLAY1_OUT10 (*)
  * @endif
  *
  *         TIM17: one of the following values: (**)
  *            LL_TIM_TIM17_OCREF_CLR_INT_COMP1_OUT
  * @if COMP3
  *            LL_TIM_TIM17_OCREF_CLR_INT_COMP2_OUT (*)
  *            LL_TIM_TIM17_OCREF_CLR_INT_COMP3_OUT (*)
  *            LL_TIM_TIM17_OCREF_CLR_INT_COMP4_OUT (*)
  * @endif
  * @if PLAY1
  *            LL_TIM_TIM17_OCREF_CLR_INT_PLAY1_OUT11 (*)
  *            LL_TIM_TIM17_OCREF_CLR_INT_PLAY1_OUT13 (*)
  * @endif
  * @endif
  *
  * @if TIM20
  *         TIM20: one of the following values: (**)
  *            LL_TIM_TIM20_OCREF_CLR_INT_COMP1_OUT
  * @if COMP3
  *            LL_TIM_TIM20_OCREF_CLR_INT_COMP2_OUT (*)
  *            LL_TIM_TIM20_OCREF_CLR_INT_COMP3_OUT (*)
  *            LL_TIM_TIM20_OCREF_CLR_INT_COMP4_OUT (*)
  * @endif
  * @if PLAY1
  *            LL_TIM_TIM20_OCREF_CLR_INT_PLAY1_OUT12 (*)
  *            LL_TIM_TIM20_OCREF_CLR_INT_PLAY1_OUT1 (*)
  * @endif
  * @endif
  *
  *         (*)  Value not defined in all devices.
  *         (**) Timer instance not available on all devices.

  */
__STATIC_INLINE uint32_t LL_TIM_GetOCRefClearInputSource(const TIM_TypeDef *timx)
{
  uint32_t src = (uint32_t)(STM32_READ_BIT(timx->SMCR, TIM_SMCR_OCCS));
  src |= (uint32_t)(STM32_READ_BIT(timx->AF2, TIM_AF2_OCRSEL));
  return src;
}
/**
  * @}
  */

/** @defgroup TIM_LL_EF_FLAG_Management FLAG-Management
  * @{
  */
/**
  * @brief  Clear the update interrupt flag (UIF).
  * @rmtoll
  *  SR           UIF           LL_TIM_ClearFlag_UPDATE
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_ClearFlag_UPDATE(TIM_TypeDef *timx)
{
  STM32_WRITE_REG(timx->SR, ~(TIM_SR_UIF));
}

/**
  * @brief  Indicate whether update interrupt flag (UIF) is set (update interrupt is pending).
  * @rmtoll
  *  SR           UIF           LL_TIM_IsActiveFlag_UPDATE
  * @param  timx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsActiveFlag_UPDATE(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->SR, TIM_SR_UIF) == (TIM_SR_UIF)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the Capture/Compare 1 interrupt flag (CC1F).
  * @rmtoll
  *  SR           CC1IF         LL_TIM_ClearFlag_CC1
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_ClearFlag_CC1(TIM_TypeDef *timx)
{
  STM32_WRITE_REG(timx->SR, ~(TIM_SR_CC1IF));
}

/**
  * @brief  Indicate whether Capture/Compare 1 interrupt flag (CC1F) is set (Capture/Compare 1 interrupt is pending).
  * @rmtoll
  *  SR           CC1IF         LL_TIM_IsActiveFlag_CC1
  * @param  timx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsActiveFlag_CC1(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->SR, TIM_SR_CC1IF) == (TIM_SR_CC1IF)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the Capture/Compare 2 interrupt flag (CC2F).
  * @rmtoll
  *  SR           CC2IF         LL_TIM_ClearFlag_CC2
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_ClearFlag_CC2(TIM_TypeDef *timx)
{
  STM32_WRITE_REG(timx->SR, ~(TIM_SR_CC2IF));
}

/**
  * @brief  Indicate whether Capture/Compare 2 interrupt flag (CC2F) is set (Capture/Compare 2 interrupt is pending).
  * @rmtoll
  *  SR           CC2IF         LL_TIM_IsActiveFlag_CC2
  * @param  timx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsActiveFlag_CC2(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->SR, TIM_SR_CC2IF) == (TIM_SR_CC2IF)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the Capture/Compare 3 interrupt flag (CC3F).
  * @rmtoll
  *  SR           CC3IF         LL_TIM_ClearFlag_CC3
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_ClearFlag_CC3(TIM_TypeDef *timx)
{
  STM32_WRITE_REG(timx->SR, ~(TIM_SR_CC3IF));
}

/**
  * @brief  Indicate whether Capture/Compare 3 interrupt flag (CC3F) is set (Capture/Compare 3 interrupt is pending).
  * @rmtoll
  *  SR           CC3IF         LL_TIM_IsActiveFlag_CC3
  * @param  timx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsActiveFlag_CC3(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->SR, TIM_SR_CC3IF) == (TIM_SR_CC3IF)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the Capture/Compare 4 interrupt flag (CC4F).
  * @rmtoll
  *  SR           CC4IF         LL_TIM_ClearFlag_CC4
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_ClearFlag_CC4(TIM_TypeDef *timx)
{
  STM32_WRITE_REG(timx->SR, ~(TIM_SR_CC4IF));
}

/**
  * @brief  Indicate whether Capture/Compare 4 interrupt flag (CC4F) is set (Capture/Compare 4 interrupt is pending).
  * @rmtoll
  *  SR           CC4IF         LL_TIM_IsActiveFlag_CC4
  * @param  timx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsActiveFlag_CC4(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->SR, TIM_SR_CC4IF) == (TIM_SR_CC4IF)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the Capture/Compare 5 interrupt flag (CC5F).
  * @rmtoll
  *  SR           CC5IF         LL_TIM_ClearFlag_CC5
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_ClearFlag_CC5(TIM_TypeDef *timx)
{
  STM32_WRITE_REG(timx->SR, ~(TIM_SR_CC5IF));
}

/**
  * @brief  Indicate whether Capture/Compare 5 interrupt flag (CC5F) is set (Capture/Compare 5 interrupt is pending).
  * @rmtoll
  *  SR           CC5IF         LL_TIM_IsActiveFlag_CC5
  * @param  timx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsActiveFlag_CC5(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->SR, TIM_SR_CC5IF) == (TIM_SR_CC5IF)) ? 1UL : 0UL);
}

