MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_tim.h
/**
  * @brief  Clear the Capture/Compare 6 interrupt flag (CC6F).
  * @rmtoll
  *  SR           CC6IF         LL_TIM_ClearFlag_CC6
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_ClearFlag_CC6(TIM_TypeDef *timx)
{
  STM32_WRITE_REG(timx->SR, ~(TIM_SR_CC6IF));
}

/**
  * @brief  Indicate whether Capture/Compare 6 interrupt flag (CC6F) is set (Capture/Compare 6 interrupt is pending).
  * @rmtoll
  *  SR           CC6IF         LL_TIM_IsActiveFlag_CC6
  * @param  timx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsActiveFlag_CC6(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->SR, TIM_SR_CC6IF) == (TIM_SR_CC6IF)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the Capture/Compare 7 interrupt flag (CC7F).
  * @rmtoll
  *  SR           CC7IF         LL_TIM_ClearFlag_CC7
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_ClearFlag_CC7(TIM_TypeDef *timx)
{
  STM32_WRITE_REG(timx->SR, ~(TIM_SR_CC7IF));
}

/**
  * @brief  Indicate whether Capture/Compare 7 interrupt flag (CC7F) is set (Capture/Compare 7 interrupt is pending).
  * @rmtoll
  *  SR           CC7IF         LL_TIM_IsActiveFlag_CC7
  * @param  timx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsActiveFlag_CC7(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->SR, TIM_SR_CC7IF) == (TIM_SR_CC7IF)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the commutation interrupt flag (COMIF).
  * @rmtoll
  *  SR           COMIF         LL_TIM_ClearFlag_COM
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_ClearFlag_COM(TIM_TypeDef *timx)
{
  STM32_WRITE_REG(timx->SR, ~(TIM_SR_COMIF));
}

/**
  * @brief  Indicate whether commutation interrupt flag (COMIF) is set (commutation interrupt is pending).
  * @rmtoll
  *  SR           COMIF         LL_TIM_IsActiveFlag_COM
  * @param  timx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsActiveFlag_COM(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->SR, TIM_SR_COMIF) == (TIM_SR_COMIF)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the trigger interrupt flag (TIF).
  * @rmtoll
  *  SR           TIF           LL_TIM_ClearFlag_TRIG
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_ClearFlag_TRIG(TIM_TypeDef *timx)
{
  STM32_WRITE_REG(timx->SR, ~(TIM_SR_TIF));
}

/**
  * @brief  Indicate whether trigger interrupt flag (TIF) is set (trigger interrupt is pending).
  * @rmtoll
  *  SR           TIF           LL_TIM_IsActiveFlag_TRIG
  * @param  timx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsActiveFlag_TRIG(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->SR, TIM_SR_TIF) == (TIM_SR_TIF)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the break interrupt flag (BIF).
  * @rmtoll
  *  SR           BIF           LL_TIM_ClearFlag_BRK
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_ClearFlag_BRK(TIM_TypeDef *timx)
{
  STM32_WRITE_REG(timx->SR, ~(TIM_SR_BIF));
}

/**
  * @brief  Indicate whether break interrupt flag (BIF) is set (break interrupt is pending).
  * @rmtoll
  *  SR           BIF           LL_TIM_IsActiveFlag_BRK
  * @param  timx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsActiveFlag_BRK(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->SR, TIM_SR_BIF) == (TIM_SR_BIF)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the break 2 interrupt flag (B2IF).
  * @rmtoll
  *  SR           B2IF          LL_TIM_ClearFlag_BRK2
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_ClearFlag_BRK2(TIM_TypeDef *timx)
{
  STM32_WRITE_REG(timx->SR, ~(TIM_SR_B2IF));
}

/**
  * @brief  Indicate whether break 2 interrupt flag (B2IF) is set (break 2 interrupt is pending).
  * @rmtoll
  *  SR           B2IF          LL_TIM_IsActiveFlag_BRK2
  * @param  timx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsActiveFlag_BRK2(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->SR, TIM_SR_B2IF) == (TIM_SR_B2IF)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the system break interrupt flag (SBIF).
  * @rmtoll
  *  SR           SBIF          LL_TIM_ClearFlag_SYSBRK
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_ClearFlag_SYSBRK(TIM_TypeDef *timx)
{
  STM32_WRITE_REG(timx->SR, ~(TIM_SR_SBIF));
}

/**
  * @brief  Indicate whether system break interrupt flag (SBIF) is set (system break interrupt is pending).
  * @rmtoll
  *  SR           SBIF          LL_TIM_IsActiveFlag_SYSBRK
  * @param  timx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsActiveFlag_SYSBRK(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->SR, TIM_SR_SBIF) == (TIM_SR_SBIF)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the break generation flag (BGF).
  * @rmtoll
  *  SR           BGF           LL_TIM_ClearFlag_BG
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_ClearFlag_BG(TIM_TypeDef *timx)
{
  STM32_WRITE_REG(timx->SR, ~(TIM_SR_BGF));
}

/**
  * @brief  Indicate whether break generation flag (BGF) is set (break interrupt is pending).
  * @rmtoll
  *  SR           BGF         LL_TIM_IsActiveFlag_BG
  * @param  timx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsActiveFlag_BG(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->SR, TIM_SR_BGF) == (TIM_SR_BGF)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the break 2 generation flag (B2GF).
  * @rmtoll
  *  SR           B2GF          LL_TIM_ClearFlag_B2G
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_ClearFlag_B2G(TIM_TypeDef *timx)
{
  STM32_WRITE_REG(timx->SR, ~(TIM_SR_B2GF));
}

/**
  * @brief  Indicate whether break 2 generation flag (B2GF) is set (break 2 interrupt is pending).
  * @rmtoll
  *  SR           B2GF        LL_TIM_IsActiveFlag_B2G
  * @param  timx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsActiveFlag_B2G(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->SR, TIM_SR_B2GF) == (TIM_SR_B2GF)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the Capture/Compare 1 over-capture interrupt flag (CC1OF).
  * @rmtoll
  *  SR           CC1OF         LL_TIM_ClearFlag_CC1OVR
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_ClearFlag_CC1OVR(TIM_TypeDef *timx)
{
  STM32_WRITE_REG(timx->SR, ~(TIM_SR_CC1OF));
}

/**
  * @brief  Indicate whether Capture/Compare 1 over-capture interrupt flag (CC1OF) is set
  *         (Capture/Compare 1 interrupt is pending).
  * @rmtoll
  *  SR           CC1OF         LL_TIM_IsActiveFlag_CC1OVR
  * @param  timx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsActiveFlag_CC1OVR(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->SR, TIM_SR_CC1OF) == (TIM_SR_CC1OF)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the Capture/Compare 2 over-capture interrupt flag (CC2OF).
  * @rmtoll
  *  SR           CC2OF         LL_TIM_ClearFlag_CC2OVR
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_ClearFlag_CC2OVR(TIM_TypeDef *timx)
{
  STM32_WRITE_REG(timx->SR, ~(TIM_SR_CC2OF));
}

/**
  * @brief  Indicate whether Capture/Compare 2 over-capture interrupt flag (CC2OF) is set
  *         (Capture/Compare 2 over-capture interrupt is pending).
  * @rmtoll
  *  SR           CC2OF         LL_TIM_IsActiveFlag_CC2OVR
  * @param  timx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsActiveFlag_CC2OVR(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->SR, TIM_SR_CC2OF) == (TIM_SR_CC2OF)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the Capture/Compare 3 over-capture interrupt flag (CC3OF).
  * @rmtoll
  *  SR           CC3OF         LL_TIM_ClearFlag_CC3OVR
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_ClearFlag_CC3OVR(TIM_TypeDef *timx)
{
  STM32_WRITE_REG(timx->SR, ~(TIM_SR_CC3OF));
}

/**
  * @brief  Indicate whether Capture/Compare 3 over-capture interrupt flag (CC3OF) is set
  *         (Capture/Compare 3 over-capture interrupt is pending).
  * @rmtoll
  *  SR           CC3OF         LL_TIM_IsActiveFlag_CC3OVR
  * @param  timx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsActiveFlag_CC3OVR(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->SR, TIM_SR_CC3OF) == (TIM_SR_CC3OF)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the Capture/Compare 4 over-capture interrupt flag (CC4OF).
  * @rmtoll
  *  SR           CC4OF         LL_TIM_ClearFlag_CC4OVR
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_ClearFlag_CC4OVR(TIM_TypeDef *timx)
{
  STM32_WRITE_REG(timx->SR, ~(TIM_SR_CC4OF));
}

/**
  * @brief  Indicate whether Capture/Compare 4 over-capture interrupt flag (CC4OF) is set
  *         (Capture/Compare 4 over-capture interrupt is pending).
  * @rmtoll
  *  SR           CC4OF         LL_TIM_IsActiveFlag_CC4OVR
  * @param  timx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsActiveFlag_CC4OVR(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->SR, TIM_SR_CC4OF) == (TIM_SR_CC4OF)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the transition error interrupt flag (TERRF).
  * @rmtoll
  *  SR           TERRF           LL_TIM_ClearFlag_TERR
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_ClearFlag_TERR(TIM_TypeDef *timx)
{
  STM32_WRITE_REG(timx->SR, ~(TIM_SR_TERRF));
}

/**
  * @brief  Indicate whether transition error interrupt flag (TERRF) is set (transition error interrupt is pending).
  * @rmtoll
  *  SR           TERRF           LL_TIM_IsActiveFlag_TERR
  * @param  timx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsActiveFlag_TERR(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->SR, TIM_SR_TERRF) == (TIM_SR_TERRF)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the index error interrupt flag (IERRF).
  * @rmtoll
  *  SR           IERRF           LL_TIM_ClearFlag_IERR
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_ClearFlag_IERR(TIM_TypeDef *timx)
{
  STM32_WRITE_REG(timx->SR, ~(TIM_SR_IERRF));
}

/**
  * @brief  Indicate whether index error interrupt flag (IERRF) is set (index error interrupt is pending).
  * @rmtoll
  *  SR           IERRF           LL_TIM_IsActiveFlag_IERR
  * @param  timx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsActiveFlag_IERR(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->SR, TIM_SR_IERRF) == (TIM_SR_IERRF)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the direction change interrupt flag (DIRF).
  * @rmtoll
  *  SR           DIRF           LL_TIM_ClearFlag_DIR
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_ClearFlag_DIR(TIM_TypeDef *timx)
{
  STM32_WRITE_REG(timx->SR, ~(TIM_SR_DIRF));
}

/**
  * @brief  Indicate whether direction change interrupt flag (DIRF) is set (direction change interrupt is pending).
  * @rmtoll
  *  SR           DIRF           LL_TIM_IsActiveFlag_DIR
  * @param  timx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsActiveFlag_DIR(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->SR, TIM_SR_DIRF) == (TIM_SR_DIRF)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the index interrupt flag (IDXF).
  * @rmtoll
  *  SR           IDXF           LL_TIM_ClearFlag_IDX
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_ClearFlag_IDX(TIM_TypeDef *timx)
{
  STM32_WRITE_REG(timx->SR, ~(TIM_SR_IDXF));
}

/**
  * @brief  Indicate whether index interrupt flag (IDXF) is set (index interrupt is pending).
  * @rmtoll
  *  SR           IDXF           LL_TIM_IsActiveFlag_IDX
  * @param  timx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsActiveFlag_IDX(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->SR, TIM_SR_IDXF) == (TIM_SR_IDXF)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the overrun flag (UIOVRF).
  * @rmtoll
  *  SR           UIOVRF         LL_TIM_ClearFlag_UIOVR
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_ClearFlag_UIOVR(TIM_TypeDef *timx)
{
  STM32_WRITE_REG(timx->SR, ~(TIM_SR_UIOVRF));
}

/**
  * @brief  Indicate whether overrun flag (UIOVRF) is set (another interrupt is pending).
  * @rmtoll
  *  SR           UIOVRF         LL_TIM_IsActiveFlag_UIOVR
  * @param  timx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsActiveFlag_UIOVR(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->SR, TIM_SR_UIOVRF) == (TIM_SR_UIOVRF)) ? 1UL : 0UL);
}
/**
  * @}
  */

/** @defgroup TIM_LL_EF_IT_Management IT-Management
  * @{
  */
/**
  * @brief  Enable update interrupt (UIE).
  * @rmtoll
  *  DIER         UIE           LL_TIM_EnableIT_UPDATE
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_EnableIT_UPDATE(TIM_TypeDef *timx)
{
  STM32_SET_BIT(timx->DIER, TIM_DIER_UIE);
}

/**
  * @brief  Disable update interrupt (UIE).
  * @rmtoll
  *  DIER         UIE           LL_TIM_DisableIT_UPDATE
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_DisableIT_UPDATE(TIM_TypeDef *timx)
{
  STM32_CLEAR_BIT(timx->DIER, TIM_DIER_UIE);
}

/**
  * @brief  Indicates whether the update interrupt (UIE) is enabled.
  * @rmtoll
  *  DIER         UIE           LL_TIM_IsEnabledIT_UPDATE
  * @param  timx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsEnabledIT_UPDATE(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->DIER, TIM_DIER_UIE) == (TIM_DIER_UIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable capture/compare 1 interrupt (CC1IE).
  * @rmtoll
  *  DIER         CC1IE         LL_TIM_EnableIT_CC1
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_EnableIT_CC1(TIM_TypeDef *timx)
{
  STM32_SET_BIT(timx->DIER, TIM_DIER_CC1IE);
}

/**
  * @brief  Disable capture/compare 1  interrupt (CC1IE).
  * @rmtoll
  *  DIER         CC1IE         LL_TIM_DisableIT_CC1
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_DisableIT_CC1(TIM_TypeDef *timx)
{
  STM32_CLEAR_BIT(timx->DIER, TIM_DIER_CC1IE);
}

/**
  * @brief  Indicates whether the capture/compare 1 interrupt (CC1IE) is enabled.
  * @rmtoll
  *  DIER         CC1IE         LL_TIM_IsEnabledIT_CC1
  * @param  timx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsEnabledIT_CC1(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->DIER, TIM_DIER_CC1IE) == (TIM_DIER_CC1IE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable capture/compare 2 interrupt (CC2IE).
  * @rmtoll
  *  DIER         CC2IE         LL_TIM_EnableIT_CC2
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_EnableIT_CC2(TIM_TypeDef *timx)
{
  STM32_SET_BIT(timx->DIER, TIM_DIER_CC2IE);
}

/**
  * @brief  Disable capture/compare 2  interrupt (CC2IE).
  * @rmtoll
  *  DIER         CC2IE         LL_TIM_DisableIT_CC2
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_DisableIT_CC2(TIM_TypeDef *timx)
{
  STM32_CLEAR_BIT(timx->DIER, TIM_DIER_CC2IE);
}

/**
  * @brief  Indicates whether the capture/compare 2 interrupt (CC2IE) is enabled.
  * @rmtoll
  *  DIER         CC2IE         LL_TIM_IsEnabledIT_CC2
  * @param  timx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsEnabledIT_CC2(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->DIER, TIM_DIER_CC2IE) == (TIM_DIER_CC2IE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable capture/compare 3 interrupt (CC3IE).
  * @rmtoll
  *  DIER         CC3IE         LL_TIM_EnableIT_CC3
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_EnableIT_CC3(TIM_TypeDef *timx)
{
  STM32_SET_BIT(timx->DIER, TIM_DIER_CC3IE);
}

/**
  * @brief  Disable capture/compare 3  interrupt (CC3IE).
  * @rmtoll
  *  DIER         CC3IE         LL_TIM_DisableIT_CC3
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_DisableIT_CC3(TIM_TypeDef *timx)
{
  STM32_CLEAR_BIT(timx->DIER, TIM_DIER_CC3IE);
}

/**
  * @brief  Indicates whether the capture/compare 3 interrupt (CC3IE) is enabled.
  * @rmtoll
  *  DIER         CC3IE         LL_TIM_IsEnabledIT_CC3
  * @param  timx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsEnabledIT_CC3(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->DIER, TIM_DIER_CC3IE) == (TIM_DIER_CC3IE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable capture/compare 4 interrupt (CC4IE).
  * @rmtoll
  *  DIER         CC4IE         LL_TIM_EnableIT_CC4
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_EnableIT_CC4(TIM_TypeDef *timx)
{
  STM32_SET_BIT(timx->DIER, TIM_DIER_CC4IE);
}

/**
  * @brief  Disable capture/compare 4  interrupt (CC4IE).
  * @rmtoll
  *  DIER         CC4IE         LL_TIM_DisableIT_CC4
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_DisableIT_CC4(TIM_TypeDef *timx)
{
  STM32_CLEAR_BIT(timx->DIER, TIM_DIER_CC4IE);
}

/**
  * @brief  Indicates whether the capture/compare 4 interrupt (CC4IE) is enabled.
  * @rmtoll
  *  DIER         CC4IE         LL_TIM_IsEnabledIT_CC4
  * @param  timx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsEnabledIT_CC4(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->DIER, TIM_DIER_CC4IE) == (TIM_DIER_CC4IE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable commutation interrupt (COMIE).
  * @rmtoll
  *  DIER         COMIE         LL_TIM_EnableIT_COM
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_EnableIT_COM(TIM_TypeDef *timx)
{
  STM32_SET_BIT(timx->DIER, TIM_DIER_COMIE);
}

/**
  * @brief  Disable commutation interrupt (COMIE).
  * @rmtoll
  *  DIER         COMIE         LL_TIM_DisableIT_COM
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_DisableIT_COM(TIM_TypeDef *timx)
{
  STM32_CLEAR_BIT(timx->DIER, TIM_DIER_COMIE);
}

/**
  * @brief  Indicates whether the commutation interrupt (COMIE) is enabled.
  * @rmtoll
  *  DIER         COMIE         LL_TIM_IsEnabledIT_COM
  * @param  timx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsEnabledIT_COM(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->DIER, TIM_DIER_COMIE) == (TIM_DIER_COMIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable trigger interrupt (TIE).
  * @rmtoll
  *  DIER         TIE           LL_TIM_EnableIT_TRIG
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_EnableIT_TRIG(TIM_TypeDef *timx)
{
  STM32_SET_BIT(timx->DIER, TIM_DIER_TIE);
}

/**
  * @brief  Disable trigger interrupt (TIE).
  * @rmtoll
  *  DIER         TIE           LL_TIM_DisableIT_TRIG
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_DisableIT_TRIG(TIM_TypeDef *timx)
{
  STM32_CLEAR_BIT(timx->DIER, TIM_DIER_TIE);
}

/**
  * @brief  Indicates whether the trigger interrupt (TIE) is enabled.
  * @rmtoll
  *  DIER         TIE           LL_TIM_IsEnabledIT_TRIG
  * @param  timx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsEnabledIT_TRIG(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->DIER, TIM_DIER_TIE) == (TIM_DIER_TIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable break interrupt (BIE).
  * @rmtoll
  *  DIER         BIE           LL_TIM_EnableIT_BRK
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_EnableIT_BRK(TIM_TypeDef *timx)
{
  STM32_SET_BIT(timx->DIER, TIM_DIER_BIE);
}

/**
  * @brief  Disable break interrupt (BIE).
  * @rmtoll
  *  DIER         BIE           LL_TIM_DisableIT_BRK
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_DisableIT_BRK(TIM_TypeDef *timx)
{
  STM32_CLEAR_BIT(timx->DIER, TIM_DIER_BIE);
}

/**
  * @brief  Indicates whether the break interrupt (BIE) is enabled.
  * @rmtoll
  *  DIER         BIE           LL_TIM_IsEnabledIT_BRK
  * @param  timx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsEnabledIT_BRK(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->DIER, TIM_DIER_BIE) == (TIM_DIER_BIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable transition error interrupt (TERRIE).
  * @rmtoll
  *  DIER         TERRIE           LL_TIM_EnableIT_TERR
  * @param  timx Timer instance
  * @note Macro IS_TIM_ENCODER_ERROR_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides encoder error management.
  */
__STATIC_INLINE void LL_TIM_EnableIT_TERR(TIM_TypeDef *timx)
{
  STM32_SET_BIT(timx->DIER, TIM_DIER_TERRIE);
}

/**
  * @brief  Disable transition error interrupt (TERRIE).
  * @rmtoll
  *  DIER         TERRIE           LL_TIM_DisableIT_TERR
  * @param  timx Timer instance
  * @note Macro IS_TIM_ENCODER_ERROR_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides encoder error management.
  */
__STATIC_INLINE void LL_TIM_DisableIT_TERR(TIM_TypeDef *timx)
{
  STM32_CLEAR_BIT(timx->DIER, TIM_DIER_TERRIE);
}

/**
  * @brief  Indicates whether the transition error interrupt (TERRIE) is enabled.
  * @rmtoll
  *  DIER         TERRIE           LL_TIM_IsEnabledIT_TERR
  * @param  timx Timer instance
  * @note Macro IS_TIM_ENCODER_ERROR_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides encoder error management.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsEnabledIT_TERR(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->DIER, TIM_DIER_TERRIE) == (TIM_DIER_TERRIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable index error interrupt (IERRIE).
  * @rmtoll
  *  DIER         IERRIE           LL_TIM_EnableIT_IERR
  * @param  timx Timer instance
  * @note Macro IS_TIM_ENCODER_ERROR_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides encoder error management.
  */
__STATIC_INLINE void LL_TIM_EnableIT_IERR(TIM_TypeDef *timx)
{
  STM32_SET_BIT(timx->DIER, TIM_DIER_IERRIE);
}

/**
  * @brief  Disable index error interrupt (IERRIE).
  * @rmtoll
  *  DIER         IERRIE           LL_TIM_DisableIT_IERR
  * @param  timx Timer instance
  * @note Macro IS_TIM_ENCODER_ERROR_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides encoder error management.
  */
__STATIC_INLINE void LL_TIM_DisableIT_IERR(TIM_TypeDef *timx)
{
  STM32_CLEAR_BIT(timx->DIER, TIM_DIER_IERRIE);
}

/**
  * @brief  Indicates whether the index error interrupt (IERRIE) is enabled.
  * @rmtoll
  *  DIER         IERRIE           LL_TIM_IsEnabledIT_IERR
  * @param  timx Timer instance
  * @note Macro IS_TIM_ENCODER_ERROR_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides encoder error management.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsEnabledIT_IERR(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->DIER, TIM_DIER_IERRIE) == (TIM_DIER_IERRIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable direction change interrupt (DIRIE).
  * @rmtoll
  *  DIER         DIRIE           LL_TIM_EnableIT_DIR
  * @param  timx Timer instance
  * @note Macro IS_TIM_FUNCTINONAL_ENCODER_INTERRUPT_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides encoder interrupt management.
  */
__STATIC_INLINE void LL_TIM_EnableIT_DIR(TIM_TypeDef *timx)
{
  STM32_SET_BIT(timx->DIER, TIM_DIER_DIRIE);
}

/**
  * @brief  Disable direction change interrupt (DIRIE).
  * @rmtoll
  *  DIER         DIRIE           LL_TIM_DisableIT_DIR
  * @param  timx Timer instance
  * @note Macro IS_TIM_FUNCTINONAL_ENCODER_INTERRUPT_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides encoder interrupt management.
  */
__STATIC_INLINE void LL_TIM_DisableIT_DIR(TIM_TypeDef *timx)
{
  STM32_CLEAR_BIT(timx->DIER, TIM_DIER_DIRIE);
}

