MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_tim.h
/**
  * @brief  Indicates whether the direction change interrupt (DIRIE) is enabled.
  * @rmtoll
  *  DIER         DIRIE           LL_TIM_IsEnabledIT_DIR
  * @param  timx Timer instance
  * @note Macro IS_TIM_FUNCTINONAL_ENCODER_INTERRUPT_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides encoder interrupt management.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsEnabledIT_DIR(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->DIER, TIM_DIER_DIRIE) == (TIM_DIER_DIRIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable index interrupt (IDXIE).
  * @rmtoll
  *  DIER         IDXIE           LL_TIM_EnableIT_IDX
  * @param  timx Timer instance
  * @note Macro IS_TIM_FUNCTINONAL_ENCODER_INTERRUPT_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides encoder interrupt management.
  */
__STATIC_INLINE void LL_TIM_EnableIT_IDX(TIM_TypeDef *timx)
{
  STM32_SET_BIT(timx->DIER, TIM_DIER_IDXIE);
}

/**
  * @brief  Disable index interrupt (IDXIE).
  * @rmtoll
  *  DIER         IDXIE           LL_TIM_DisableIT_IDX
  * @param  timx Timer instance
  * @note Macro IS_TIM_FUNCTINONAL_ENCODER_INTERRUPT_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides encoder interrupt management.
  */
__STATIC_INLINE void LL_TIM_DisableIT_IDX(TIM_TypeDef *timx)
{
  STM32_CLEAR_BIT(timx->DIER, TIM_DIER_IDXIE);
}

/**
  * @brief  Indicates whether the index interrupt (IDXIE) is enabled.
  * @rmtoll
  *  DIER         IDXIE           LL_TIM_IsEnabledIT_IDX
  * @param  timx Timer instance
  * @note Macro IS_TIM_FUNCTINONAL_ENCODER_INTERRUPT_INSTANCE(timx) can be used to check whether or not
  *       a timer instance provides encoder interrupt management.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsEnabledIT_IDX(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->DIER, TIM_DIER_IDXIE) == (TIM_DIER_IDXIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the interrupt(s).
  * @rmtoll
  *  DIER         BIE             LL_TIM_EnableIT \n
  *  DIER         UIE             LL_TIM_EnableIT \n
  *  DIER         CC1IE           LL_TIM_EnableIT \n
  *  DIER         CC2IE           LL_TIM_EnableIT \n
  *  DIER         CC3IE           LL_TIM_EnableIT \n
  *  DIER         CC4IE           LL_TIM_EnableIT \n
  *  DIER         COMIE           LL_TIM_EnableIT \n
  *  DIER         IDXIE           LL_TIM_EnableIT \n
  *  DIER         DIRIE           LL_TIM_EnableIT \n
  *  DIER         IERRIE          LL_TIM_EnableIT \n
  *  DIER         TERRIE          LL_TIM_EnableIT \n
  *  DIER         TIE             LL_TIM_EnableIT
  * @param  timx Timer instance
  * @param  it_mask specifies the interrupt source(s) to enable.
  *         This parameter can be any combination of the following values:
  *         @arg @ref LL_TIM_DIER_UIE
  *         @arg @ref LL_TIM_DIER_CC1IE
  *         @arg @ref LL_TIM_DIER_CC2IE
  *         @arg @ref LL_TIM_DIER_CC3IE
  *         @arg @ref LL_TIM_DIER_CC4IE
  *         @arg @ref LL_TIM_DIER_COMIE
  *         @arg @ref LL_TIM_DIER_TIE
  *         @arg @ref LL_TIM_DIER_BIE
  *         @arg @ref LL_TIM_DIER_IDXIE
  *         @arg @ref LL_TIM_DIER_DIRIE
  *         @arg @ref LL_TIM_DIER_IERRIE
  *         @arg @ref LL_TIM_DIER_TERRIE
  */
__STATIC_INLINE void LL_TIM_EnableIT(TIM_TypeDef *timx, uint32_t it_mask)
{
  STM32_SET_BIT(timx->DIER, it_mask);
}

/**
  * @brief  Disable the interrupt(s).
  * @rmtoll
  *  DIER         BIE             LL_TIM_DisableIT \n
  *  DIER         UIE             LL_TIM_DisableIT \n
  *  DIER         CC1IE           LL_TIM_DisableIT \n
  *  DIER         CC2IE           LL_TIM_DisableIT \n
  *  DIER         CC3IE           LL_TIM_DisableIT \n
  *  DIER         CC4IE           LL_TIM_DisableIT \n
  *  DIER         COMIE           LL_TIM_DisableIT \n
  *  DIER         IDXIE           LL_TIM_DisableIT \n
  *  DIER         DIRIE           LL_TIM_DisableIT \n
  *  DIER         IERRIE          LL_TIM_DisableIT \n
  *  DIER         TERRIE          LL_TIM_DisableIT \n
  *  DIER         TIE             LL_TIM_DisableIT
  * @param  timx Timer instance
  * @param  it_mask specifies the interrupt source(s) to disable.
  *         This parameter can be any combination of the following values:
  *         @arg @ref LL_TIM_DIER_UIE
  *         @arg @ref LL_TIM_DIER_CC1IE
  *         @arg @ref LL_TIM_DIER_CC2IE
  *         @arg @ref LL_TIM_DIER_CC3IE
  *         @arg @ref LL_TIM_DIER_CC4IE
  *         @arg @ref LL_TIM_DIER_COMIE
  *         @arg @ref LL_TIM_DIER_TIE
  *         @arg @ref LL_TIM_DIER_BIE
  *         @arg @ref LL_TIM_DIER_IDXIE
  *         @arg @ref LL_TIM_DIER_DIRIE
  *         @arg @ref LL_TIM_DIER_IERRIE
  *         @arg @ref LL_TIM_DIER_TERRIE
  */
__STATIC_INLINE void LL_TIM_DisableIT(TIM_TypeDef *timx, uint32_t it_mask)
{
  STM32_CLEAR_BIT(timx->DIER, it_mask);
}
/**
  * @}
  */

/** @defgroup TIM_LL_EF_DMA_Management DMA Management
  * @{
  */
/**
  * @brief  Enable update DMA request (UDE).
  * @rmtoll
  *  DIER         UDE           LL_TIM_EnableDMAReq_UPDATE
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_EnableDMAReq_UPDATE(TIM_TypeDef *timx)
{
  STM32_SET_BIT(timx->DIER, TIM_DIER_UDE);
}

/**
  * @brief  Disable update DMA request (UDE).
  * @rmtoll
  *  DIER         UDE           LL_TIM_DisableDMAReq_UPDATE
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_DisableDMAReq_UPDATE(TIM_TypeDef *timx)
{
  STM32_CLEAR_BIT(timx->DIER, TIM_DIER_UDE);
}

/**
  * @brief  Indicates whether the update DMA request  (UDE) is enabled.
  * @rmtoll
  *  DIER         UDE           LL_TIM_IsEnabledDMAReq_UPDATE
  * @param  timx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsEnabledDMAReq_UPDATE(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->DIER, TIM_DIER_UDE) == (TIM_DIER_UDE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable capture/compare 1 DMA request (CC1DE).
  * @rmtoll
  *  DIER         CC1DE         LL_TIM_EnableDMAReq_CC1
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_EnableDMAReq_CC1(TIM_TypeDef *timx)
{
  STM32_SET_BIT(timx->DIER, TIM_DIER_CC1DE);
}

/**
  * @brief  Disable capture/compare 1  DMA request (CC1DE).
  * @rmtoll
  *  DIER         CC1DE         LL_TIM_DisableDMAReq_CC1
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_DisableDMAReq_CC1(TIM_TypeDef *timx)
{
  STM32_CLEAR_BIT(timx->DIER, TIM_DIER_CC1DE);
}

/**
  * @brief  Indicates whether the capture/compare 1 DMA request (CC1DE) is enabled.
  * @rmtoll
  *  DIER         CC1DE         LL_TIM_IsEnabledDMAReq_CC1
  * @param  timx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsEnabledDMAReq_CC1(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->DIER, TIM_DIER_CC1DE) == (TIM_DIER_CC1DE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable capture/compare 2 DMA request (CC2DE).
  * @rmtoll
  *  DIER         CC2DE         LL_TIM_EnableDMAReq_CC2
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_EnableDMAReq_CC2(TIM_TypeDef *timx)
{
  STM32_SET_BIT(timx->DIER, TIM_DIER_CC2DE);
}

/**
  * @brief  Disable capture/compare 2  DMA request (CC2DE).
  * @rmtoll
  *  DIER         CC2DE         LL_TIM_DisableDMAReq_CC2
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_DisableDMAReq_CC2(TIM_TypeDef *timx)
{
  STM32_CLEAR_BIT(timx->DIER, TIM_DIER_CC2DE);
}

/**
  * @brief  Indicates whether the capture/compare 2 DMA request (CC2DE) is enabled.
  * @rmtoll
  *  DIER         CC2DE         LL_TIM_IsEnabledDMAReq_CC2
  * @param  timx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsEnabledDMAReq_CC2(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->DIER, TIM_DIER_CC2DE) == (TIM_DIER_CC2DE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable capture/compare 3 DMA request (CC3DE).
  * @rmtoll
  *  DIER         CC3DE         LL_TIM_EnableDMAReq_CC3
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_EnableDMAReq_CC3(TIM_TypeDef *timx)
{
  STM32_SET_BIT(timx->DIER, TIM_DIER_CC3DE);
}

/**
  * @brief  Disable capture/compare 3  DMA request (CC3DE).
  * @rmtoll
  *  DIER         CC3DE         LL_TIM_DisableDMAReq_CC3
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_DisableDMAReq_CC3(TIM_TypeDef *timx)
{
  STM32_CLEAR_BIT(timx->DIER, TIM_DIER_CC3DE);
}

/**
  * @brief  Indicates whether the capture/compare 3 DMA request (CC3DE) is enabled.
  * @rmtoll
  *  DIER         CC3DE         LL_TIM_IsEnabledDMAReq_CC3
  * @param  timx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsEnabledDMAReq_CC3(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->DIER, TIM_DIER_CC3DE) == (TIM_DIER_CC3DE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable capture/compare 4 DMA request (CC4DE).
  * @rmtoll
  *  DIER         CC4DE         LL_TIM_EnableDMAReq_CC4
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_EnableDMAReq_CC4(TIM_TypeDef *timx)
{
  STM32_SET_BIT(timx->DIER, TIM_DIER_CC4DE);
}

/**
  * @brief  Disable capture/compare 4  DMA request (CC4DE).
  * @rmtoll
  *  DIER         CC4DE         LL_TIM_DisableDMAReq_CC4
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_DisableDMAReq_CC4(TIM_TypeDef *timx)
{
  STM32_CLEAR_BIT(timx->DIER, TIM_DIER_CC4DE);
}

/**
  * @brief  Indicates whether the capture/compare 4 DMA request (CC4DE) is enabled.
  * @rmtoll
  *  DIER         CC4DE         LL_TIM_IsEnabledDMAReq_CC4
  * @param  timx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsEnabledDMAReq_CC4(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->DIER, TIM_DIER_CC4DE) == (TIM_DIER_CC4DE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable commutation DMA request (COMDE).
  * @rmtoll
  *  DIER         COMDE         LL_TIM_EnableDMAReq_COM
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_EnableDMAReq_COM(TIM_TypeDef *timx)
{
  STM32_SET_BIT(timx->DIER, TIM_DIER_COMDE);
}

/**
  * @brief  Disable commutation DMA request (COMDE).
  * @rmtoll
  *  DIER         COMDE         LL_TIM_DisableDMAReq_COM
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_DisableDMAReq_COM(TIM_TypeDef *timx)
{
  STM32_CLEAR_BIT(timx->DIER, TIM_DIER_COMDE);
}

/**
  * @brief  Indicates whether the commutation DMA request (COMDE) is enabled.
  * @rmtoll
  *  DIER         COMDE         LL_TIM_IsEnabledDMAReq_COM
  * @param  timx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsEnabledDMAReq_COM(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->DIER, TIM_DIER_COMDE) == (TIM_DIER_COMDE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable trigger interrupt (TDE).
  * @rmtoll
  *  DIER         TDE           LL_TIM_EnableDMAReq_TRIG
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_EnableDMAReq_TRIG(TIM_TypeDef *timx)
{
  STM32_SET_BIT(timx->DIER, TIM_DIER_TDE);
}

/**
  * @brief  Disable trigger interrupt (TDE).
  * @rmtoll
  *  DIER         TDE           LL_TIM_DisableDMAReq_TRIG
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_DisableDMAReq_TRIG(TIM_TypeDef *timx)
{
  STM32_CLEAR_BIT(timx->DIER, TIM_DIER_TDE);
}

/**
  * @brief  Indicates whether the trigger interrupt (TDE) is enabled.
  * @rmtoll
  *  DIER         TDE           LL_TIM_IsEnabledDMAReq_TRIG
  * @param  timx Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TIM_IsEnabledDMAReq_TRIG(const TIM_TypeDef *timx)
{
  return ((STM32_READ_BIT(timx->DIER, TIM_DIER_TDE) == (TIM_DIER_TDE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the selected dma request(s).
  * @rmtoll
  *  DIER         UDE             LL_TIM_EnableDMAReq \n
  *  DIER         CC1DE           LL_TIM_EnableDMAReq \n
  *  DIER         CC2DE           LL_TIM_EnableDMAReq \n
  *  DIER         CC3DE           LL_TIM_EnableDMAReq \n
  *  DIER         CC4DE           LL_TIM_EnableDMAReq \n
  *  DIER         COMDE           LL_TIM_EnableDMAReq \n
  *  DIER         TDE             LL_TIM_EnableDMAReq
  * @param  timx Timer instance
  * @param  dma_mask specifies the DMA request source(s) to enable.
  *         This parameter can be any combination of the following values:
  *         @arg @ref LL_TIM_DIER_UDE
  *         @arg @ref LL_TIM_DIER_CC1DE
  *         @arg @ref LL_TIM_DIER_CC2DE
  *         @arg @ref LL_TIM_DIER_CC3DE
  *         @arg @ref LL_TIM_DIER_CC4DE
  *         @arg @ref LL_TIM_DIER_COMDE
  *         @arg @ref LL_TIM_DIER_TDE
  */
__STATIC_INLINE void LL_TIM_EnableDMAReq(TIM_TypeDef *timx, uint32_t dma_mask)
{
  STM32_SET_BIT(timx->DIER, dma_mask);
}

/**
  * @brief  Disable the selected dma request(s).
  * @rmtoll
  *  DIER         UDE             LL_TIM_DisableDMAReq \n
  *  DIER         CC1DE           LL_TIM_DisableDMAReq \n
  *  DIER         CC2DE           LL_TIM_DisableDMAReq \n
  *  DIER         CC3DE           LL_TIM_DisableDMAReq \n
  *  DIER         CC4DE           LL_TIM_DisableDMAReq \n
  *  DIER         COMDE           LL_TIM_DisableDMAReq \n
  *  DIER         TDE             LL_TIM_DisableDMAReq
  * @param  timx Timer instance
  * @param  dma_mask specifies the DMA request source(s) to disable.
  *         This parameter can be any combination of the following values:
  *         @arg @ref LL_TIM_DIER_UDE
  *         @arg @ref LL_TIM_DIER_CC1DE
  *         @arg @ref LL_TIM_DIER_CC2DE
  *         @arg @ref LL_TIM_DIER_CC3DE
  *         @arg @ref LL_TIM_DIER_CC4DE
  *         @arg @ref LL_TIM_DIER_COMDE
  *         @arg @ref LL_TIM_DIER_TDE
  */
__STATIC_INLINE void LL_TIM_DisableDMAReq(TIM_TypeDef *timx, uint32_t dma_mask)
{
  STM32_CLEAR_BIT(timx->DIER, dma_mask);
}

/**
  * @}
  */

