MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_tim.h
/** @defgroup TIM_LL_EF_EVENT_Management EVENT-Management
  * @{
  */
/**
  * @brief  Generate an update event.
  * @rmtoll
  *  EGR          UG            LL_TIM_GenerateEvent_UPDATE
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_GenerateEvent_UPDATE(TIM_TypeDef *timx)
{
  STM32_SET_BIT(timx->EGR, TIM_EGR_UG);
}

/**
  * @brief  Generate Capture/Compare 1 event.
  * @rmtoll
  *  EGR          CC1G          LL_TIM_GenerateEvent_CC1
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_GenerateEvent_CC1(TIM_TypeDef *timx)
{
  STM32_SET_BIT(timx->EGR, TIM_EGR_CC1G);
}

/**
  * @brief  Generate Capture/Compare 2 event.
  * @rmtoll
  *  EGR          CC2G          LL_TIM_GenerateEvent_CC2
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_GenerateEvent_CC2(TIM_TypeDef *timx)
{
  STM32_SET_BIT(timx->EGR, TIM_EGR_CC2G);
}

/**
  * @brief  Generate Capture/Compare 3 event.
  * @rmtoll
  *  EGR          CC3G          LL_TIM_GenerateEvent_CC3
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_GenerateEvent_CC3(TIM_TypeDef *timx)
{
  STM32_SET_BIT(timx->EGR, TIM_EGR_CC3G);
}

/**
  * @brief  Generate Capture/Compare 4 event.
  * @rmtoll
  *  EGR          CC4G          LL_TIM_GenerateEvent_CC4
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_GenerateEvent_CC4(TIM_TypeDef *timx)
{
  STM32_SET_BIT(timx->EGR, TIM_EGR_CC4G);
}

/**
  * @brief  Generate commutation event.
  * @rmtoll
  *  EGR          COMG          LL_TIM_GenerateEvent_COM
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_GenerateEvent_COM(TIM_TypeDef *timx)
{
  STM32_SET_BIT(timx->EGR, TIM_EGR_COMG);
}

/**
  * @brief  Generate trigger event.
  * @rmtoll
  *  EGR          TG            LL_TIM_GenerateEvent_TRIG
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_GenerateEvent_TRIG(TIM_TypeDef *timx)
{
  STM32_SET_BIT(timx->EGR, TIM_EGR_TG);
}

/**
  * @brief  Generate break event.
  * @rmtoll
  *  EGR          BG            LL_TIM_GenerateEvent_BRK
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_GenerateEvent_BRK(TIM_TypeDef *timx)
{
  STM32_SET_BIT(timx->EGR, TIM_EGR_BG);
}

/**
  * @brief  Generate break 2 event.
  * @rmtoll
  *  EGR          B2G           LL_TIM_GenerateEvent_BRK2
  * @param  timx Timer instance
  */
__STATIC_INLINE void LL_TIM_GenerateEvent_BRK2(TIM_TypeDef *timx)
{
  STM32_SET_BIT(timx->EGR, TIM_EGR_B2G);
}


/**
  * @brief  Generate software event(s).
  * @rmtoll
  *  EGR          UG            LL_TIM_GenerateEvent \n
  *  EGR          CC1G          LL_TIM_GenerateEvent \n
  *  EGR          CC2G          LL_TIM_GenerateEvent \n
  *  EGR          CC3G          LL_TIM_GenerateEvent \n
  *  EGR          CC4G          LL_TIM_GenerateEvent \n
  *  EGR          COMG          LL_TIM_GenerateEvent \n
  *  EGR          TG            LL_TIM_GenerateEvent \n
  *  EGR          BG            LL_TIM_GenerateEvent \n
  *  EGR          B2G           LL_TIM_GenerateEvent
  * @param  timx Timer instance
  * @param  software_event specifies the software event source(s) to generate.
  *         This parameter can be any combination of the following values:
  *         @arg @ref LL_TIM_SW_EVENT_UPD
  *         @arg @ref LL_TIM_SW_EVENT_CC1
  *         @arg @ref LL_TIM_SW_EVENT_CC2
  *         @arg @ref LL_TIM_SW_EVENT_CC3
  *         @arg @ref LL_TIM_SW_EVENT_CC4
  *         @arg @ref LL_TIM_SW_EVENT_COM
  *         @arg @ref LL_TIM_SW_EVENT_TRGI
  *         @arg @ref LL_TIM_SW_EVENT_BRK
  *         @arg @ref LL_TIM_SW_EVENT_BRK2
  */
__STATIC_INLINE void LL_TIM_GenerateEvent(TIM_TypeDef *timx, uint32_t software_event)
{
  STM32_SET_BIT(timx->EGR, software_event);
}
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* TIM1 || TIM2 || TIM3 || TIM4 || TIM5 || TIM6 || TIM7 || TIM8 || TIM12 || TIM15 || TIM16 || TIM17 */
/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32C5XX_LL_TIM_H */

